[
  {
    "title": "Ambuja Cement Q4 Results: Profit At Rs 956 Crore, Beats Estimates",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/ambuja-cement-q4-results-profit-at-rs-956-crore-beats-estimates",
    "summary": "Ambuja Cements Ltd., a major player in the cement industry and part of the Adani Group, reported its fourth-quarter financial results for the period ending March 2025. The company achieved a consolidated profit of **₹956 crore**, exceeding analyst estimates, with consolidated revenue from operations reaching **₹9,802 crore**, a significant increase from **₹8,785 crore** the previous year. This 11.6% year-on-year revenue growth marks an upward trend for the company.\n\nKey financial highlights for Q4 FY25 include:\n\n• **Earnings Before Interest, Taxes, Depreciation, and Amortization (EBITDA):** Grew by **12%** to **₹1,781 crore**, compared to **₹1,590 crore** in the same quarter last year, surpassing market expectations of **₹1,645 crore**.\n\n• **Operating Margin:** Improved slightly to **18.2%**, up from **18.1%** year over year and ahead of the expected **16.6%** margin.\n\n• **Net Profit:** The reported profit of **₹956 crore** was higher than the previous year's profit of **₹1,051 crore**, and also outperformed estimates anticipating a profit of **₹735 crore**.\n\nThis positive financial performance indicates strong operational management and resilience in a competitive market, further reinforcing Ambuja Cements' position in the construction materials sector."
  },
  {
    "title": "Mazagon Dock Shipbuilders, ICICI Bank among 5 stocks that hit 52-week highs on Tuesday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/mazagon-dock-shipbuilders-icici-bank-among-5-stocks-that-hit-52-week-highs-on-tuesday/slideshow/120726084.cms",
    "summary": "Indian benchmark indices experienced a positive movement on April 29, 2025, largely attributed to the easing of trade tensions between the United States and its global partners, coupled with robust foreign investment inflows which fostered a favorable investor sentiment.\n\nKey highlights include:\n\n• **Stocks Achieving 52-Week Highs:** Five companies from the Nifty 500 index reported significant achievements in their share prices, reaching new 52-week highs. The notable stocks and their corresponding gains are as follows:\n  - **Mazagon Dock Shipbuilders:** Price reached Rs 3,034, marking an increase of 20% year-to-date (YTD).\n  - **Solar Industries:** Share price soared to Rs 13,664, representing a 34% YTD rise.\n  - **BSE Ltd.:** Hit a high of Rs 6,808, up by 23% YTD.\n  - **Coromandel International:** Increased to Rs 2,296, reflecting an 18% YTD gain.\n  - **ICICI Bank:** Achieved a price of Rs 1,438, which is an 11% increase YTD.\n\nThese market movements indicate a resilient economic environment, buoyed by improved investor confidence and external economic conditions."
  },
  {
    "title": "Canara HSBC Life Insurance files DRHP with Sebi for IPO",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/canara-hsbc-life-insurance-files-drhp-with-sebi-for-ipo/articleshow/120725292.cms",
    "summary": "Canara HSBC Life Insurance Company has submitted its Draft Red Herring Prospectus (DRHP) to the Securities and Exchange Board of India (SEBI) in preparation for an Initial Public Offering (IPO). The offering is a pure offer for sale (OFS) consisting of **23.75 crore equity shares** at a face value of **Rs 10 each**. \n\nKey details of the IPO include:\n\n• **Share Distribution:**  \n   - Up to **137.75 million shares** from Canara Bank  \n   - Up to **4.75 million shares** from HSBC Insurance (Asia-Pacific) Holdings Limited  \n   - Up to **95 million shares** from Punjab National Bank, classified as an investor selling shareholder.\n\n• **Promoting Entities:** The company is supported by **Canara Bank** and **HSBC Insurance**, leveraging the strengths of one of India’s major public sector banks and the global brand recognition of HSBC. As of December 31, 2024, Canara Bank ranks as the **fourth-largest public sector bank** in India by total assets, as noted in a CRISIL report.\n\n• **Market Position:** Established in 2007, Canara HSBC has cultivated a strong foothold within the Indian life insurance sector. As of March 31, 2024, it ranks **third** among public-sector-promoted life insurers in terms of assets under management (AUM) and **second** by the number of lives covered.\n\n• **Financial Performance:** The company has reported significant growth in its financial metrics, with its Annualized Premium Equivalent (APE) rising consistently. Notably, its profit after tax has surged at a **CAGR of 232.61%**, increasing from **Rs 102.43 million** in FY22 to **Rs 1,133.17 million** in FY24. For the nine months ending December 31, 2024, the profit was **Rs 848.93 million**.\n\n• **Listing:** The shares are proposed to be listed on both the **BSE** and **NSE**. The Book Running Lead Managers for the IPO include **SBI Capital Markets**, **BNP Paribas**, **HSBC Securities & Capital Markets (India)**, **JM Financial**, and **Motilal Oswal Investment Advisors**.\n\nThis IPO represents a strategic move for Canara HSBC Life Insurance as it seeks to capitalize on its expanding market share and robust financial results."
  },
  {
    "title": "Dolly Khanna’s portfolio sees 6 stocks tumble by 20-35% in CY25",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khannas-portfolio-sees-6-stocks-tumble-by-20-35-in-cy25/slideshow/120725596.cms",
    "summary": "The recent analysis of Dolly Khanna's investment portfolio reveals significant declines among several of her holdings during the calendar year 2025. As of April 28, 2025, her portfolio includes approximately 17 stocks valued at Rs 537 crore. The performance details are as follows:\n\n• **Negative Performance:**\n  - Six stocks experienced notable declines between **20% to 35%**:\n    - **Emkay Global Financial Services:** Down **35%** from Rs 315 to Rs 206 (Khanna's stake: 2.76%, valued at Rs 14 crore).\n    - **Stove Kraft:** Dropped **29%**, from Rs 876 to Rs 622 (1.31% stake, valued at Rs 27 crore).\n    - **National Oxygen:** Fell **24%**, from Rs 134 to Rs 102 (1.22% stake, valued at Rs 64 lakh).\n    - **Savera Industries:** Decreased **22%**, from Rs 167 to Rs 131 (1.25% stake, valued at Rs 2 crore).\n    - **Rajshree Sugars & Chemicals:** Down **19%**, from Rs 57 to Rs 46 (1.12% stake, valued at Rs 2 crore).\n    - **KCP Sugar and Industries Corporation:** Declined **19%**, from Rs 45 to Rs 36 (1.85% stake, valued at Rs 7.6 crore).\n\n• **Positive Performance:**\n  - Two stocks managed to increase in value:\n    - **Som Distilleries and Breweries:** Increased by **26%**, from Rs 110 to Rs 139 (2.41% stake, valued at Rs 69 crore).\n    - **Mangalore Chemicals & Fertilizers:** Surged **45%**, from Rs 154 to Rs 223 (2.18% stake, valued at Rs 58 crore).\n\nThe report emphasizes the volatile nature of stock investments and highlights the critical need for investors to continuously monitor their portfolios to adapt to changing market conditions."
  },
  {
    "title": "China stocks inch lower, Hong Kong up slightly as investors assess tariff impact",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-inch-lower-hong-kong-up-slightly-as-investors-assess-tariff-impact/articleshow/120724738.cms",
    "summary": "China's stock market exhibited a slight decline as investors remain cautious amidst uncertainties related to U.S. tariffs and their implications for the Chinese economy. Key highlights include:\n\n• **Market Performance:** \n  - The Shanghai Composite Index fell by 0.05%, closing at 3,286.65.\n  - The blue-chip CSI300 Index decreased by 0.17%, with the financial sector dipping by 0.39% and consumer staples down 0.51%.\n  - Across the Hong Kong market, the Hang Seng Index rose by 0.16%, driven primarily by technology stocks, which saw a 0.6% increase.\n\n• **Investor Sentiment:** \n  - Investor anxiety prevails due to ongoing trade tensions between the U.S. and China, contributing to a reluctance to make significant investments.\n  - A Reuters poll indicated that China's factory activity is likely contracting due to the pressure from tariffs.\n\n• **Economic Outlook:** \n  - U.S. Treasury Secretary Scott Bessent stated that the onus is on China to alleviate tariff tensions. This remark highlights the conflicting signals characterizing the trade negotiations.\n  - China is currently withholding any new stimulus measures, anticipating that the U.S. will concede in this protracted trade conflict.\n\n• **Market Resilience:** \n  - Analysts, including Nicholas Yeo from Aberdeen Investments, noted that the potential for economic decoupling may be bolstering the relative resilience of Chinese markets compared to others, supported by factors such as light positioning, low valuations, and ongoing government support.\n  - However, Yeo emphasized the necessity for additional stimulus measures to further improve the market's outlook.\n\n• **Market Activity:** \n  - Reduced turnover in the markets is evident with the upcoming Labour Day holiday closing Mainland China's market from May 1 for five days.\n\nThis complex interplay of market dynamics and geopolitical factors continues to shape investment strategies and sentiment towards the Chinese stock market."
  },
  {
    "title": "Infosys Lets Go Of 195 More Trainees, 250 Trainees Opt For Upskilling",
    "url": "https://www.ndtvprofit.com/business/infosys-lets-go-of-195-more-trainees-250-trainees-opt-for-upskilling",
    "summary": "Infosys Ltd. has recently let go of 195 trainees following their performance in training assessment tests. This marks the third round of layoffs for the company, which had previously terminated 240 trainees in April and about 300 in March. The email communication sent to the affected trainees indicated that they failed to meet the requirements of the 'Generic foundation training program' despite being provided with extensive support including preparation time, doubt-clearing sessions, and multiple mock assessments.\n\n• **Upskilling Initiatives:** Of the individuals laid off, approximately 250 have chosen to enroll in upskilling programs, while another 150 have taken advantage of outplacement services being offered. Under these services, the trainees are eligible to receive one month's pay upon completion of their separation agreement and access to training programs tailored for potential roles in the Business Process Management (BPM) sector, as well as an additional 24-week course on IT fundamentals to prepare for future IT career opportunities.\n\n• **Company Policy Review:** Infosys CEO, Salil Parekh, defended the company’s rigorous training and evaluation methods, stating that each new batch of trainees is offered multiple opportunities to succeed. The Karnataka labor ministry had previously investigated the firings following the first round of layoffs and concluded that there were no violations of labor laws after the company clarified its hiring and layoff processes.\n\nThe strategic decisions by Infosys come amid ongoing scrutiny related to workforce management in the IT sector, emphasizing the company's commitment to aligning trainee performance with organizational expectations while providing adequate support for their transition out of the company."
  },
  {
    "title": "FII inflows driven by relative stability, not blind optimism: Saion Mukherjee",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/fii-inflows-driven-by-relative-stability-not-blind-optimism-saion-mukherjee/articleshow/120723537.cms",
    "summary": "The market outlook, articulated by Saion Mukherjee of Nomura, indicates a cautiously optimistic sentiment amidst ongoing global economic uncertainties. Key insights include:\n\n• **Market Performance**: The current market setup displays signs of recovery that were not anticipated; however, caution is advised as challenges remain.\n\n• **Economic Concerns**:\n  - Mukherjee highlights a need to monitor global economic trends and their implications for India's economy in the upcoming 12 months.\n  - Corporate earnings face potential headwinds, and the risk premium has not yet responded to market pressures.\n\n• **Foreign Institutional Investments (FIIs)**:\n  - The past six months have seen FIIs act as net sellers in Indian equities; however, recent trends show a resurgence in FII participation, attributed to improved valuations following market corrections.\n  - The positive perception of India's long-term economic story compared to other markets is drawing foreign investments.\n\n• **Tactical Inflows**: The current FII inflows are perceived as tactical rather than structural, reflecting a reaction to heightened uncertainties, particularly concerning China. Concerns about valuation persist, with earnings forecasts indicating slower growth below 6%.\n\n• **Future Outlook**: While India's market appears resilient and has potential to outperform global counterparts, Mukherjee recommends a selective and cautious approach in investment strategies to navigate the inherent risks.\n\nThe analysis underscores the complexity of the market landscape, advocating for vigilant scrutiny of economic indicators and firm recognition of both opportunities and challenges ahead."
  },
  {
    "title": "Vedanta Q4 Preview: PAT may see robust growth up to 141% YoY, revenue could rise by up to 11%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q4-preview-pat-may-see-robust-growth-up-to-141-yoy-revenue-could-rise-by-up-to-11/articleshow/120723316.cms",
    "summary": "Vedanta is projected to announce strong financial results for its March quarter, with estimates indicating a substantial year-on-year growth in net profit (PAT) ranging between ***116%*** to ***141%***. This growth is expected to translate into a PAT between **Rs 3,287 crore** and **Rs 5,340 crore**. Additionally, revenue from operations is anticipated to rise between ***6.5%*** and ***11%*** compared to the previous year, potentially reaching figures between **Rs 37,820 crore** and **Rs 39,370 crore**.\n\nDespite this impressive growth, a quarter-on-quarter decline in net profit is anticipated, attributed to several factors:\n\n• **Cost Pressures:** Higher costs in the aluminium sector and fluctuating commodity prices may weigh on performance.\n• **Sequential Profitability Decline:** A slight dip in profitability on a sequential basis is forecasted due to the aforementioned cost factors.\n\nBrokerages such as **Nuvama Institutional Equities**, **ICICI Securities**, **Kotak Institutional Equities**, and **Motilal Oswal Financial Services** have provided estimates for Vedanta's performance, key highlights include:\n\n• **Nuvama Institutional Equities**: Projects an adjusted PAT of **Rs 3,540 crore**, reflecting a **133% YoY** increase, yet indicating a **0.2% QoQ** decline. Estimated EBITDA is expected at **Rs 10,830 crore**, up **24% YoY**, but down **2.4% QoQ**.\n  \n• **ICICI Securities**: Forecasts a PAT of **Rs 5,340 crore**, corresponding to a **118% YoY** surge, but a **14%** sequential downturn. Anticipated revenue of **Rs 39,370 crore** shows an **11% YoY** rise.\n  \n• **Kotak Institutional Equities**: Expects a PAT of **Rs 3,287 crore** with a **141% YoY** increase, alongside a **7%** sequential decrease. Revenue could hit **Rs 39,173 crore**, marking a **10.3% YoY** growth.\n\n• **Motilal Oswal**: Predicts a PAT of **Rs 3,384 crore**, signifying a **116% YoY** increase against a **4.6%** sequential decline. Revenue is estimated to stand at **Rs 38,906 crore**, reflecting a **9.6% YoY** growth.\n\nAnalysts will closely monitor management’s guidance on future strategies, particularly regarding its **de-merger plans** and the status of **parent debt**, during the earnings announcement on **April 30**. The insights on operational challenges and commodity pricing trends will also be pivotal in shaping the outlook for Vedanta's future quarters."
  },
  {
    "title": "Avoiding IT,  ferrous metal stocks for potential headwinds from US: Neeraj Dewan",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/avoiding-it-ferrous-metal-stocks-for-potential-headwinds-from-us-neeraj-dewan/articleshow/120723056.cms",
    "summary": "Neeraj Dewan, a market expert, expresses caution regarding large-cap and mid-cap IT stocks due to their high valuations and potential external pressures arising from the US market, suggesting that these stocks may experience profit-taking soon. He is particularly wary of investing in ferrous metals like Tata Steel, which he believes lack clarity and have shown a weak rebound despite recent price corrections. \n\nDewan advocates for a more selective approach to investing in the non-ferrous metal sector, recommending patience as further clarity is needed before purchasing. In contrast, he mentions that defence stocks, such as those associated with Mazagon Dock and HAL, have demonstrated strong performance and may continue to do so given a favorable order flow. He acknowledges the potential for further gains in these stocks as they recover from prior corrections.\n\nKey insights from Dewan's analysis include:\n\n• **IT Stocks Caution:** High valuations are raising concerns about profit-taking.\n• **Ferrous Metals Warnings:** Tata Steel and similar stocks are underperforming due to unclear market conditions.\n• **Defence Sector Strength:** Stocks in this sector are expected to outperform, with solid order inflow anticipated.\n• **Stock Specific Approach:** He emphasizes a stock-specific investment strategy rather than a broad sector-based approach.\n\nDewan's insights serve as a guide for investors considering market entry or adjustments amid fluctuations influenced by global trends. His recommendations reflect a strategy focused on minimizing risk while identifying sectors with growth potential."
  },
  {
    "title": "Broader market yet to break out; stay selective amid rebound: Vinit Sambre",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/broader-market-yet-to-break-out-stay-selective-amid-rebound-vinit-sambre/articleshow/120722902.cms",
    "summary": "The current market environment is characterized by volatility and uncertainty, particularly concerning corporate earnings, according to **Vinit Sambre**, a representative from **DSP Mutual Fund**. While acknowledging recent market rallies, he notes that these movements are not firmly rooted in strong fundamental performance. \n\n• **Current Earnings Trends**: Sambre suggests that the market is experiencing a deceleration in earnings growth, influenced by external global factors. The downturn in corporate profits observed over the past few quarters has not been mitigated by positive macroeconomic indicators, which raises concerns about future performance.\n\n• **Establishing a Base for Recovery**: Sambre expresses optimism that the forthcoming one or two quarters may establish a low earnings base, potentially facilitating a recovery in corporate profits as consumer spending and tax benefits improve. He predicts that a clearer recovery in earnings may emerge in six to nine months.\n\n• **Market Sentiment and Valuations**: Despite the market rally from recent lows, the underlying valuations lack robust support from strong earnings releases or management forecasts. Sambre stresses that the current market sentiment is more priced on a narrative than on solid financial fundamentals.\n\n• **Investment Strategy**: In the current climate, Sambre advises maintaining a selective investment approach. The focus should be on identifying solid opportunities while being cautious amid the broader market fluctuations prevalent over the next quarters. His strategy includes reallocating from high valuation sectors and considering potential upswings in industries such as specialty chemicals and consumer discretionary goods.\n\n• **Outlook on Small and Mid-cap Stocks**: Observations suggest future opportunities in the small- and mid-cap sectors, suggesting that pullbacks may present advantageous buying opportunities if approached judiciously.\n\nThis view reflects an overarching cautious optimism in navigating the complexities of the market, advocating for a balanced and strategic investment approach amidst a landscape filled with challenges and potential."
  },
  {
    "title": "Bitcoin holds near $95,000 amid strong institutional inflows; Altcoins trade mixed",
    "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-holds-near-95000-amid-strong-institutional-inflows-altcoins-trade-mixed/articleshow/120722772.cms",
    "summary": "Bitcoin has maintained a stable position near **$95,000**, primarily fueled by significant **institutional investments** and favorable technical indicators. Positive market sentiment has been bolstered by the notable **$1.4 billion BTC purchase by Strategy** and optimistic forecasts from **Standard Chartered** concerning Bitcoin's future performance. As of recent reports, Bitcoin was trading at approximately **$94,838**, reflecting a modest **0.2% increase**, while **Ethereum** saw a rise of **0.74%**, reaching **$1,819**. The overall cryptocurrency market capitalization experienced a slight uptick to **$2.98 trillion**.\n\nKey insights include:\n\n• **Institutional Flows:** The increase in institutional investments has contributed significantly to Bitcoin's resilience, with reports of a **2,682% rise** in whale inflows for Ethereum indicating strong market activity.\n\n• **Technical Signals:** Bitcoin remains above crucial support levels, specifically the **200-day moving average**, and the Relative Strength Index (RSI) is consistently above **50**, suggesting potential for further upward movement.\n\n• **Market Divergence:** While Bitcoin exhibits bullish momentum, **altcoins** displayed mixed performances, with notable gains in coins like **BNB, Tron, and Chainlink** (up to **3%**), contrasted by declines in others, including **XRP, Solana, and Dogecoin** (down as much as **3.5%**).\n\n• **Consolidation Phase:** Analysts suggest Bitcoin is currently in a consolidation phase, with **$96,000** identified as a significant resistance level and potential breakout targets nearing **$100,000.** Despite a recent **$380 million** outflow from Exchange-Traded Funds (ETFs), Bitcoin has successfully held above the **$93,000** support.\n\n• **Market Sentiment:** The **Crypto Fear & Greed Index** has moved into the **greed zone**, currently at **60**, indicating a bullish sentiment among investors.\n\nOverall, Bitcoin's robust performance in the face of mixed altcoin trends and institutional backing propels a cautiously optimistic outlook for the cryptocurrency market as it navigates through significant price levels."
  },
  {
    "title": "European shares edge higher as earnings roll in, tariff watch continues",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-higher-as-earnings-roll-in-tariff-watch-continues/articleshow/120722464.cms",
    "summary": "European shares demonstrated a modest increase as investors reacted to recent corporate earnings and kept an eye on potential tariff adjustments while awaiting significant economic data. The pan-European STOXX 600 index gained **0.2%**, indicating a cautious yet positive market sentiment, though it risks marking a second consecutive monthly decline if current trends continue. \n\nKey points include:\n\n• **Regional Performance:** Most regional indexes experienced positive movement, with the exception of the UK’s FTSE index, which decreased by **0.1%** primarily due to a **3.3%** drop in BP shares after the company's first-quarter profits fell short of expectations. \n\n• **Corporate Highlights:** \n  • **HSBC's** shares rose **2.3%** following the announcement of a **$3 billion** share buyback.\n  • **Deutsche Bank**, Germany's largest lender, saw its stock rise nearly **3%** after reporting a **39%** increase in first-quarter profits.\n  • Conversely, **Porsche** shares fell sharply by **7.4%** after the company revised its forecasts downward for 2025.\n\n• **Tariff Developments:** The administration of U.S. President Donald Trump is set to mitigate the impact of automotive tariffs, aiming to provide relief by easing certain duties on foreign parts used in domestically manufactured vehicles.\n\n• **Market Outlook:** Recent weeks have seen market stabilization fueled by optimism regarding potential agreements between the U.S. and its trading partners, particularly China. However, uncertainty surrounding U.S.-China negotiations has led to sensitivity in market reactions to news developments.\n\nInvestors are particularly watching for the eurozone consumer confidence report, which is expected to provide further insights into economic health and sentiment in the region."
  },
  {
    "title": "Ather Energy IPO Day 2: Subscription status, GMP trends, price band to review —Should you apply?",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/ather-energy-ipo-day-2-subscription-status-gmp-trends-price-band-to-review-should-you-apply/articleshow/120722278.cms",
    "summary": "Ather Energy's Initial Public Offering (IPO) has shown a lukewarm response on the second day of bidding, with overall subscriptions barely crossing 23% by late morning on April 29, 2025. Notably, retail investors exhibited higher demand, subscribing to **94% of their allotted shares**, while non-institutional investors subscribed to **19%**. The total offer is valued at approximately Rs 3,000 crore and is set to close on April 30, with a listing planned for May 6.\n\nMarket sentiment appears to be subdued, as indicated by the recent decline in the Grey Market Premium (GMP) for Ather’s unlisted shares, which was trading at around **Rs 322**, reflecting only a **0.31% premium** above the upper price band of **Rs 321** per share. The GMP had previously decreased from **Rs 7 to Rs 1** over a short span, with analysts attributing this reduction to selling pressure in the market last Friday. \n\n**Key IPO Details:**\n• The offering consists of a fresh issue worth **Rs 2,626 crore** and an **offer-for-sale (OFS)** of **Rs 355 crore**. \n• The **price band** is set between **Rs 304 and Rs 321** per share.\n• Ather Energy has secured **Rs 1,340 crore** from key anchor investors, including SBI Mutual Fund and Franklin Templeton.\n\nThe proceeds from this IPO are earmarked for the establishment of a new manufacturing facility in Maharashtra, paying off existing debts, and enhancing R&D, marketing, and general corporate purposes.\n\nWhile the current GMP trend may not be favorable, analysts are providing positive recommendations based on Ather Energy’s fundamentals. With an **EV/sales ratio of 8x** at the upper band based on projected sales, expert views suggest a \"Subscribe for listing gain\" rating, reflecting confidence in the company’s growth prospects in the electric scooter market. Ather has garnered a reputation for strong R&D capabilities and first-mover advantages among premium electric vehicles, indicated by their expanded product offerings, including the recent launch of the Ather Rizta model.\n\nIn summary, retail interest remains strong, yet overall demand appears tepid, leading to critical evaluations for potential investors regarding the viability of participating in this IPO."
  },
  {
    "title": "Stock market to remain closed on May 1 for Maharashtra Day",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-to-remain-closed-on-may-1-for-maharashtra-day/articleshow/120722126.cms",
    "summary": "Indian stock markets will remain **closed** on **May 1, 2025**, in observance of **Maharashtra Day**, a regional holiday that commemorates the formation of the state of Maharashtra in **1960**. This closure will affect all trading activities on both the **National Stock Exchange (NSE)** and the **Bombay Stock Exchange (BSE)** across all segments, including equities and derivatives.\n\n• **Equity Markets Closure:**  \n  - Complete trading halt on May 1, covering all segments.\n  - Normal trading will resume on **May 2, 2025**.\n\n• **Multi Commodity Exchange (MCX):**  \n  - Will have a **partial closure**; there will be no trading in the morning session (9:00 AM - 5:00 PM).\n  - Evening trading will be available from **5:00 PM to 11:30 PM** for commodities such as gold, silver, and crude oil.\n\nMarket participants are encouraged to adjust their trading schedules and strategies to accommodate this holiday to avoid potential disruptions. This announcement aligns with a larger trading holiday calendar for **2025**, which includes significant holidays such as **Independence Day, Ganesh Chaturthi**, and **Diwali**. \n\nIn summary, the upcoming Maharashtra Day marks a significant event for the stock exchanges, urging investors to plan their trading activities accordingly to maintain a smooth operation."
  },
  {
    "title": "Ather Energy IPO: A risky ride or a growth opportunity?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-ipo-a-risky-ride-or-a-growth-opportunity/slideshow/120722012.cms",
    "summary": "Ather Energy recently launched its initial public offering (IPO) on April 28, 2025, with subscriptions closing on April 30, aiming to raise approximately **INR 2,980 crore** by offering shares at a price of up to **INR 321** each. This IPO is particularly notable as it receives backing from **Hero MotoCorp**, enhancing its profile in the competitive electric vehicle (EV) market.\n\n**Market Reactions:**\nBrokerages have expressed varied opinions about the IPO:\n- **Arihant Capital:** Advises investors to subscribe for potential listing gains, citing a fair but aggressive valuation at an **EV/Sales ratio of 8x** based on the estimated **9MFY25 sales of INR 1,579 crore**.\n- **Gaurav Garg (Lemonn Markets):** Provides a mixed perspective, suggesting that aggressive, long-term investors might consider subscribing only if they possess a high-risk appetite, due to ongoing losses and competitive pressures.\n- **Geojit Investments:** Recommends subscription for high-risk investors while highlighting concerns about valuation, which stands at an **EV/Sales ratio of 7.1x** for FY24. However, the brokerage praises Ather’s robust research and development capabilities as potential growth drivers.\n- **Bajaj Broking:** Encourages informed investors with excess funds to look at the IPO for long-term gains, pointing out the company's ambitious scaling plans despite existing financial losses and high debt levels.\n- **Ventura Securities:** Suggests subscribing for listing advantages, emphasizing Ather’s premium product market presence and rapidly expanding charging infrastructure, namely **Ather Grid**.\n- **SMC Global Securities:** Takes a cautious stance, recommending a neutral approach due to the company’s ongoing losses, overreliance on South Indian markets, and possible supply chain risks.\n\n**Valuation Context:**\nThe share price is estimated at a **P/S multiple of approximately 4x** based on projected sales for FY25. Analysts note that Ather's ability to innovate in technology enhances its market stance, although concerns about overall market conditions and investor sentiment could affect the IPO’s initial performance.\n\nIn summary, while Ather Energy presents an opportunity in the EV sector fuelled by notable backing and innovation, potential investors should carefully weigh the outlined risks and recommendations provided by various brokerages before engaging in this IPO."
  },
  {
    "title": "Paras Defence, Bharat Dynamics among 4 defence stocks where FIIs raised their stake in Q4",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/paras-defence-bharat-dynamics-among-4-defence-stocks-where-fiis-raised-their-stake-in-q4/slideshow/120721941.cms",
    "summary": "India's defence sector has seen increased interest from Foreign Institutional Investors (FIIs) due to heightened geopolitical tensions, particularly following the recent Pahalgam attack. The government's initiatives toward indigenisation and modernisation in defence are key factors motivating this surge in investment.\n\n• **Key Stocks with FII Stake Increases:**\n  - **Paras Defence**: FII stake rose from 0.13% in FY24 to 5.24% in FY25. The stock has appreciated by 71% over the past year, supported by strong financial performance and a positive growth outlook.\n  - **Apollo Micro Systems**: The FII stake increased from 0.19% in September 2024 to 0.93% in March 2025. This company is known for providing electronic and electro-mechanical solutions in defence.\n  - **Bharat Dynamics**: FII holdings grew from 2.95% to 3.25% between March 2024 and March 2025, with shares gaining 56% in a year, primarily due to robust defence order inflow.\n  - **BEML**: The stake rose from 6.7% in June 2024 to 7.3% in March 2025, although its stock has dropped by 21% year-to-date.\n\nThis shift in investment dynamics highlights both the changing geopolitical landscape and the strategic imperatives driving the Indian defence sector's growth. As these initiatives unfold, investors remain attentive to opportunities within this pivotal sector."
  },
  {
    "title": "Top 3 stocks Neeraj Dewan bought and sold in this volatile market",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/top-3-stocks-neeraj-dewan-bought-and-sold-in-this-volatile-market/articleshow/120721555.cms",
    "summary": "Market expert **Neeraj Dewan** has identified several investment opportunities within the current volatile market conditions, focusing on sectors including *public sector banks, railways, infrastructure,* and *power*. He suggests maintaining a position in **Reliance Industries**, expecting the stock to stabilize around ₹1,500. Dewan is optimistic about **Mahindra & Mahindra (M&M)** and **TVS Motor**, praising their robust performance juxtaposed against reasonable valuations.\n\nKey Insights:\n• Dewan capitalized on recent *tariff turmoil*, using the opportunity to buy shares of **Mazagon Dock**, **Garware**, and **Godfrey Phillips** when prices dipped. He subsequently booked profits as the market rebounded.\n• Current market observations show that while private sector banking stocks have recently appreciated, there remains strength in the *public sector banking* sector, particularly indicative of improving balance sheets and asset quality.\n• Dewan highlights that M&M has been thriving, especially in its *electric vehicle (EV)* and *SUV segments*. The forecast for the monsoon should bolster *tractor sales* as well.\n• Unlike Tata Motors, M&M faces fewer global risks, positioning it favorably for investors.\n• The emphasis is on selective investments now, particularly as the earnings season progresses, reinforcing the need for stock-specific strategies rather than broad sector investments.\n\nOverall, Dewan's strategies underscore a cautious yet strategic approach to navigating the current market dynamics, favoring stocks that are poised for stable growth amidst volatility."
  },
  {
    "title": "Hyderabad investor duped of Rs 2.8 cr in stock market fraud via fake IPO scheme",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/hyderabad-investor-duped-of-rs-2-8-cr-in-stock-market-fraud-via-fake-ipo-scheme/articleshow/120721486.cms",
    "summary": "In a significant case of financial fraud, a **37-year-old private sector employee** from Asif Nagar, Hyderabad, was deceived into losing approximately **₹2.8 crore** through a fraudulent **Initial Public Offering (IPO)** scheme that was promoted via a Facebook advertisement and operated through a deceptive application named **ASKMIN**. \n\n**Incident Overview:**\n- The victim was enticed by promises of early access to upcoming IPOs. After clicking the advertisement link, he was directed to a fake website run by scammers and subsequently included in a WhatsApp group for discussions about IPO investments.\n- The fraudsters built rapport by initially transferring a sum of **₹4.9 lakh** into the victim's account as \"profits,\" which lured him into making further investments.\n\n**Operational Details:**\n- Between **March 7 and April 21, 2025**, the victim was led to deposit substantial amounts. \n- When he attempted to withdraw his investments, the scammers requested an additional **15% processing fee**. They presented a fabricated account balance of **₹32.3 crore** on their app but failed to release any funds, continuing to delay payouts.\n\n**Legal Action:**\n- Realizing he was being scammed, the victim reported the case to the Hyderabad Cyber Crime police.\n- Authorities have since opened an investigation and filed charges under various sections of the **Bharatiya Nyaya Sanhita** and the **Information Technology Act**, including allegations of cheating and operating an organized crime ring.\n\n**Advisory Note:**\nThis incident serves as a crucial warning for investors to exercise vigilance when engaging with online investment platforms and unsolicited offers on social media. Experts recommend verifying the legitimacy of any investment opportunities directly with recognized exchanges and **SEBI-registered intermediaries**, rather than relying on unofficial channels or social media advertisements."
  },
  {
    "title": "Stocks to buy in 2025: Mphasis, Axis Bank among 5 stocks that could give 10-20% return",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-mphasis-axis-bank-among-5-stocks-that-could-give-10-20-return/slideshow/120721365.cms",
    "summary": "The current market overview indicates that the Nifty index is at **24,328.70**, reflecting a slight increase of **0.21%**. In the realm of mutual funds, two notable featured options include:\n\n• **Canara Robeco ELSS Tax Saver Regular - Growth**: This fund has achieved a **5-year return** of **22.72%**.\n• **HSBC Large Cap Fund Direct-Growth**: This fund reported a **5-year return** of **21.64%**.\n\nIn the stock market sphere, brokerages have recently published recommendations for stocks anticipated to yield returns between **10% to 20%** by 2025. Highlights of these recommendations are as follows:\n\n• **Mphasis**: Initiated a **Buy** rating with a target price of **Rs 2,805**, offering an upside of **10%** from its last trading price of **Rs 2,538**.\n• **Shriram Finance**: Maintained a **Buy** rating with an updated target price of **Rs 760**, signaling a **16% upside** from its current price of **Rs 655**.\n• **Axis Bank**: Received a **Buy** rating, with a target price set at **Rs 1,400**, indicating a promising **20% upside** from the last price of **Rs 1,165**.\n• **Maruti Suzuki**: Also rated a **Buy**, though its target price has been adjusted down to **Rs 13,400**, reflecting a **14% upside** from **Rs 11,685**.\n• **RBL Bank**: Upgraded to a **Buy** recommendation with a target of **Rs 230**, suggesting a **23% upside** from a recent price of **Rs 187**.\n\nConsequently, these forward-looking recommendations from various brokerages indicate a broadly positive sentiment and present opportunistic options for traders focusing on short-term gains within the market."
  },
  {
    "title": "Paras Defence Shares At Seven-Month High Ahead of Board Meet On Stock Split, Q4 Results",
    "url": "https://www.ndtvprofit.com/markets/paras-defence-shares-at-seven-month-high-ahead-of-board-meet-on-stock-split-q4-results",
    "summary": "• **Recent Stock Performance**: Paras Defence and Space Technologies Ltd. shares surged over *9%* to reach *Rs 1,249.90*, marking a seven-month high before a pivotal board meeting scheduled to discuss a stock split, Q4 financial results, and possible dividend declaration.\n\n• **Board Meeting Agenda**: Scheduled for Wednesday, the board is expected to discuss the specifics of a stock split, with details on the proposed ratio yet to be disclosed.\n\n• **Market Context**: The jump in Paras Defence shares aligns with a broader recovery in the defense sector, which saw significant gains after a week of profit-booking. Paras Defence was among the top performers in this market segment.\n\n• **Historical Context**: Earlier this year, on January 7, the company secured a lifetime manufacturing license from the Department for Promotion of Industry and Internal Trade to produce MK46 and MK48 belt-fed light machine guns, aiming for an annual output of *6,000 units each*.\n\n• **Analyst Insights**: Despite fluctuations, the stock is up *22.86% year-to-date* and has increased *70.14%* over the last twelve months. One analyst has maintained a 'buy' rating, indicating a potential upside of *6.6%* based on the average 12-month price target.\n\n• **Current Trading Status**: As of the latest reports, the stock was trading at *Rs 1,241.90*, reflecting an *8.58%* increase with a trading volume surpassing eight times its 30-day average, indicating robust market interest. \n\n• **Wider Economic Implications**: Keeping an eye on financial terms and overall economic indicators, the share performance of companies like Paras Defence is often tied to broader defense spending trends and government policies that could influence market confidence. \n\nThe upcoming board meeting is crucial for investors watching market dynamics in the defense sector, particularly given the strategic implications of the company’s offerings and recent license acquisitions."
  },
  {
    "title": "Gold glitters with 25% return in 2025 this Akshaya Tritiya: Should you invest now?",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-glitters-with-25-return-in-2025-this-akshaya-tritiya-should-you-invest-now/articleshow/120720895.cms",
    "summary": "As Akshaya Tritiya 2025 approaches, the traditional buying of gold remains prevalent among Indian households despite soaring prices. The term \"Akshaya\" signifies enduring wealth, and the day is regarded as auspicious for investments. Currently, gold has surged approximately 25% in value since the beginning of the year, attributed to several global factors, including escalating geopolitical tensions and central bank purchases aimed at stabilizing reserves amidst inflation.\n\n• **Factors Behind Gold's Surge:**\n  - **Geopolitical Risks:** Increasing trade tensions, particularly between the U.S. and China, have heightened market uncertainties, driving investors towards gold for protection.\n  - **Central Bank Activities:** Global central banks are actively increasing gold reserves, which adds to demand and prices.\n  - **Investor Behavior:** Both retail and institutional participants are purchasing gold in reaction to these developments.\n\n• **Sustainability of the Rally:** While the current environment seems conducive to high gold prices, experts exhibit cautious optimism about the rally's sustainability. Investors are recommended to consider a \"buy on dips\" strategy while being mindful of potential market corrections. The suggestion of Rupee Cost Averaging is also highlighted, allowing for dollar-cost averaging purchases to soften the impact of price fluctuations.\n\n• **Balancing Tradition and Modern Investment Strategies:**\n  - Gold is not solely viewed as a commodity but is deeply integrated into cultural practices, making it an emotional investment during significant occasions like Akshaya Tritiya.\n  - Experts recommend a measured approach: purchasing small amounts of gold for tradition, while diversifying investments across various asset classes including equities and fixed income. This balances emotional and financial goals effectively.\n\n• **Conclusion:** Although the allure of gold remains strong, particularly during festive periods, prudent and strategic investment decisions are crucial given the elevated price levels. Symbolic purchases can hold significant meaning, but investors should carefully consider timing and investment size to safeguard against potential market downturns. The overarching principle is to harmonize tradition with contemporary financial wisdom, aiming for both spiritual fulfillment and effective wealth preservation."
  },
  {
    "title": "PNB Housing shares zoom 10% after asset quality improves in Q4, profit rises 25% YoY",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-housing-shares-zoom-10-after-asset-quality-improves-in-q4-profit-rises-25-yoy/articleshow/120720353.cms",
    "summary": "Shares of **PNB Housing Finance** experienced a significant surge of **10%**, reaching an intraday high of **₹1,085.40** following the company's report of a **25% year-on-year (YoY)** increase in net profit for the fourth quarter, amounting to **₹550 crore**. This positive development was attributed to robust business growth and enhanced asset quality. \n\nIn more detail, the company's performance highlights include:\n\n• **Annual Profit Growth:** The full financial year's profit rose by **28% YoY**, reaching **₹1,936 crore**, up from **₹1,508 crore** in the prior year. \n• **Net Interest Margin (NIM):** The NIM improved to **3.75%** for the quarter, an increase from **3.70%** in the previous quarter and **3.65%** a year earlier.\n• **Net Interest Income:** Rose **16% YoY**, totaling **₹734 crore**.\n• **Assets Under Management (AUM):** Grew by **13% YoY**, reaching **₹80,397 crore** by fiscal year-end. \n• **Loan Asset Growth:** On-book loan assets surged **16%** to **₹75,765 crore**, while retail loans increased by **18%** to **₹74,802 crore**.\n• **Non-Performing Assets (NPA) Ratio:** Reduced by **42 basis points** YoY to **1.08%** as of March 31. Additionally, the company successfully recovered **₹336 crore** from previously written-off loans.\n\nFollowing the announcement of these results, **HDFC Securities** maintained an **‘Add’ rating** for PNB Housing, setting a target price of **₹1,025**. The brokerage commended the company's earnings performance, which outstripped expectations mainly due to lower provisioning and increased other income. Loan growth was particularly strong at **16% YoY**, largely driven by an **18%** rise in retail loans. However, it noted that corporate disbursements remained subdued. \n\nMoreover, PNB Housing's strategy of focusing on higher-yielding segments, such as affordable housing and non-home loans, is anticipated to support profit margins in the prevailing interest rate environment. However, increased operating expenses due to ongoing investments and expected normalization of credit costs by **FY27** could impact overall returns.\n\nThese developments reflect a positive trajectory for PNB Housing Finance and underline its proactive approach to improving asset quality and financial performance."
  },
  {
    "title": "HDFC Bank races past Goldman Sachs in market value, signals post-merger strength",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-races-past-goldman-sachs-in-market-value-signals-post-merger-strength/articleshow/120720238.cms",
    "summary": "HDFC Bank has achieved a significant increase in its market capitalisation, surpassing Goldman Sachs and reaching **$183.32 billion** during its post-merger recovery phase. This growth has been bolstered by strong quarterly results, enhanced deposit mobilization, and stabilizing net interest margins. Analysts project continued expansion, underscored by potential value opportunities from the listing of HDB Financial Services, further elevating HDFC Bank's status on the global stage.\n\nKey Highlights:\n\n• **Market Value Comparison:** HDFC Bank's market value of **$183.32 billion** contrasts with **$169.97 billion** for Goldman Sachs, indicating a notable recovery and growth trajectory post-merger.\n\n• **Stock Performance:** After facing a low of **Rs 1,426.80**, HDFC Bank's shares are rallying, nearing **Rs 2,000** in April 2025, reflecting positive sentiment supported by robust financial metrics.\n\n• **Operational Improvements:** A focus on lowering the loan-to-deposit ratio (LDR) from a peak of **104%** post-merger to **96.5%** shows efforts to stabilize financial health, with a target to revert to **85%-90%** by FY27.\n\n• **Future Projections:** Analysts expect net interest margins to remain between **3.5% and 3.6%** by FY27. Brokerage firms such as Emkay Global and KR Choksey have reiterated their 'buy' ratings, with Emkay setting a price target of **Rs 2,200** based on stable core margins and better portfolio management.\n\n• **Comparison with Goldman Sachs:** Despite Goldman Sachs employing a different business model focused on investment banking, the closeness in market value places HDFC Bank as a formidable player in the global financial landscape, enhancing Indian financial institutions' visibility internationally.\n\nThe momentum from HDFC Bank's recent performance indicates a broader trend of improving asset quality and operational efficiency, making it an attractive option for investors amid an evolving market landscape."
  },
  {
    "title": "Rupee rises 27 paise to 84.96 against U.S. dollar in early trade",
    "url": "https://www.thehindu.com/business/markets/rupee-rises-27-paise-to-8496-against-us-dollar-in-early-trade/article69504009.ece",
    "summary": "The Indian rupee appreciated by *27 paise*, reaching **₹84.96** against the U.S. dollar on April 29, 2025, during early trades. This rise in value is attributed to several factors: \n\n• **Robust Foreign Fund Inflows:** The inflow of foreign investments has been significant, bolstering market confidence.\n• **Positive Domestic Data:** Both manufacturing and industrial production reported a growth of **3%**, indicating healthy domestic demand.\n• **Easing Global Tensions:** Reduced geopolitical risks, particularly between India and neighboring countries, contributed to market optimism.\n\nForex traders expressed caution, noting the potential for volatility due to the possibility of escalating tensions between India and Pakistan, similar to past occurrences that had previously pressured the rupee. \n\nDetails include:\n\n• The rupee opened at **₹85.06**, then gained ground before closing at **₹85.23** the previous day, indicating a steady rally.\n• Initial trading saw a low of **₹85.15**, highlighting fluctuations typical in forex markets.\n• On the global front, a more diplomatic stance from U.S. Treasury Secretary Scott Bessent on trade negotiations with Asian allies, including concessions from China regarding tariffs, has helped stabilize markets.\n\nMarket performance was also reflected in domestic equities, where the BSE Sensex and Nifty indices rose by **404.00 points (0.50%)** and **115.40 points (0.47%)**, respectively. Furthermore, foreign institutional investors (FIIs) were net buyers of equities, purchasing shares worth **₹2,474.10 crore** on the preceding trading day, contributing to the overall market buoyancy. \n\nIn summary, the rupee's strength is supported by positive economic indicators and external diplomatic developments, but investors remain alert to potential risks that may disrupt the upward trend."
  },
  {
    "title": "Ashish Kacholia adds 8 new stocks, hikes stakes in 4 firms in Q4 amid market correction",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-adds-8-new-stocks-hikes-stakes-in-4-firms-in-q4-amid-market-correction/slideshow/120720162.cms",
    "summary": "During the recent market correction from January to March 2025, noted investor *Ashish Kacholia* strategically added eight new stocks to his portfolio and increased his stakes in four existing companies. This investment activity occurred while the broader market indices, such as the Sensex and Nifty, declined by approximately 1%, and mid- and small-cap indices plunged over 10%.\n\nKey details of Kacholia's investment strategies include:\n\n• **New Stock Additions:**\n  - *Thomas Scott (India)*: 2.4% holding valued at Rs 10.2 crore with a YTD return of -28%.\n  - *Concord Control Systems*: 1.2% holding valued at Rs 10.5 crore with a YTD return of -20%.\n  - *Infinium Pharmachem*: 4.6% holding valued at Rs 21.7 crore with a YTD return of 3%.\n  - *Qualitik Labs*: Specific details not disclosed.\n  - *Naman In-Store*: 8.3% holding valued at Rs 8.8 crore with a YTD return of -40%.\n  - *Z-Tech (India)*: 3.5% holding valued at Rs 30.1 crore with a YTD return of 4%.\n  - *C2C Advanced Technologies*: 2.6% holding valued at Rs 15.4 crore with a YTD return of -54%.\n  - *Quadrant Future Tek*: 1.9% holding valued at Rs 37.2 crore with a YTD return of 11%.\n\n• **Increased Stakes in Existing Holdings:**\n  - *Tanfac Industries*: Stake raised by 0.4 percentage points to 1.6%.\n  - *Aeroflex Industries*: Stake increased by 0.1 percentage points to 1.9%.\n  - *Zaggle Prepaid Ocean Services*: Stake up by 0.1 percentage points, now holding 2.2%.\n  - *Jyoti Structures*: Stake increased by 0.4 percentage points during Q4.\n\nKacholia's expansion reflects a methodical approach to leverage market downturns, indicating his confidence in the future potential of these select investments despite prevailing volatility in the market."
  },
  {
    "title": "Defence stocks rally up to 9% for second straight day after Pakistan defence minister says Indian military incursion is imminent",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-rally-up-to-9-for-second-straight-day-after-pakistan-defence-minister-says-indian-military-incursion-is-imminent/articleshow/120719669.cms",
    "summary": "Shares of Indian defense companies experienced a notable surge of up to 9% on April 29, 2025, amid escalating tensions following a deadly terrorist attack in Pahalgam, where 26 civilians lost their lives. The attack, which occurred on April 22, prompted strong calls for retaliation within India, directing accusations towards Pakistan for its alleged support of the attackers.\n\n• **Key Developments:**\n  - **Defense Minister's Warning:** Pakistan’s Defense Minister, Khawaja Muhammad Asif, indicated that an imminent military incursion by India was anticipated, further intensifying the situation. He remarked on the necessity of strategic decisions in light of rising Indo-Pak rhetoric, hinting at preparations made by Pakistan's military.\n  - **Retaliation Calls:** Indian officials have accused two suspects involved in the attack as being Pakistani nationals, a claim that Pakistan denies, calling for an impartial investigation. Indian Prime Minister Narendra Modi has vowed to seek justice against the perpetrators.\n  - **Indian Government Actions:** Responding to the incident, India downgraded diplomatic relations with Pakistan, suspended the Indus Waters Treaty, restricted cross-border traffic, and banned various Pakistani YouTube channels for disseminating \"provocative\" content.\n\n• **Market Reactions:**\n  - Notable stocks within the defense sector, including Paras Defence, GRSE, and Data Patterns, saw significant gains, contributing to a rise of over 3% in the Nifty India Defence index, which experienced a cumulative increase of more than 7% over two trading sessions.\n\nThis escalation in defense stock performance coincides with a volatile political landscape in South Asia, where military readiness and diplomatic tensions significantly influence market dynamics."
  },
  {
    "title": "Sensex  rises! These  stocks are up over 10% on BSE",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/sensex-rises-these-stocks-are-up-over-10-on-bse/articleshow/120719384.cms",
    "summary": "On April 29, 2025, Indian equity indices showcased a positive trend, with the **BSE Sensex** rising by **116.31 points** to reach **80,334.68** and the **NSE Nifty** increasing by **24.1 points**, landing at **24,352.6**. Key highlights from the trading day included several stocks surging beyond **10%** on the **BSE**:\n\n• **Top Gainers**:  \n  - Manaksia Aluminium: **14.92%**  \n  - Bonlon Industries: **11.26%**  \n  - Whirlpool India: **10.08%**  \n\n• Performance Breakdown:  \n  - In the **Nifty 50 index**, **19 stocks** were in the green while **31 stocks** faced declines.  \n  - Notable stocks reaching 52-week highs included **Everest Org**, **Manorama Ind**, **Oswal Overseas**, **Kachchh Mineral**, and **SER Industries Ltd.**  \n  - Conversely, stocks such as **GI Engineering**, **Sterling Guar**, **Gensol Engineering**, **K&R Rail Engineering**, and **Thakral Service** recorded new 52-week lows.  \n\n• Bond Market: The **10-year bond yield** observed a slight increase of **0.05%**, settling at **6.03** after fluctuating within a range of **6.02 to 6.04**.  \n\nIn summary, the positive market trends were driven by buying patterns in frontline bluechip companies, reflecting a healthy investor sentiment despite challenges faced by a subset of stocks."
  },
  {
    "title": "Chakri Lokapriya expects prolonged earnings pressure despite market optimism",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/chakri-lokapriya-expects-prolonged-earnings-pressure-despite-market-optimism/articleshow/120719217.cms",
    "summary": "Chakri Lokapriya, CIO of LGT Wealth, has expressed concern over anticipated continued earnings cuts that could affect the Nifty index’s growth, projecting a potential reduction of 3% to 5% in earnings. This trend, he notes, may lower overall year-over-year growth projections to approximately 8% to 10%. Despite these concerns, he remains optimistic about potential market recovery in the latter half of the year, contingent on forthcoming interest rate cuts and improved stability in various areas, including geopolitical conditions.\n\nA highlight of Lokapriya’s analysis is the exceptional performance of TVS Motor Company, which has reportedly exceeded market expectations with strong earnings and improved operating margins—rising from 11.3% to 14% year-over-year. He emphasizes that while TVS's results reflect strong execution and robust volume retention, it's essential not to generalize this success across the broader two-wheeler sector, as the performance metrics may not be reflective of all competitors within that market segment.\n\n**Key Insights:**\n• **Earnings Cuts Expected:** Ongoing earnings downgrades may impact the Nifty significantly.\n• **Market Recovery Outlook:** Possible improvement with interest rate adjustments later in the year.\n• **TVS Motor's Performance:** Outstanding results warrant a buy recommendation, though not indicative of the overall two-wheeler sector's health.\n• **Margin Improvement:** TVS's operating margin increase highlights its strong performance relative to predictions."
  },
  {
    "title": "Caught in the Crossfire: How nations are responding to US-China trade tensions",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/caught-in-the-crossfire-how-nations-are-responding-to-us-china-trade-tensions/slideshow/120719522.cms",
    "summary": "The ongoing trade tensions between the United States and China have forced various nations to navigate complex diplomatic waters, often adopting multifaceted strategies to maintain economic stability and international relations. \n\n• **Switzerland's Dual Approach**: Recently, Switzerland exemplified this dual diplomacy. The Swiss President visited Washington to oppose a significant 31% tariff on Swiss products, while concurrently, the Foreign Minister strengthened ties in Beijing. This reflects a broader trend among nations to balance relations with both superpowers.\n\n• **Impact of US Tariffs**: Former President Trump's aggressive tariff policies, which have pushed duties on Chinese goods to as high as 145%, have unsettled traditional allies of the U.S. Import volumes at major U.S. ports have dropped dramatically, raising concerns about inflation and supply shortages.\n\n• **China's Influence and Strategy**: China has sought to project itself as a stable partner, forging closer ties with countries like Vietnam and Malaysia, which have also felt the impacts of U.S. tariffs. Beijing's strategy includes both economic partnerships and pressure tactics, indicating a strong resistance against cooperation with the U.S.\n\n• **Geopolitical Shifts**: The shifting dynamics signal a waning global confidence in U.S. leadership while China is increasingly perceived as a reliable partner, complicating decisions for nations that rely on both markets.\n\n• **Nations' Dilemma**: Countries worldwide face an untenable choice between deepening economic ties with China and maintaining their access to the U.S. market. This balancing act could severely harm their economies, highlighting a trend toward greater fragmentation rather than globalization.\n\n• **China's European Outreach**: In a strategic move to bolster its global partnerships, China is reviving trade agreements with European nations and advocating for multilateralism, countering U.S. protectionism.\n\n• **Preparedness for Economic Shocks**: China is bracing itself for potential economic decoupling from the U.S. as its leadership acknowledges the risk of external shocks, emphasizing the need for resilience against global disruptions.\n\nIn summary, the escalating trade rivalry between the U.S. and China is reshaping global economic alliances, compelling countries to adapt strategically, as they grapple with the consequences of choosing sides in this complex international landscape. The future may hold reduced globalization and fragmentation as nations pursue distinct paths amid rising tensions between the two leading powers."
  },
  {
    "title": "Will Trump’s tariff relief benefit the US auto industry?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/will-trumps-tariff-relief-benefit-the-us-auto-industry/slideshow/120719448.cms",
    "summary": "The recent announcement from the Trump administration marks a notable shift in U.S. automotive tariff policy, aimed at alleviating the financial strain on domestic car manufacturers and workers. This change coincides with President Trump's commemorative visit to Michigan, celebrating his initial 100 days in office.\n\nKey measures of this policy include:\n\n• **Tariff Relief:** The administration will prevent the imposition of additional tariffs on car parts, ensuring that existing tariffs on steel and aluminum do not compound this burden. \n\n• **Reimbursement Opportunities:** Companies that have previously paid tariffs will have the chance to seek reimbursement, thereby providing financial relief and encouraging domestic production.\n\n• **Support for Domestic Manufacturing:** This strategy is intended to reward manufacturers that produce in the U.S., while allowing flexibility for those ramping up U.S.-based operations.\n\nThe industry response has been overwhelmingly positive. Notable figures, such as General Motors CEO Mary Barra, suggest that this decision will facilitate further investment in the U.S. economy. Similarly, Ford CEO Jim Farley emphasized that the tariff modifications will lessen the adverse effects on automakers, suppliers, and consumers.\n\nHowever, the backdrop to this development includes concerns regarding previously announced plans for a 25% tariff on imported auto parts, which could have severely disrupted the global supply chain and escalated vehicle prices for consumers. A coalition of major auto manufacturers addressed these issues in a letter to U.S. trade officials, highlighting the financial vulnerabilities of many auto suppliers and the potential for significant production interruptions.\n\nIn summary, the administration's new approach to automotive tariffs reflects a balancing act aimed at protecting supply chains while fostering increased domestic production. This collaborative effort between the government and the auto industry is essential for promoting economic stability and maintaining employment within the sector."
  },
  {
    "title": "Stock market update: Nifty Realty index  advances  0.55% in  an upbeat  market",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-nifty-realty-index-advances-0-55-in-an-upbeat-market/articleshow/120719087.cms",
    "summary": "The **Nifty Realty index** has shown a positive trend, trading up **0.55%** at **876.3** in a buoyant market as of April 29, 2025. Notable advancements in stock prices included:\n\n• **Prestige Estates Projects Ltd.** +4.28%  \n• **Sobha Ltd.** +2.22%  \n• **Mahindra Lifespace Developers Ltd.** +2.08%  \n• **Phoenix Mills Ltd.** +1.05%  \n• **Raymond Ltd.** +0.96%  \n\nConversely, some stocks faced declines:\n\n• **Oberoi Realty Ltd.** -1.73%  \n• **Macrotech Developers Ltd.** -0.94%  \n• **DLF Ltd.** -0.09%  \n\nOverall, the **NSE Nifty50** benchmark increased by **38.6 points**, reaching **24,367.1**, while the **BSE Sensex** rose by **177.61 points** to **80,395.98**. Among the **50 stocks** included in the Nifty index, **27** were in the positive territory, contrasting with **23** that were negative. Notable stocks actively traded during this period were **Vodafone Idea**, **UCO Bank**, **Tata Technologies**, **Canara Bank**, and **BEL**.\n\nAdditionally, multiple stocks attained **fresh 52-week highs**, including:\n\n• **Manorama Industries**  \n• **United Polyfab Gujarat**  \n• **Panacea Biotec**  \n• **Silver Touch Technologies**  \n• **Privi Speciality Chemicals**  \n\nOn the other hand, some stocks, including **Gensol Engineering**, **Uma Exports**, **Karda Construction**, **GI Engineering**, and **Premier Ltd.**, hit fresh **52-week lows** in the same trading session. This mixed performance underlines the dynamic nature of the market, reflecting both growth and diminishing values among various sectors."
  },
  {
    "title": "Galaxy S26's Snapdragon Chipset May See Early Reveal In September",
    "url": "https://www.ndtvprofit.com/technology/galaxy-s26s-snapdragon-chipset-may-see-early-reveal-in-september",
    "summary": "According to recent reports from NDTV Profit, Samsung plans to unveil the Galaxy S26 series featuring a new **Snapdragon 8 Elite Gen 2** chipset as early as September 2025. This high-performance chipset may support **LPDDR6 RAM** and include a **32MB L2 cache**, which is an improvement over previous generations. Here are some key highlights:\n\n• **Performance Enhancements**: The **Snapdragon 8 Elite Gen 2** is expected to deliver improved clock speeds, potentially reaching **5GHz**, thanks to its new **Pegasus cores**. This means enhanced performance capabilities for mobile devices.\n\n• **Competition with Other Brands**: The timing of the release could also coincide with Apple's upcoming iPhone 17 series, indicating a competitive landscape dominated by both Qualcomm and MediaTek, who are readying their own chipsets.\n\n• **Samsung’s Chip Production**: Initially, Samsung considered utilizing its own **Exynos 2600** chipset for the Galaxy S26, but production yield issues may lead them to rely on Qualcomm’s offerings. They have reportedly improved their fabrication yields, potentially facilitating future Exynos production.\n\n• **Market Launch Timeline**: Devices equipped with this new Snapdragon chipset are expected to become available starting in **October 2025**, allowing Samsung to strategically position its products in the competitive smartphone market.\n\nThe emphasis on technological advancements showcases Samsung's commitment to providing cutting-edge hardware in its smartphones, aligning itself against strong competitors in the industry."
  },
  {
    "title": "From AGS Transact to Paytm: 7 mainboard IPOs since 2021 that crashed up to 96%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/from-ags-transact-to-paytm-7-mainboard-ipos-since-2021-that-crashed-up-to-96/slideshow/120719157.cms",
    "summary": "The performance of several mainboard IPOs in India since 2021 has been notably poor, with some companies experiencing significant losses. An analysis reveals that certain IPOs have plummeted up to **96%** from their initial issue prices, adversely affecting investor confidence. Here are key details regarding the most affected IPOs:\n\n• **AGS Transact Tech**\n  - **Fall from issue price:** 96.5%\n  - **Listed:** January 2022\n  - **Current Market Cap:** Rs 77.7 crore\n  - **IPO Size:** Rs 680 crore\n\n• **Popular Vehicles**\n  - **Fall from issue price:** 66.7%\n  - **Listed:** March 2024\n  - **Current Market Cap:** Rs 700 crore\n  - **IPO Size:** Rs 601.5 crore\n\n• **Paytm**\n  - **Fall from issue price:** 59%\n  - **Listed:** November 2021\n  - **Current Market Cap:** Rs 56,191 crore\n  - **IPO Size:** Rs 18,300 crore\n\n• **Exxaro Tiles**\n  - **Fall from issue price:** 47.5%\n  - **Listed:** August 2021\n  - **Current Market Cap:** Rs 282 crore\n  - **IPO Size:** Rs 161 crore\n\n• **HMA Agro Industries**\n  - **Fall from issue price:** 42.7%\n  - **Listed:** July 2023\n  - **Current Market Cap:** Rs 1,677 crore\n  - **IPO Size:** Rs 480 crore\n\n• **Akme Fintrade**\n  - **Fall from issue price:** 34.7%\n  - **Listed:** June 2024\n  - **Current Market Cap:** Rs 335 crore\n  - **IPO Size:** Rs 132 crore\n\n• **HP Adhesives**\n  - **Fall from issue price:** 3.5%\n  - **Listed:** December 2021\n  - **Current Market Cap:** Rs 486 crore\n  - **IPO Size:** Rs 126 crore\n\nInvestors are advised to exercise caution and conduct thorough analyses before participating in new IPO offerings, considering the performance trends of these previously listed companies."
  },
  {
    "title": "Jio Platform IPO, renewables capex to fuel next leg of Reliance’s growth: Deven Choksey",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/jio-platform-ipo-renewables-capex-to-fuel-next-leg-of-reliances-growth-deven-choksey/articleshow/120718814.cms",
    "summary": "Reliance Industries is projected to experience significant growth driven by key developments in its consumer business segments, particularly the Jio platform and retail operations. According to Deven Choksey, Managing Director of DRChoksey FinServ Pvt. Ltd., the company's consumer-facing sectors contributed approximately **60%** to the total revenue in the fourth quarter, surpassing traditional hydrocarbon segments in EBITDA contribution for the first time. \n\nKey Insights:\n• **Growth Projections:** \n  - **Retail Sector Growth:** Expected to grow by approximately **15%**.\n  - **Jio Platform Growth:** Anticipated growth between **15% to 20%** for FY 2025-26, reflecting substantial investment in capital expenditure (capex) that has already been executed. \n\n• **Market Dynamics:** \n  - Favorable crude oil prices and improved gross refining margins (GRM) are expected to enhance profitability across operational sectors.\n  - Increased participation from market participants could lead to further stock appreciation, particularly given the recent price uptick of **5%** in Reliance's shares.\n\n• **Strategic Focus:** \n  - The company is progressively shifting its focus towards renewable energy and selected oil-to-chemical (O2C) projects, reflecting a strategic pivot in its operational focus.\n  - The anticipated public listing of the Jio platform could serve as a catalyst for further stock performance boost.\n\nOverall, strong consumer business performance and strategic initiatives in renewable energy and growth sectors are poised to propel Reliance Industries into its next phase of growth, making it an attractive consideration for investors."
  },
  {
    "title": "Gold Price Today: Yellow metal eases by Rs 4,000 from peak, trades above Rs 95k/10 gms. What to expect?",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-today-yellow-metal-eases-by-rs-4000-from-peak-trades-above-rs-95k/10-gms-what-to-expect/articleshow/120718164.cms",
    "summary": "Gold prices have recently declined by **Rs 4,000** from their peak, now trading above **Rs 95,000 per 10 grams**. This drop is attributed to the strengthening of the *U.S. dollar*, which inversely affects gold prices. The correction follows a record high of **Rs 99,358** for gold futures contracts last week. \n\nKey points regarding the current gold market include:\n\n• **Market Dynamics:** Gold June futures opened at **Rs 95,316**, reflecting a **4%** correction.\n• **Price Influencers:** The stronger dollar and changes in trade policy, particularly President Donald Trump’s postponement of reciprocal tariffs, have played significant roles in shaping market expectations.\n• **Consumer Sentiment:** With *Akshaya Tritiya* approaching, consumer demand is reportedly robust, especially in southern India where gold is culturally significant. However, buyers are becoming more price-conscious, opting for lighter-weight jewelry and coins.\n• **Sales Projections:** Retailers anticipate a **10-15% increase** in jewelry sales during this festive season, bolstered by positive consumer insights and favorable pricing dynamics.\n\nAnalysts believe that gold and silver prices will remain volatile this week, influenced by shifts in the dollar index and upcoming key U.S. economic data. Current support and resistance levels for gold are estimated between **Rs 95,350-94,600** and **Rs 96,650-97,280**, respectively. Silver futures have similarly shown minor declines and remain below market expectations.\n\nIn conclusion, while the recent price drop might deter some buyers, the upcoming festive season could spur additional demand amid mixed market signals and consumer optimism regarding gold and silver investments."
  },
  {
    "title": "Stock market update: Stocks that hit 52-week lows on NSE",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-stocks-that-hit-52-week-lows-on-nse/articleshow/120717909.cms",
    "summary": "As of April 29, 2025, the stock market has shown varied performance with the benchmark NSE Nifty rising by 15.85 points to reach 24312.65, while BSE Sensex experienced a slight increase of 0.17 points, bringing it to 80218.54. \n\nKey highlights from the session include:\n\n• **Top Gainers in the Nifty 50 Index:** \n  - BEL\n  - Reliance Industries (RIL)\n  - Larsen & Toubro (L&T)\n  - Tech Mahindra\n  - IndusInd Bank\n\n• **Major Losers:** \n  - UltraTech Cement\n  - Dr. Reddy's Laboratories\n  - Nestlé India\n  - Power Grid\n  - Shriram Finance\n\n• **52-Week Lows:** \n  - Stocks such as Gensol Engineering, GI Engineering, Uma Exports, Karda Construction, and Impex Ferro Tech touched their 52-week lows during this session.\n\n• **52-Week Highs:** \n  - Conversely, Manorama Industries, United Polyfab Gujarat, Solar Industries, Silver Touch Technologies, and Panacea Biotec achieved new 52-week highs.\n\nThe market continues to operate amidst a climate of concern regarding potential corrections, yet it persists in navigating through these uncertainties. As investors remain cautious, examining broader financial patterns and individual stock performance is crucial for strategic investment decisions."
  },
  {
    "title": "Sensex & Nifty are healing. But will this revive the Rs 2 lakh crore IPO pipeline lying in dumps?",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/sensex-nifty-are-healing-but-will-this-revive-the-rs-2-lakh-crore-ipo-pipeline-lying-in-dumps/articleshow/120717872.cms",
    "summary": "The Indian IPO market is cautiously showing signs of recovery after a sluggish beginning to 2025, aided by an upswing in secondary markets. Analysts are optimistic that the near ₹2 lakh crore pipeline of initial public offerings (IPOs) could produce increased market activity in the latter half of the year, provided that stability remains and companies adopt realistic pricing strategies. \n\nKey factors influencing this situation include:\n\n• **Market Conditions**: The secondary market's recovery has lifted investor sentiment, which typically influences the primary market. However, earlier volatility led many firms to postpone their listing plans.\n\n• **Ather Energy's IPO**: Ather Energy, an electric two-wheeler manufacturer, launched a ₹2,981 crore IPO but received tepid market response, indicating a cautious investor sentiment.\n\n• **Future Prospects**: Analysts predict that the IPO market’s revival is interconnected with the performance of existing listings. Should Ather Energy's IPO perform well post-listing, this could encourage other companies to pursue IPOs.\n\n• **Potential Listings**: Besides Ather, several prominent firms, including Reliance Jio (potentially India's largest IPO at around ₹40,000 crore) and Zepto (valued between ₹7,000-8,800 crore), are poised to enter the market, which could bolster investor enthusiasm if executed smoothly.\n\n• **Valuation Adjustments**: With investor sentiment shifting towards more realistic valuations due to previous overpricing, companies are likely to be more cautious in their pricing strategies moving forward.\n\n• **Market Recovery Indicators**: Improved trading volumes and positive momentum in the market could signal a resurgence in IPO activities as companies assess investor confidence and market readiness.\n\nIn summary, while the Indian IPO market currently exhibits signs of revival, its full recovery will be contingent on a combination of stable market conditions, investor sentiment, and strategic company pricing. Patience from investors and careful planning from companies will be vital as the landscape evolves."
  },
  {
    "title": "UCO Bank, Central Bank of India shares rally up to 7% after Q4 solid earnings",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/uco-bank-central-bank-of-india-shares-rally-up-to-7-after-q4-solid-earnings/articleshow/120717695.cms",
    "summary": "Shares of UCO Bank and Central Bank of India experienced notable surges of up to 7% following their respective Q4 earnings, which showcased substantial growth. \n\n**UCO Bank Highlights:**\n- Reported a **23.7% increase in consolidated net profit**, reaching **Rs 665.72 crore** for the fourth quarter, up from **Rs 537.86 crore** a year earlier.\n- Total income rose to **Rs 8,136 crore**, a significant rise from **Rs 6,984 crore** in the previous year.\n- Marked a full fiscal year profit of **Rs 2,468 crore**, a sharp rise from **Rs 1,671 crore** in FY24.\n- Enhanced asset quality was highlighted by a decrease in the gross non-performing asset (GNPA) ratio from **3.46%** to **2.69%** year-on-year, with the net NPA ratio improving from **0.89%** to **0.50%**.\n- The total business soared by **14.1%** to **Rs 5.13 lakh crore**, driven by a **17.7%** increase in gross advances and an **11.6%** rise in deposits.\n- Planned to issue **270 crore fresh equity shares** in FY26 to meet SEBI’s minimum public shareholding requirements, following a successful **Rs 2,000 crore qualified institutional placement** (QIP).\n\n**Central Bank of India Overview:**\n- Reported a **28% year-on-year jump in net profit**, amounting to **Rs 1,033.6 crore**, compared to **Rs 807.3 crore** the prior year.\n- Total income rose by **7.6%** to **Rs 10,433 crore**, although net interest income (NII) faced a **4% decline** to **Rs 3,399 crore**.\n- Noteworthy improvements in asset quality were observed, with GNPA reducing from **3.86%** to **3.18%** and NNPA improving from **0.59%** to **0.55%**.\n- The return on assets increased to **0.90%** and return on equity reached **13.21%**.\n\nBoth banks posted their quarterly results after market hours on the previous day, prompting positive investor sentiment and improved share prices."
  },
  {
    "title": "Weathering the Storm: China's strategy amid US trade war",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/weathering-the-storm-chinas-strategy-amid-us-trade-war/slideshow/120717709.cms",
    "summary": "The ongoing trade war between the United States and China has escalated, significantly impacting both economies. In response to U.S. tariffs of up to 145% on Chinese exports, Chinese officials have implemented various strategies to mitigate economic damage and support domestic businesses.\n\n• **Economic Support Initiatives**: \n  - China has committed to enhancing support for businesses and the unemployed.\n  - The government plans to reduce interest rates and reserve requirements to ease lending conditions.\n\n• **Domestic Demand Stimulation**:\n  - To counteract declining exports, initiatives like rebates aimed at replacing old vehicles and appliances are being introduced, projected to generate over 5 trillion yuan (approximately $34.8 billion) in demand.\n  - Urbanization efforts are expected to drive significant investment opportunities.\n\n• **Retaliatory Measures**:\n  - In reaction to U.S. tariffs, China has imposed 125% tariffs on American goods, labeling U.S. tactics as \"bullying\" that disrupts global trade norms.\n\n• **Economic Outlook**:\n  - International bodies, including the IMF, have lowered China's growth forecast for 2025 to approximately 4%. Despite this, Chinese officials remain confident in their target of 5% growth, emphasizing the importance of employment stability and market confidence.\n\n• **Energy and Food Security**:\n  - China is decreasing imports of energy and agricultural products from the U.S., asserting that alternative domestic and global sources can meet national demands without compromise.\n\nThese measures accentuate China's focus on fortifying economic resilience as it navigates the complexities induced by the trade conflict with the United States. The overarching strategy emphasizes domestic stability and growth through structural reforms."
  },
  {
    "title": "Rupee fleetingly hits 2025 high on equity inflows, soft dollar",
    "url": "https://economictimes.indiatimes.com/markets/forex/rupee-fleetingly-hits-2025-high-on-equity-inflows-soft-dollar/articleshow/120717227.cms",
    "summary": "The Indian rupee briefly reached its highest level in 2025, hitting 84.95 against the U.S. dollar, owing to a combination of factors including strong equity inflows and a softening dollar. Despite a volatile trading session, the rupee's performance fluctuated, initially opening at 85.14 before appreciating to its peak. The context of this movement includes:\n  \n• **Escalating Tensions:** Heightened tensions between India and Pakistan have added to market uncertainties.\n• **Dollar Weakness:** A generally weaker U.S. dollar has contributed positively to the rupee's rise.\n• **Foreign Bank Inflows:** Increased capital from foreign banks has resulted in favorable conditions for the rupee.\n  \nAt the most recent update, the currency was trading at 85.04 per dollar, evidencing a continuation of market fluctuations influenced by both domestic and international factors. The situation remains dynamic as global economic conditions play a pivotal role in currency valuation, highlighting the need for vigilant monitoring of market trends."
  },
  {
    "title": "Reduce Tech Mahindra, target price Rs 1,250:  ICICI Securities",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/reduce-tech-mahindra-target-price-rs-1250-icici-securities/articleshow/120683882.cms",
    "summary": "ICICI Securities has issued a \"Reduce\" call on Tech Mahindra, establishing a target price of **Rs 1,250**, compared to the current market price of **Rs 1,440.9**. The firm recognizes potential turnaround efforts driven by growth in the BFSI (Banking, Financial Services, and Insurance) sector and strong Total Contract Value (TCV) deals. However, they caution that **macroeconomic challenges** and specific industry difficulties, especially within the **communication and manufacturing sectors**—which collectively account for about **50% of Tech Mahindra's revenue**—may hinder progress.\n\nKey highlights include:\n• Tech Mahindra's **total income** for Q4 FY25 was **Rs 13,556.70 crore**, representing a **1.91% increase** from the previous quarter.\n• The company reported a **net profit** of **Rs 1,143.10 crore** in the latest quarter.\n• Significant **year-over-year growth** in new deal TCV was recorded at **42.6%**, positively influencing the **FY26 growth outlook**.\n\nICICI Securities has adjusted its forecasts to reflect these challenges and continues to assess Tech Mahindra at **18 times** the expected future earnings per share (EPS). The brokerage maintains that the prevailing tough macroeconomic conditions could slow the pace of recovery and decision-making within the company. As of **March 31, 2025**, the ownership structure included **35.01% held by promoters**, with foreign institutional investors (FIIs) and domestic institutional investors (DIIs) owning **22.95%** and **32.11%**, respectively."
  },
  {
    "title": "TVS Motors Q4 Results Review: Analysts Split Despite Strong Results, EV Momentum",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/tvs-motors-q4-results-review-analysts-split-despite-strong-results-ev-momentum",
    "summary": "TVS Motor Company has reported an impressive performance for the fourth quarter of fiscal 2025, indicating strong growth in its electric vehicle (EV) segment. Notably, the standalone net profit surged by **75.74%** year-over-year to **₹853.12 crore**, attributed to a **16.91%** increase in revenue, which reached **₹9,550.44 crore** during this period. \n\nThe company announced the recognition of Production Linked Incentive (PLI) benefits for the entire year in its Q4 results, which significantly boosted profit margins. Analysts, however, hold contrasting views on the stock's future performance. \n\n• **Citi's Perspective:**\n  - Maintains a **'sell' rating** but has **raised** the target price from **₹1,800** to **₹2,050**.\n  - Cautions about potential challenges as the benefits from incentives taper off.\n  - Highlights that the margin growth, after adjusting for PLI, appears modest.\n  - Expects some market share improvement driven by upcoming electric three-wheeler model launches.\n\n• **Macquarie's Perspective:**\n  - Holds an **'outperform'** rating with a heightened target price of **₹3,045**.\n  - Praises TVS's strong positioning for growth and margin expansion, particularly in EV sales.\n  - Anticipates a recovery in exports, especially to markets in Africa and Latin America, alongside steady domestic demand growth.\n  - Suggests that strategic investments in product development will bolster long-term revenue growth.\n\nBoth brokerages agree on the positive outlook for the two-wheeler segment due to improvements in rural demand, infrastructure development, and the forthcoming wedding season. However, they diverge on the sustainability of margin levels following the expiration of incentive programs.  \n\nIn summary, while TVS Motors has delivered stellar results in Q4 FY2025, market analysts remain divided on its future prospects, balancing short-term optimism due to strong quarterly performance against potential long-term challenges related to incentive dependencies."
  },
  {
    "title": "Q4 Results Today Live Updates: Bajaj Finance, Bajaj Finserv, Trent, Ambuja, BPCL, NTPC Green to post earnings today",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/q4-results-live-updates-today-bajaj-finance-trent-ltd-ambuja-cement-bpcl-ntpc-green-energy-vishal-mega-mart-q4-net-profit-loss/liveblog/120716472.cms",
    "summary": "• The *Nifty* index currently stands at **24,335.95**, having risen by **7.46 points**.\n\n• Featured funds with notable returns over the past five years include:\n   - **Canara Robeco ELSS Tax Saver Regular - Growth**: **22.72%**\n   - **HSBC Large Cap Fund Direct-Growth**: **21.64%**\n   \n• The fourth quarter earnings season is underway, with **41 companies** scheduled to report results, including major players such as:\n   - **Bajaj Finance**\n   - **Bajaj Finserv**\n   - **Trent**\n   - **Ambuja Cement**\n   - **BPCL**\n   - **NTPC Green**  \n\n• Key highlights from the latest updates include:\n   - **Trent Ltd.** reported a profit after tax (PAT) of **Rs 354 crore**, which exceeds market estimates of **Rs 303 crore**.\n   - The company plans to distribute a dividend of **Rs 5 per share**.\n   - **Ambuja Cements** posted a remarkable **75% YoY increase** in standalone PAT, reaching **Rs 929 crore**, with an overall revenue growth of **19%**.\n   - A dividend of **Rs 2.00 per equity share** has also been recommended by Ambuja Cement. \n\n• In terms of market sentiment:\n   - Trent shares experienced a **4% increase** following the positive earnings news.\n   - Conversely, Ambuja Cements saw a **2% drop** in share price post-earnings announcement.\n\n• Analysts predict a mixed outlook for the quarters ahead, with varying expectations for profit and revenue growth across sectors."
  },
  {
    "title": "8 multibagger stocks backed by over 75% promoter shareholding",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/8-multibagger-stocks-backed-by-over-75-promoter-shareholding/slideshow/120716529.cms",
    "summary": "• The **Nifty index** currently stands at **24,328.55**, reflecting a modest **0.05%** increase.\n  \n• Two **featured funds** with notable five-year returns are:\n   - **Canara Robeco ELSS Tax Saver Regular - Growth**: **22.72%**\n   - **HSBC Large Cap Fund Direct-Growth**: **21.64%**\n\n• In the context of stock investments, an article highlights **eight multibagger stocks** that have shown remarkable returns over the last year, each boasting over **75% promoter shareholding**:\n   - **Ujaas Energy**: 1,783.94% return, promoter holding at 93.79%\n   - **Sobhagya Mercantile**: 1,649.44% return, promoter holding at 75.02%\n   - **VTM**: 240.56% return, promoter holding at 75%\n   - **Mazagon Dock Shipbuilders**: 115.22% return, promoter holding at 84.83%\n   - **Shraddha Prime Projects**: 87.25% return, promoter holding at 75%\n   - **Blue Jet Healthcare**: 84.60% return, promoter holding at 86%\n   - **Astrazeneca Pharma India**: 63.64% return, promoter holding at 75%\n   - **Viceroy Hotels**: 115.80% return, promoter holding at 84.11%\n\n• The significance of **promoter shareholding** is emphasized as an important metric that reflects a company’s management confidence in its business prospects, alongside other fundamental assessments.\n\n• Investors are notably interested in these stocks due to their ability to deliver outsized gains, reaffirming the connection between **promoter confidence** and stock performance."
  },
  {
    "title": "D-Street's $489 billion rally is winning back global funds",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/d-streets-489-billion-rally-is-winning-back-global-funds/articleshow/120716030.cms",
    "summary": "Global funds are increasingly flowing back into Indian stocks, significantly contributing to a rally that has added approximately **$489 billion** to the market's value this month, bringing it to nearly **$4.4 trillion**. This resurgence comes after a period of sustained net selling and is largely driven by optimism regarding India's robust, domestically-focused economy, which appears well-positioned to withstand global trade tensions more effectively than other emerging markets.\n\nKey points:\n\n• **Investment Rebound**: After months of being net sellers, foreign investors purchased **$589 million** worth of Indian shares over a recent trading day, marking the eighth consecutive day of net buying. Overall, foreign investments have totaled around **$680 million** in April.\n\n• **Economic Sentiment**: Analysts highlight that India's perceived economic resilience amid external challenges, including the ongoing global trade war, is attracting renewed interest from foreign funds. **Sneha Tulsyan**, an investment analyst, noted that factors such as anticipations of further monetary easing and declining crude oil prices bolster a positive economic narrative for India.\n\n• **Market Performance**: The NSE Nifty 50 Index has surged over **3%** in April, outperforming the broader **MSCI Asia Pacific Index**. Despite higher valuations and geopolitical tensions with Pakistan following militant attacks, investor confidence remains firm, viewing potential dips due to such tensions as buying opportunities.\n\n• **Continued Investments**: Fund managers suggest that India continues to present lucrative opportunities driven by demographic advantages and its strategic position in upcoming global supply chains, signifying strong long-term investment potential.\n\nThis combination of factors indicates a robust recovery and ongoing investor interest in India's equity market, signaling further investment potential as foreign funds seek to capitalize on India's growth trajectory."
  },
  {
    "title": "Bullish Momentum: 8 stocks with White Marubozu Pattern on April 28",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-8-stocks-with-white-marubozu-pattern-on-april-28/slideshow/120715907.cms",
    "summary": "On April 28, 2025, *eight stocks* from the **Nifty200** index displayed a bullish *White Marubozu* candlestick pattern, indicating strong buying momentum during trading. This technical analysis pattern occurs when the opening price is the lowest and the closing price is the highest within a particular time period. It is characterized by a long white (or green) candlestick with no upper shadow and a minimal lower shadow, suggesting that buyers maintained control from the opening to the closing bell.\n\n**Stocks exhibiting the White Marubozu pattern include:**\n• **Hindustan Aeronautics** - Closed at **Rs 4,426.3**, up **5.48%**  \n• **Bharat Petroleum Corporation** - Closed at **Rs 310**, up **4.84%**  \n• **Lupin** - Closed at **Rs 2,105.4**, up **4.25%**  \n• **BSE** - Closed at **Rs 6,564.5**, up **4.14%**  \n• **Bharat Heavy Electricals** - Closed at **Rs 230.31**, up **3.57%**  \n• **Glenmark Pharmaceuticals** - Closed at **Rs 1,407.6**, up **3.45%**  \n• **Hindustan Petroleum Corporation** - Closed at **Rs 392.2**, up **3.02%**  \n• **IDFC First Bank** - Closed at **Rs 66.5**, up **0.64%**  \n\nTraders frequently utilize the White Marubozu pattern as a basis for their investment strategies, interpreting it as a signal of sustained buyer interest and potential future price increases. This pattern, therefore, could suggest a favorable market outlook for these particular stocks in the near term."
  },
  {
    "title": "Sensex Rises Over 400 Points, Nifty Up 100 Points As Trade War Worries Ease",
    "url": "https://www.ndtv.com/india-news/sensex-rises-370-points-nifty-up-100-points-as-trade-war-worries-ease-8283047#publisher=newsstand",
    "summary": "The recent performance of the Indian stock market reflects a positive trend, with key indices such as Sensex and Nifty experiencing significant gains. \n\n• **Market Overview:**\n   - The **Sensex** opened up by **409.4 points**, a rise of **0.51%**, bringing it to **80,627.85**.\n   - The **Nifty** similarly increased by **118.10 points**, or **0.49%**, to reach **24,446.60**.\n   - The **Nifty Bank index** surged by **492.90 points** (0.89%), standing at **55,925.70**.\n\n• **Sector Performance:**\n   - **Positive activity** was noted particularly in sectors such as **PSU banks**, **automobiles**, and **IT** during early trading.\n   - The **Nifty Midcap 100** index rose by **490.90 points** (0.43%) to **54,931.15**, while the **Nifty Smallcap 100** index climbed by **183.15 points** (1.10%) to **16,860.05**.\n\n• **Technical Analysis:**\n   - Analysts suggest that the Nifty could find support around **24,250**, with immediate resistance anticipated at **24,500**, followed by **24,600 and 24,700**.\n   - For the Bank Nifty, support levels are expected around **55,300**, **55,000**, and **54,700**, while an upward movement may meet resistance at **55,600**.\n\n• **Current Market Sentiment:**\n   - The market's positive trajectory is marked by the recent strong support at the **200-day moving average (DMA)** zone of **79,100**, indicating improved bullish market sentiments.\n   - A decisive break above the **80,400** level is necessary for a potential breakout in the upcoming days.\n\n• **Global Context:**\n   - In international markets, while China and Bangkok faced downturns, markets like Jakarta, Seoul, Hong Kong, and Japan recorded gains.\n   - On the previous trading day, the **Dow Jones** industrial average gained **0.28%** to close at **40,227.59**, with the **S&P 500** rising by **0.06%** to **5,528.75**. The **Nasdaq** slightly decreased by **0.10%** to **17,366.13**.\n\n• **Institutional Inflows:**\n   - Foreign institutional investors (FIIs) continued to be net buyers for the ninth consecutive session, with inflows amounting to **₹2,474.10 crore** on April 28. Domestic institutional investors (DIIs) also recorded inflows of **₹2,817.64 crore**.\n\nThe overall sentiment in the market remains optimistic, bolstered by international cues and steady institutional investments, suggesting a potentially bullish outlook in the near future."
  },
  {
    "title": "Aurobindo Pharma shares in focus after fire at Andhra Pradesh facility; operations paused for 20-25 days",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/aurobindo-pharma-shares-in-focus-after-fire-at-andhra-pradesh-facility-operations-paused-for-20-25-days/articleshow/120715678.cms",
    "summary": "Aurobindo Pharma is currently under scrutiny following a fire incident at its Penicillin-G manufacturing facility located in Kakinada SEZ, Andhra Pradesh, which occurred late on April 27, 2025. The fire, attributed to the self-ignition of coal, primarily affected the coal crusher area and led to damage to some ancillary equipment, but fortunately left the core manufacturing infrastructure unscathed. As a precaution, Aurobindo Pharma has paused operations for approximately 20 to 25 days to facilitate the necessary repairs. \n\nKey points of interest include:\n\n• **Financial Impact**: The company has assured stakeholders that it does not anticipate any material financial repercussions from this incident. A thorough damage assessment is in progress.\n\n• **Analysts' Outlook**: Investment analysts maintain a 'Buy' rating on Aurobindo Pharma, with an average target price set at ₹1,471, indicating an anticipated upside of 18%. Technical indicators provide additional support for this positive outlook, showing bullish trends.\n\n• **Stock Performance**: On the preceding trading day, Aurobindo Pharma shares experienced a rise of 2.4%, closing at ₹1,246.7. Over the past three months, the stock has seen a gain of 10% and has surged by 102% over the past two years. The company's current market capitalization is around ₹72,411 crore.\n\n• **Technical Indicators**: The Relative Strength Index (RSI) for the stock stands at 62.1, suggesting it is neither overbought nor oversold. Furthermore, the Moving Average Convergence Divergence (MACD) is above its centerline, further indicating a bullish market trend. \n\nAurobindo Pharma's management continues to reinforce their commitment to upholding safety and quality standards while swiftly recovering from this operational setback."
  },
  {
    "title": "Buy Dalmia Bharat, target price Rs 2,260:  Axis Securities",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/buy-dalmia-bharat-target-price-rs-2260-axis-securities/articleshow/120683214.cms",
    "summary": "Axis Securities has reaffirmed its **Buy** recommendation on **Dalmia Bharat**, setting a target price of **₹2,260**. This position is attributed to improved margins supported by reduced costs in Q4FY25. The brokerage projects a strong growth trajectory for the company with estimated compounded annual growth rates (CAGRs) from FY24 to FY27 as follows: \n\n• **Volume**: 8%  \n• **Revenue**: 6%  \n• **EBITDA**: 11%  \n• **PAT**: 17%\n\nThe cement sector is expected to expand at **1.2 times** the GDP growth rate, with India's GDP projected to grow between **6.5% to 7%** in the forthcoming years. \n\n**Key Highlights:**\n\n• **Financial Performance**: Dalmia Bharat reported a consolidated total income of **₹4,184 crore** in Q4FY25, showcasing a **30.02% quarter-over-quarter increase**, though down **5.49%** year-over-year. The latest net profit stands at **₹439 crore**.\n• **Market Position**: Dalmia Bharat has been a significant player in the cement industry since its incorporation in **2013**, boasting a current market capitalization of **₹37,002.85 crore** and around **19 crore shares outstanding**.\n• **Management**: Led by **Mr. Yadu Hari Dalmia**, the company is strategically positioned with a promoter holding of **55.84%**, and Foreign Institutional Investors (FIIs) owning **8.29%**.\n• **Future Outlook**: The positive outlook is underpinned by factors such as capacity expansion, market share gains, and increasing operational efficiencies. It is anticipated that top players in the cement market could consolidate system-wide shares from **65% to 70%** by **FY27-28**, facilitating enhanced pricing power and supply chain efficiency.\n\nCurrently, Dalmia Bharat's stocks trade at **13x FY26 EV/EBITDA** and **11x FY27 EV/EBITDA**, with an attractive valuation noted for potential upside as the market continues to recover.\n\nIn conclusion, Axis Securities maintains a bullish view on Dalmia Bharat, illustrating a robust investment proposition influenced by sectoral growth factors and enhanced operational efficiencies."
  },
  {
    "title": "Reliance Industries shares at inflection point. 6 reasons why FY26 could be the year of big re-rating",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-at-inflection-point-6-reasons-why-fy26-could-be-the-year-of-big-re-rating/articleshow/120715556.cms",
    "summary": "Reliance Industries Ltd. (RIL) is positioned for a significant re-rating in FY26 following a contraction phase. This shift is catalyzed by notable Q4 results and a strategic pivot towards digital and consumer sectors. Analysts anticipate a robust stock performance, fostering growth through various triggers:\n\n• **Telecom Developments:** There is a positive trend in tariff increases following Jio's prior heavy investments. Analysts suggest that these hikes could enhance return on capital employed (ROCE) significantly in the next few years.\n\n• **Green Energy Initiatives:** RIL's new energy projects are progressing from concept to operational stages, focusing on scaling green hydrogen production and battery manufacturing. There is potential for substantial value creation due to these advancements.\n\n• **Oil-to-Chemicals (O2C):** Despite historical revenues being stable, projections indicate a return to growth. Factors such as favorable crude pricing and expanding chemicals businesses are setting the foundation for renewed earnings.\n\n• **Retail Expansion:** RIL’s retail sector is projected to grow substantially, fueled by new brand launches and adoption of quick-commerce strategies, thus enhancing its market valuation.\n\n• **Valuation Opportunities:** Current stock valuations suggest that there remains considerable upside. Analysts consider that RIL is undervalued relative to its historical performance, providing a healthy risk-reward scenario for investors.\n\n• **Value Unlocking Potential:** Anticipation for significant updates during the upcoming AGM indicates that possible monetization events related to Jio could bring new value to RIL’s stock.\n\nThese dynamics collectively suggest that  FY26 could reprieve RIL from previous underperformance, positioning it favorably in the market."
  },
  {
    "title": "Rupee Weakens At Open Against US Dollar",
    "url": "https://www.ndtvprofit.com/markets/rupee-weakens-at-open-against-us-dollar",
    "summary": "The Indian rupee opened weaker against the US dollar on April 29, 2025, depreciating by 5 paise to 85.08. This decline followed a previous close of 85.03, marking a reversal from two days of gains. The currency fluctuation is attributed to pressures stemming from Brent crude prices and a slight easing of the dollar index, which was recorded at 99.17.\n\nKey Details:\n• **Current Rate**: 85.08 against the US dollar \n• **Trading Range for the Day**: Expected between 84.90 and 85.60 \n• **Market Influences**:\n  - Brent crude prices stabilized at about $66/barrel following a 1.5% drop.\n  - The dollar index observed a movement of 0.17%.\n  \nExpert Insights:\n- Anil Kumar Bhansali from Finrex Treasury Advisors indicated that exporters are likely to hold off sales, while importers may hedge payables at around the 85.00 mark.\n- Foreign portfolio investors (FPIs) have been purchasing Indian shares and debt, supporting the rupee’s strength from nearly 88 two months ago to its current levels.\n- Developing geopolitical scenarios, especially discussions between Washington and Tehran regarding Iranian oil curbs, could further influence market dynamics.\n\nIn summary, ongoing economic trends and geopolitical factors are playing a significant role in determining the volatility of the Indian rupee against the US dollar, with market expectations leaning towards cautious trading strategies by exporters and importers."
  },
  {
    "title": "These 4 stocks dropped below VWAP",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-stocks-dropped-below-vwap/slideshow/120715404.cms",
    "summary": "On April 28, 2025, four stocks from the Nifty500 index experienced a decline of more than 1% relative to their Volume Weighted Average Price (VWAP). This decline suggests a potential **bearish trend**, indicating increased selling pressure. The following stocks were identified:\n\n• **Chalet Hotels**:  \n  - **VWAP**: Rs 830.52  \n  - **Last Trade Price (LTP)**: Rs 812.90  \n\n• **Tejas Networks**:  \n  - **VWAP**: Rs 763.27  \n  - **LTP**: Rs 747.85  \n\n• **Gravita India**:  \n  - **VWAP**: Rs 1871.12  \n  - **LTP**: Rs 1851.80  \n\n• **Aavas Financiers**:  \n  - **VWAP**: Rs 2011.98  \n  - **LTP**: Rs 1991.50  \n\nThe indicator of a stock's closing price falling below the VWAP implies that the stock was traded at lower average prices throughout the trading day, potentially signaling increased selling activity and a negative outlook in the market. Investors are advised to monitor these equities closely, considering the implications of this trend on future performance."
  },
  {
    "title": "Bharat Forge shares in focus as Trump plans to ease auto tariff impact",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-shares-in-focus-as-trump-plans-to-ease-auto-tariff-impact/articleshow/120715316.cms",
    "summary": "Bharat Forge, a prominent player in the automotive sector, is likely to be in focus following the recent announcement from U.S. officials about President Donald Trump’s administration planning to ease proposed automotive tariffs. The initiative is aimed at safeguarding domestic manufacturing and mitigating potential compounded costs that could arise from high tariffs. Industry representatives had previously expressed concerns regarding supply chain disruptions that could result from a 25% tariff on imported auto parts, as well as the adverse implications for vehicle pricing and service costs.\n\nKey points include:\n\n• **Tariff Easing**: The U.S. administration intends to minimize the duties on foreign parts incorporated into domestically manufactured vehicles. This decision follows appeals from multiple U.S. auto industry groups requesting the scrapping of previously discussed tariffs, which they fear would inflate vehicle prices leading to diminished sales and servicing costs.\n\n• **Impact on Bharat Forge**: Analysts retain a 'Hold' rating for Bharat Forge, projecting an average target price of Rs 1,202 per share. This suggests an upward potential of approximately 8% from current market levels.\n\n• **Industry Perspective**: U.S. Commerce Secretary Howard Lutnick emphasized the strategic partnership being fostered between the Trump administration and domestic automotive manufacturers, framing this tariff reduction as a win for American trade policy. \n\n• **Industry Concerns**: Letter communications from leading auto manufacturers indicated their worries over the possible fallout from abrupt tariff imposition, highlighting that such disruptions could lead to production halts, layoffs, and potential bankruptcy for smaller suppliers reliant on uninterrupted supply chains.\n\nOverall, the easing of tariffs is framed as a strategic move to stabilize the automotive sector while fostering domestic manufacturing, an aspect crucial for Bharat Forge as it navigates through these developments in the marketplace."
  },
  {
    "title": "TVS Motor shares tumble 3% after Q4 results",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-shares-in-focus-after-pat-rises-76-yoy-revenue-surges-17-in-q4/articleshow/120715182.cms",
    "summary": "Shares of **TVS Motor Company** experienced a decline of *3%* to ₹2,715.05 on April 29, 2025, despite reporting a significant *76% year-on-year* (YoY) increase in standalone net profit for the fourth quarter (Q4) amounting to ₹852 crore, compared to ₹485 crore from the previous year. Additionally, the company's revenue for the quarter rose *17% YoY* to ₹9,550 crore, surpassing the ₹8,168 crore recorded in the same period last year.\n\nKey Financial Insights:\n• The highest-ever operating EBITDA was reported at ₹1,333 crore, up from ₹926 crore in the corresponding quarter of the last year.\n• The operating EBITDA margin was noted at *14%* for Q4.\n• On a sequential basis, profit after tax increased *38%* from ₹618 crore in Q3, with revenue rising *5%* from ₹9,097 crore.\n\nDespite these positive earnings figures, investor sentiment was subdued due to concerns surrounding increased investments in subsidiaries, particularly in the *Norton bike portfolio* and *electric bicycles (e-bikes)*. Moreover, there are apprehensions regarding the adaptation of products to meet *Euro 5+ emissions standards*, which may introduce design and pricing complexities.\n\nMarket analysts, including **HDFC Securities**, maintained an 'Add' rating on TVS Motor's stock, suggesting a target price of ₹2,833. The brokerage anticipates that the domestic two-wheeler market will exhibit growth similar to the previous fiscal year (FY25), while the company's international sales, particularly in key African markets, are expected to stabilize and improve.\n\nOverall, while TVS Motor showcased robust growth in profit and revenue, the stock's decline post-announcement reflects the market's cautious stance towards its future investment strategies and regulatory compliance challenges."
  },
  {
    "title": "Paytm shares in focus as subsidiary faces Rs 5,712 crore GST demand notice",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-in-focus-as-subsidiary-faces-rs-5712-crore-gst-demand-notice/articleshow/120715181.cms",
    "summary": "Paytm's subsidiary, First Games Technology, has received a Show Cause Notice (SCN) from the Directorate General of GST Intelligence (DGGI) amounting to ₹5,712 crores. This notice demands a 28% Goods and Services Tax (GST) on total entry amounts between January 2018 and March 2023, contrasting with the 18% GST currently paid on platform fees in the online gaming sector.\n\nKey details include:\n\n• **Impact on Paytm**: Paytm has stated that the SCN is not expected to have a *material financial impact* on its operations. The company plans to challenge the demand in court and seeks interim relief against the retroactive application of the GST.\n\n• **Basis for the Notice**: The DGGI argues that GST should be based on the total entry amount instead of the fees collected by gaming platforms. This marks a significant change in the tax liability framework for online gaming companies in India.\n\n• **Future Actions**: Paytm plans to file a writ petition in court, arguing that the retrospective GST amendment should not apply to activities prior to October 1, 2023. The company considers its investment in First Games a joint venture, reflecting a shareholding of approximately ₹25 crores.\n\nThis situation has likely prompted attention on Paytm's stock performance as the market anticipates the implications of this regulatory issue. The broader context includes ongoing developments in the GST framework affecting the rapidly evolving online gaming industry in India."
  },
  {
    "title": "I-Sec maintains Hold on Nestle India, raises target price to Rs 2,350",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/i-sec-maintains-hold-on-nestle-india-raises-target-price-to-rs-2350/articleshow/120683076.cms",
    "summary": "ICICI Securities has reiterated its 'Hold' rating on Nestle India, adjusting the target price to **Rs 2,350**, up from the previous Rs 2,300. The current market price of *Nestle India* is **Rs 2,391.8**. \n\n### Financial Highlights\n• The company is projected to achieve:\n  - **Revenue CAGR:** 11% \n  - **PAT CAGR:** 17% over FY25-26E.  \n• For the quarter ending **March 31, 2025**, Nestle India reported:\n  - *Total Income:* **Rs 5,512.32 crore** (up **15.22%** from previous quarter but down **45.74%** from the same quarter last year).\n  - *Net Profit after Tax:* **Rs 885.88 crore**.   \n\n### Operational Insights\n• Nestle India, founded in 1959, operates within the FMCG sector and has a market capitalization of approximately **Rs 232,699.33 crore**. Its core products include:\n  - Milk Products\n  - Prepared Dishes & Cooking Aids\n  - Confectionery\n  - Beverages (Powdered)  \n  - Export Incentives  \n  - Other Operating Revenue  \n\n### Risks and Considerations\n• Potential **upside risks** include a **faster-than-expected recovery** in demand.  \n• Conversely, potential **downside risks** may arise from **rising raw material costs** and inflation.   \n\n### Stakeholder Interests\n• As of March 31, 2025, the ownership structure is as follows:\n  - **Promoters:** 62.76%\n  - **Foreign Institutional Investors (FIIs):** 10.02%\n  - **Domestic Institutional Investors (DIIs):** 11.21%\n\nThis detailed analysis provides a comprehensive understanding of Nestle India's market positioning and future outlook as assessed by ICICI Securities."
  },
  {
    "title": "NRI Talk: Ideal allocation for NRIs - 60% equity, 20% debt, and a global twist, says Prashant Tandon",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/nri-talk-ideal-allocation-for-nris-60-equity-20-debt-and-a-global-twist-says-prashant-tandon/articleshow/120687211.cms",
    "summary": "In a comprehensive discussion on optimal asset allocation for Non-Resident Indians (NRIs), Prashant Tandon, Executive Director at Waterfield Advisors, emphasizes the importance of maintaining a balanced investment strategy, particularly in the context of recent global economic challenges and emerging opportunities. \n\n• **Recommended Allocation:**\n  - **60% in Equity:** This includes investments in diverse sectors that can offer substantial growth potential.\n  - **20% in Debt:** This serves as a buffer against market volatility, providing safer returns during uncertain periods.\n  - **10% in Commodities:** Investing in physical assets like gold can help in hedging against inflation and market risks.\n  - **5% in International Allocations:** Diversifying geographically can mitigate risk associated with local market downturns.\n  - **5% in Real Estate Investment Trusts (REITs) and Infrastructure Investment Trusts (InvITs):** These are beneficial for generating consistent income and capital appreciation.\n\n• **Global Investment Context:**\n  - The ongoing trade tensions, particularly between the US and China, have precipitated volatility in global markets. Tandon highlights that these trade wars are changing the investment landscape, necessitating a reassessment of geographic allocations.\n  - NRIs are advised to consider reallocating from overvalued US equities, given the stark contrast between the US equity market's capitalization and its share of the global economy.\n\n• **Emerging Market Opportunities:**\n  - Tandon discusses India's potential as a manufacturing hub, especially in sectors like textiles, chemicals, electronics, and automobiles, due to reduced tariffs compared to other regions.\n  - He suggests that as the NRIs look for robust investments, exploring sectors in India could yield high returns, particularly amid shifting global manufacturing dynamics.\n\n• **Strategies to Navigate Market Trends:**\n  - Investors are encouraged to maintain liquidity in investments to capitalize on arising opportunities.\n  - Incorporating alternative strategies, such as Arbitrage and Absolute Return Funds, can provide a hedge against the unpredictability driven by trade-related market fluctuations.\n\nTandon's insights reinforce a strategic approach for NRIs focusing on long-term asset growth while strategically managing the inherent risks of global volatility. His guidance aims to help NRIs to effectively navigate changing market landscapes and secure their financial futures over the next 3-5 years."
  },
  {
    "title": "IndusInd Bank shares in focus as Deputy CEO Arun Khurana resigns after derivatives probe",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/indusind-bank-shares-in-focus-as-deputy-ceo-arun-khurana-resigns-after-derivatives-probe/articleshow/120714893.cms",
    "summary": "IndusInd Bank's shares are currently under heightened scrutiny following the resignation of Arun Khurana, the Deputy CEO and Whole-time Director. His departure, effective immediately, is attributed to a derivatives accounting irregularity that adversely affected the bank’s profit and loss statement. Khurana referenced this issue in his resignation letter to the Board of Directors, linking it to misaccounting practices concerning internal derivative trades managed by his Treasury Front Office.\n\nKey points regarding this situation include:\n\n• **Resignation Context:** Khurana’s resignation comes on the heels of a statement from the bank, confirming that it would take disciplinary actions against employees involved in the accounting discrepancies and would realign senior management roles to enhance accountability.\n\n• **Investigation Findings:** An independent firm, appointed by the bank’s board to investigate, reported on April 26 that improper accounting methods resulted in a cumulative negative impact of approximately **Rs 1,959.98 crore** on the bank’s financials as of March 31, 2025. The discrepancies largely stem from incorrect accounting practices, particularly in relation to early terminations of internal derivative trades.\n\n• **Bank’s Actions:** To mitigate risks, IndusInd Bank ceased all internal derivative trading operations as of April 1, 2024. This initiative followed earlier disclosures regarding potential mark-to-market losses that could jeopardize 2.35% of the bank’s net worth, approximately **Rs 1,600 crore**.\n\n• **Market Reactions:** Following the initial revelation of the derivative losses on March 10, the bank's share price fell significantly, plummeting nearly 25% from **Rs 900 to Rs 686** each.\n\n• **Further Investigative Measures:** IndusInd Bank has engaged PricewaterhouseCoopers (PwC) to assess the identified losses and, under the directives of the Reserve Bank of India, has involved Grant Thornton Bharat for a comprehensive forensic investigation.\n\nIn summary, the resignation of Arun Khurana and the subsequent fallout are pivotal events for IndusInd Bank, potentially affecting investor confidence and market performance in the near term."
  },
  {
    "title": "JM Financial maintains Buy on Hindustan Unilever, raises target price to Rs 2,555",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/jm-financial-maintains-buy-on-hul-raises-target-price-to-rs-2-555nbsp/articleshow/120682865.cms",
    "summary": "JM Financial has maintained a **Buy** rating on **Hindustan Unilever Limited (HUL)** and revised its target price to **Rs 2,555**, up from **Rs 2,485**. The analyst anticipates that the stock price will reach this target within one year. As of now, HUL is trading at **Rs 2,331.6**. The company's consolidated total income for the quarter ending March 31, 2025, was **Rs 15,979 crore**, which reflects a slight decrease of **0.44%** from the previous quarter but an increase of **3.48%** from the same quarter last year. \n\nKey insights from the financial analysis include:\n\n• **Volume-led Growth:** Management is optimistic about driving growth through volume, particularly during the first half of FY26, which is expected to outperform the second half of FY25.\n• **EBITDA Margins Stability:** The company is projected to maintain EBITDA margins between **22-23%** in upcoming quarters.\n• **Price Adjustments:** If commodity inflation remains stable, management may implement low-single-digit price increases.\n• **Long-term EPS Growth:** The guidance for double-digit earnings per share (EPS) growth in the medium to long term has not changed.\n\nRegarding ownership, as of March 31, 2025:\n• Promoters hold **61.9%** of shares.\n• Foreign Institutional Investors (FIIs) own **10.62%**.\n• Domestic Institutional Investors (DIIs) have **15.43%** ownership.\n\nOverall, JM Financial emphasizes the strong fundamentals and potential for growth in HUL, making it a recommended investment for shareholders seeking long-term value."
  },
  {
    "title": "Gensol Engineering shares in focus as ED raids Ahmedabad, Gurgaon offices over FEMA probe",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/gensol-engineering-shares-in-focus-as-ed-raids-ahmedabad-gurgaon-offices-over-fema-probe/articleshow/120714738.cms",
    "summary": "In a significant regulatory development, Gensol Engineering's shares hit the 5% lower circuit limit on the Bombay Stock Exchange (BSE) to Rs 82.20 following raids conducted by the Enforcement Directorate (ED) at its offices in Ahmedabad and Gurgaon. This action is part of a broader investigation into allegations of financial misconduct under the Foreign Exchange Management Act (FEMA). During the raids, the ED seized documents and electronic devices, with ongoing scrutiny on the company's financial dealings.\n\nThe Enforcement Directorate has also issued directions related to these probes to major banks, including Axis Bank, HDFC Bank, and ICICI Bank. Specific details of these directives remain undisclosed. Notably, this incident follows a prior interim order from the Securities and Exchange Board of India (SEBI), which has barred Gensol's promoters, Anmol Singh Jaggi and Puneet Singh Jaggi, from participating in securities markets due to alleged fund diversions and corporate governance violations, which reportedly include misusing loans for personal expenses.\n\nGensol Engineering, which specializes in solar energy and electric vehicle leasing, has faced increasing pressure from regulators, resulting in an 83% drop in its share price in 2025 amid rising concerns over its financial health. The company's shares have fallen for 13 consecutive trading sessions, reflecting a significant decline in investor confidence, exacerbated by ongoing legal challenges. The promoters are under ongoing scrutiny regarding the alleged misallocation of loan funds, and their ability to hold positions in listed companies has been suspended.\n\nIn conclusion, the regulatory actions surrounding Gensol Engineering illustrate heightened scrutiny in India's corporate governance landscape, impacting investor sentiment and the company’s stock performance significantly."
  },
  {
    "title": "EU 'off the pace' in global microchip race: auditors",
    "url": "https://www.thehindu.com/sci-tech/technology/eu-off-the-pace-in-global-microchip-race-auditors/article69503721.ece",
    "summary": "The European Union (EU) is facing significant challenges in the global microchip production race, according to a report from the European Court of Auditors. The auditors highlight that the EU is not only lagging but is projected to fall short of its ambition to capture 20% of the global market by 2030, with estimates indicating an increase to only 11.7% from the current 10%. Annemie Turtelboom, a member of the Court, emphasizes the need for the EU to reassess its strategy in light of rapid advancements and competition from powers like the United States and China.\n\nKey points from the report include:\n\n• **Deficient Growth Rates**: The growth rates currently seen in the EU's microchip sector do not align with achieving the ambitious market share target.\n  \n• **Impact of Geo-Political Factors**: The competition is intensifying, and the EU appears to be at a disadvantage, particularly after the pandemic caused disruptions in supply chains leading to shortages.\n\n• **Flawed Strategic Foundations**: The EU's Chips Act, passed in 2023 to promote local production, is under scrutiny as investments by the EU's competitors are reported to significantly outpace those projected by the Act.\n\n• **Compounding Challenges**: Factors such as high energy costs, a reliance on imports for raw materials, export controls, and a shortage of skilled labor are indicated as hurdles to the EU's success in this sector.\n\n• **EU's Defense**: In response to the auditors’ findings, EU digital spokesman Thomas Regnier stated that the Chips Act provides a strong foundation aimed at rejuvenating Europe's semiconductor sector after a prolonged decline.\n\nThe auditors conclude that not taking the necessary steps to adapt will further hinder the EU's capability to compete effectively in a fast-evolving international market."
  },
  {
    "title": "Q4 Results Live: Hexaware Technologies Profit Rises 2%; Ambuja Cements, Bajaj Finance, Trent To Be In Focus",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/q4-results-2025-today-ambuja-cements-bajaj-finserv-bajaj-finance-trent-bpcl-ceat-earnings-live-blog",
    "summary": "Several major companies, including Trent and BPCL, have recently reported their financial results for the fourth quarter. This data is pivotal for understanding profitability, revenue changes, and future guidance.\n\n**Key Points from Financial Reports:**\n\n• **BPCL (Bharat Petroleum Corporation Limited)**\n  - **Net Profit:** Declined by **31%**, reaching **₹3,214 crore** compared to ₹4,649 crore from the previous year.\n  - **Revenue:** Reduced by **1.73%** to **₹1.11 lakh crore**, while estimates suggested a slightly higher revenue of ₹1.08 lakh crore.\n  - **EBITDA:** Increased by **2.4%** to **₹7,765 crore**, showing improved operational efficiency.\n\n• **Trent Limited**\n  - **Net Profit:** Dropped by **47%** to **₹349.92 crore**. However, this still exceeded Bloomberg's estimate of ₹302.7 crore.\n  - **Revenue:** Rose by **28.8%** to **₹4,106.10 crore**, slightly below the forecast of ₹4,132 crore.\n  - **EBITDA:** Increased by **38%**, with margins improving to **16%** from 15%.\n\n• **Ambuja Cements**\n  - Proposes a **₹2 per share dividend** following strong performance metrics including a notable increase in both EBITDA margins and volume.\n\n• **Focus on Stocks:** Financial analysts and investors are keenly observing Trent and BPCL due to their significant deviations from expected performance. Furthermore, upcoming earnings reports from other companies are expected to shape market sentiment and trends for the fiscal year ahead.\n\n**Overall Market Insight:**\nThis reporting season emphasizes the uncertainty many firms face, evidenced by varying performance levels among prominent entities. Stakeholders are advised to monitor further developments, particularly concerning dividend announcements and earnings guidance for fiscal year 2026."
  },
  {
    "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/120714599.cms",
    "summary": "On April 28, 2025, a technical analysis highlighted a **positive breakout** for 10 stocks within the Nifty200 index, as their closing prices exceeded their **200-day moving averages (DMA)**. The 200 DMA serves as a pivotal indicator for traders assessing stock trends; consistently trading above this average is generally interpreted as an uptrend. \n\n**Highlighted Stocks:**\n• **Hindustan Aeronautics Ltd.**   \n   - 200 DMA: Rs 4278.47  \n   - Last Traded Price (LTP): Rs 4426.30  \n\n• **Bharat Petroleum Corporation Ltd.**  \n   - 200 DMA: Rs 302.65  \n   - LTP: Rs 310  \n\n• **Torrent Pharmaceuticals Ltd.**  \n   - 200 DMA: Rs 3258.44  \n   - LTP: Rs 3335  \n\n• **Reliance Industries Ltd.**  \n   - 200 DMA: Rs 1339.98  \n   - LTP: Rs 1368.80  \n\n• **Mahindra & Mahindra Ltd.**  \n   - 200 DMA: Rs 2875.44  \n   - LTP: Rs 2930.60  \n\n• **Aditya Birla Capital Ltd.**  \n   - 200 DMA: Rs 196.81  \n   - LTP: Rs 199.42  \n\n• **Ashok Leyland Ltd.**  \n   - 200 DMA: Rs 225.17  \n   - LTP: Rs 227.46  \n\n• **Lupin Ltd.**  \n   - 200 DMA: Rs 2087.01  \n   - LTP: Rs 2105.40  \n\n• **Pidilite Industries Ltd.**  \n   - 200 DMA: Rs 3021.60  \n   - LTP: Rs 3042.80  \n\n• **NHPC Ltd.**  \n   - 200 DMA: Rs 86.64  \n   - LTP: Rs 86.77  \n\nThese movements reflect broader market dynamics and investor sentiments, indicating potential upward trends in these stocks. Analysts generally regard stocks positioned above their 200 DMA as exhibiting stronger momentum, highlighting them as noteworthy investments for traders."
  },
  {
    "title": "Biggest call is to conserve money and stick to old warhorses like banks:  Dinshaw Irani",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/biggest-call-is-to-conserve-money-and-stick-to-old-warhorses-like-banks-dinshaw-irani/articleshow/120691978.cms",
    "summary": "Dinshaw Irani, CEO of Helios Mutual Fund, expresses a **cautiously optimistic** outlook for the market, emphasizing the need to **conserve capital** while focusing on established investments amidst ongoing market volatility. He anticipates that improvements may arise in the December quarter, contingent upon the U.S. easing its tariff tensions. \n\n**Key Insights:**\n• **Investment Strategy**: Irani advocates for maintaining positions in reliable sectors, particularly banking, which is currently experiencing a boost from Foreign Institutional Investor (FII) inflows, enhancing market liquidity. This sector is expected to sustain its propulsive effect on the market for the foreseeable future.\n• **Power Sector Outlook**: While he maintains a bullish stance on the power sector due to increased demand, Irani notes a scarcity of appealing investment opportunities in this area. Only select stocks within this sector present attractive valuations.\n• **Market Conditions**: He identifies the upcoming months as potentially challenging, advising against taking new investment risks and recommending a focus on established “warhorse” investments that have historically performed well.\n• **Tariff War Implications**: Irani points to the importance of resolutions in the U.S.-China trade tensions. A relaxing of tariffs could lead to renewed market confidence, with expectations for market recovery intensifying as we approach December.\n\nIrani also highlights that the recent influx of FII capital, approximately $3.5 billion over two weeks, suggests increased investor confidence in banks, which could indicate a positive market trajectory. However, he expresses caution, noting that current valuations should not be viewed as overly stretched, as the banking sector had previously adjusted post-market corrections.\n\nIn summary, while Irani expects some short-term turbulence, he sees a potential for upward movement in the market driven by strong banking performance and changes in tariff regulations on an international scale."
  },
  {
    "title": "KKR-backed InCred is said to be in talks with advisers on Rs 4,000 crore IPO",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/kkr-backed-incred-is-said-to-be-in-talks-with-advisers-on-rs-4000-crore-ipo/articleshow/120714358.cms",
    "summary": "InCred Financial Services, a lending firm based in India and backed by KKR & Co., is reportedly in discussions to launch an initial public offering (IPO) aimed at raising approximately **40 billion rupees** (around **$470 million**). The company is consulting with potential advisers, including IIFL Securities and Kotak Mahindra Bank, as it prepares to file the necessary documentation for this public offering in Mumbai, anticipated to occur by **October**. InCred is seeking a valuation of at least **150 billion rupees**.\n\nThe firm, founded in **2016** by Bhupinder Singh, specializes in retail lending, small business lending, and education finance. Discussions surrounding the IPO come at a time when global market volatility has affected various fundraising efforts, prompting firms, such as LG Electronics' India unit, to consider postponements. Nevertheless, the mood for Indian stocks appears to be improving, as UBS upgraded the Indian stock market outlook from underweight to neutral, which reflects a defensive investment appeal amidst global uncertainties.\n\nKey details about the IPO include:\n\n• **Target Amount**: 40 billion rupees ($470 million).\n• **Expected Timeline**: IPO may take place by October.\n• **Valuation Goal**: At least 150 billion rupees.\n• **Advisers Involved**: IIFL Securities, Kotak Mahindra Bank, and Nomura Holdings.\n• **Legal Advisory**: Khaitan & Co.\n• **Market Context**: Despite global market slumps, the NSE Nifty 50 Index rose approximately **3.4%** in April, although it remains down relative to a peak in September. \n\nInCred Financial's investment arm plans to raise an additional **15 billion rupees** through a new fund focused on private credit, indicating strategic growth plans despite the challenging investment climate."
  },
  {
    "title": "Tata Technologies shares in focus as TPG plans to sell 3.89% stake via bulk deal",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/tata-technologies-shares-in-focus-as-tpg-plans-to-sell-3-89-stake-via-bulk-deal/articleshow/120714304.cms",
    "summary": "Tata Technologies shares experienced a significant decline of **6%**, dropping to an intraday low of **Rs 663.45** on the Bombay Stock Exchange (BSE). This decrease follows reports that **TPG Rise Climate SF Pte. Ltd.** sold a **3.95% stake** in a bulk transaction. The sale included approximately **1.6 crore shares** priced at **Rs 683 each**, which reflects a discount compared to the market price at the time of the deal. Despite a **20% year-on-year increase** in consolidated profit after tax (PAT) for the fourth quarter of FY25 (Q4FY25), analysts are recommending a 'Sell' for the stock, with an average target price of **Rs 677**, suggesting a potential further downside of about **4%** from current levels.\n\nKey Highlights:\n• **Transaction Details**: The bulk deal is valued at around **Rs 1,094 crore**; TPG intends to offload around **15.86 million shares**, with shares priced between **Rs 670 to Rs 699**.\n• **Company’s Financial Performance**: Tata Technologies reported a **Q4FY25 PAT of Rs 189 crore**, rising from **Rs 157 crore** in the previous year, but a decrease in revenue to **Rs 1,286 crore**, down **1.2%** from **Rs 1,301 crore** year-on-year.\n• **Stock Performance**: Over the last year, Tata Technologies' stock has decreased by **34%**. Year-to-date, it's down by **21%**, and over the past six months, it has fallen by **30%**. Meanwhile, there was a **4% increase** in stock price over the last month.\n\nAs of March 2025, TPG Rise Climate holds **6.01%** of Tata Technologies, which will be subject to a **60-day lock-in period** post-sale. BofA Securities is reportedly managing the transaction."
  },
  {
    "title": "Rollover data highlights these 7 stocks to watch for May series. Check list",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/rollover-data-highlights-these-7-stocks-to-watch-for-may-series-check-list/slideshow/120714260.cms",
    "summary": "The May series of stock trading demonstrated significant activity, influenced by traders' anticipations regarding earnings and overall market trends. Some stocks exhibited considerable rollovers, suggesting active trader engagement in extending their positions. Conversely, other stocks experienced a reduction in positions or the creation of new ones.\n\n**Stocks to Watch Based on Rollover Data:**\n\n• **Ultratech Cement**: Open interest decreased by 1.08%, while the stock price rose by 0.25%; categorized as a bullish bet.  \n• **Mphasis**: Open interest dropped by 6.44%, with a 2.26% increase in stock price; designated bullish.  \n• **CDSL**: Open interest increased by 7.28%, heading into a price decline of 2.87%; regarded as bullish.  \n• **Tech Mahindra**: Experienced an 8.31% fall in open interest, with a stock price rise of 1.02%, classified as bullish.  \n• **SJVN**: Open interest grew by 7.92%, despite a 2.80% drop in stock price; seen as a bullish opportunity.  \n• **Tata Steel**: Showed a 1.46% rise in open interest, correlated with a 2.11% decrease in stock price; categorized as bearish.  \n• **Syngene International**: Recorded a 3.63% increase in open interest with a corresponding 3.66% price drop; labeled as bearish.\n\nThese insights, compiled by the Economic Times (ET), reflect the market's near-term outlook and trader sentiment regarding these stocks for upcoming positions."
  },
  {
    "title": "Power Finance Corp. Plans To Tap Debt Market With Zero Coupon Bond Issue",
    "url": "https://www.ndtvprofit.com/business/power-finance-corp-plans-to-tap-debt-market-with-zero-coupon-bond-issue",
    "summary": "• **Power Finance Corporation (PFC)** is planning to raise up to Rs 3,500 crore through a zero coupon bond issuance scheduled for June 2, 2035. \n• The bond issue consists of a base size of Rs 600 crore, with a greenshoe option of Rs 2,900 crore. \n• Additionally, PFC is seeking to raise another Rs 2,500 crore through plain vanilla bonds maturing in April 2040.\n• The issuance comes following the approval from the Central Board of Direct Taxes for a deep discount bond, which has witnessed interest from many state-owned entities.\n• Recently, several entities like the National Bank for Agriculture and Rural Development and the Small Industries Development Bank of India received similar approvals for zero coupon bonds.\n• These bonds are structured to be tax efficient, as all income received will be categorized under long-term capital gains tax rather than interest income.\n• Both bond issuances will occur on the National Stock Exchange's electronic bidding platform, with specific bidding times allocated for each bond type. \n• The bonds have received a AAA rating from CRISIL Ratings, ensuring a strong investment grade.\n• The expected allotment date for investors is May 2, 2025. \n\nThis move to tap into the debt market reflects a growing trend among government-linked companies seeking innovative financing solutions."
  },
  {
    "title": "IDFC First Bank’s MFI provision will go down every quarter from now; opex will fall further to 12-13%:  V Vaidyanathan",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/idfc-first-banks-mfi-provision-will-go-down-every-quarter-from-now-opex-will-fall-further-to-12-13-v-vaidyanathan/articleshow/120696703.cms",
    "summary": "V Vaidyanathan, the Managing Director and Chief Executive Officer of IDFC First Bank, has conveyed an optimistic outlook for the bank's financial performance in fiscal year 2026 (FY26). The anticipated improvements are attributed to decreasing microfinance institution (MFI) provisions and a reduction in operating expenses, projected to fall to 12-13%. \n\n• **Key Highlights:**\n  - Provisions for MFI are expected to gradually decrease each quarter, having peaked previously. \n  - A steady improvement in return on assets (ROA) is anticipated, especially during the third and fourth quarters.\n  - The bank's net profit after tax (PAT) is projected to rise as challenges surrounding microfinance subside.\n\n• **Financial Growth:**\n  - The bank's core financial ratios seem promising, with the loan book reportedly expanding by 20% and deposits by 25%. \n  - Despite the drop in the levels of PAT this fiscal year, the CEO reassured stakeholders about addressing this next year.\n  \n• **Operational Efficiency:**\n  - Vaidyanathan emphasized effective control on operational expenses, with a notable decline from 21% to 12% growth year-over-year over the past four quarters.\n  - The improvements in the current fiscal year are based on a low base effect from FY25, signaling potential for better performance ahead.\n\n• **Challenges and Cautions:**\n  - Despite positive growth indicators, the bank remains vigilant regarding elevated gross and net slippages from loans, particularly within the MFI segment.\n  - The CEO highlighted the importance of understanding the unique sensitivities within the microfinance sector and urged caution despite the optimism regarding a declining trend in provisions.\n\n• **CASA Growth:**\n  - The bank has significantly enhanced its Current Account Savings Account (CASA) ratio from 8.6% to 47% over the last five years, marking a pivotal improvement in deposit base quality.\n\nIn summary, IDFC First Bank's leadership displays confident projections for growth fueled by reduced operational costs and better management of microfinance exposure while acknowledging the need for careful monitoring of underlying risks. Subsequent quarters are expected to showcase ongoing enhancements in the bank's financial metrics."
  },
  {
    "title": "12 emotional habits that shaped Warren Buffett’s success",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/12-emotional-habits-that-shaped-warren-buffetts-success/slideshow/120714051.cms",
    "summary": "• The Nifty index is currently at **24,335.95**, reflecting a change of **7.46 points**. \n\n• **Featured Funds:**  \n  - **Canara Robeco ELSS Tax Saver Regular - Growth**: **5-Year Return: 22.72%**  \n  - **HSBC Large Cap Fund Direct-Growth**: **5-Year Return: 21.64%**  \n\n**Warren Buffett's Success Habits**  \nWarren Buffett's exceptional wealth, exceeding **$160 billion**, stems not only from financial acumen but also from his command over emotional intelligence. His strategies include:\n\n• **Stay Calm in Panic**: Buffett highlights the importance of keeping a rational mindset during market turmoil, allowing him to make sound investment decisions while others falter.\n\n• **Create Cooling-Off Periods**: He advocates for pausing before reacting to market shifts, enabling more logical rather than emotional choices.\n\n• **Prioritize Patience**: His investment philosophy emphasizes waiting for assets to mature and for compounding to take effect, contrasting short-term thinking.\n\n• **Know Your Limits**: Buffett focuses on industries he understands deeply, avoiding overextension into unfamiliar territory, effectively managing risks.\n\n• **Learn from Mistakes**: He openly discusses past investment failures, maintaining a learning attitude that fosters growth.\n\n• **Value Integrity**: Trust and ethical behavior in partnerships and business practices are non-negotiable for Buffett, reinforcing his investment choices.\n\n• **Independent Thinking**: Successful investments often result from his own analyses rather than market trends, reflecting the importance of contrarian thinking in non-conformist decision-making.\n\n• **Live Below Your Means**: Despite his wealth, Buffett remains frugal, illustrating that financial success does not depend on extravagant lifestyles.\n\n• **Read Market Sentiments**: Recognizing market moods enables him to strategically buy during fearful downturns and exercise caution during periods of greed.\n\n• **Capital Preservation**: His cardinal rule is to avoid losing money, providing a psychological buffer that enhances decision-making clarity amid volatility.\n\n• **Emotional Intelligence as an Edge**: Mastery of emotions is portrayed as critical for sustainable financial success, underscoring that both intelligence and emotional resilience are vital in investing."
  },
  {
    "title": "UltraTech Cem Share Price Live Updates: UltraTech Cement's impressive three-month returns",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-liveblog/ultratech-cem-share-price-today-live-29-apr-2025/liveblog/120713618.cms",
    "summary": "• The **Nifty Index** is quoted at **24,335.96**, reflecting a change of **7.46 points**.  \n• **Featured Mutual Funds** include:  \n  - **Canara Robeco ELSS Tax Saver Regular - Growth** with a **5-year return of 22.72%**.  \n  - **HSBC Large Cap Fund Direct-Growth** recording a **5-year return of 21.64%**.  \n\n**UltraTech Cement Stock Analysis**  \n• Current trading conditions for **UltraTech Cement** indicate:\n  - **Last traded price:** Rs 11,869.00\n  - **Market capitalization:** Rs 349,340.07 million\n  - **Volume traded:** 516,363 shares\n  - **Price-to-earnings ratio:** 54.15\n  - **Earnings per share:** Rs 219.39  \n• The stock reflects a **2.03% decline** for the day, with a **3-month return of 2.69%**.  \n\n**Market Recommendations & Insights**  \n• Recent recommendations from **HDFC Securities** suggest a growth potential of **5.43%**, with a target price set at **Rs 12,600.00**.  \n• Notably, **UltraTech Cement** has delivered substantial returns of **79.39% over the past three years** despite facing a **2.18% drop today**.  \n\n**Upcoming Events and Responses**  \n• There are **upcoming recommendations** expected from various market analysts, as they monitor **UltraTech’s performance**, particularly amidst notable **market volatility**.  \n• Any market movements may impact investor confidence, further shaping recommendations and insights into future trading behavior.  \n\nThis analysis provides a comprehensive overview of current market performance and potential investment opportunities, aiding both seasoned investors and market enthusiasts in their decision-making processes."
  },
  {
    "title": "Kenrik Industries IPO: Check issue size, price band, GMP and other details",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/kenrik-industries-ipo-check-issue-size-price-band-gmp-and-other-details/articleshow/120713413.cms",
    "summary": "Kenrik Industries is preparing to initiate its initial public offering (IPO) on April 29, aiming to raise a total of **Rs 8.75 crore** through the issuance of new equity. The IPO price has been set at **Rs 25 per share**, and it will issue approximately **34.98 lakh shares**. The offering is designed to cater to both retail and institutional investors, with **50% of the shares reserved** for each category. \n\n### Purpose of the IPO\n• The funds raised will primarily be allocated towards enhancing working capital requirements (amounting to **Rs 6.5 crore**) and covering general corporate expenses (estimated at **Rs 1.8 crore**).  \n• These financial resources are intended to support Kenrik's growth strategies and enhance operational capacities.\n\n### Company Overview\n• **Kenrik Industries** specializes in traditional Indian jewellery, particularly handmade gold pieces adorned with diamonds, rubies, and cubic zirconia.  \n• The company operates under a business-to-business (B2B) model, serving a diverse customer base across high-end, mid-market, and value segments.\n\n### Financial Highlights\n• For the fiscal year 2024, Kenrik Industries reported a revenue of **Rs 70.97 crore**, a significant increase from **Rs 52 crore** in FY23. \n• The company achieved a profit of **Rs 1.08 crore** in FY24.\n\n### IPO Management\n• The **Turnaround Corporate Advisors** will serve as the lead manager for the IPO, while **Skyline Financial Services** will act as the registrar.\n\n### Next Steps\n• The IPO will close for subscriptions on **May 6, 2025**. \n• Interested investors should take note of the fixed price and minimum lot size of **6,000 shares** to engage in the offer.\n\nThis IPO marks a crucial step for Kenrik Industries as it seeks to strengthen its market position and expand its reach within the jewellery segment."
  },
  {
    "title": "Q4 results today: Bajaj Finance, Ambuja among 41 companies to announce earnings on Tuesday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/q4-results-today-bajaj-finance-ambuja-among-41-companies-to-announce-earnings-on-tuesday/articleshow/120713300.cms",
    "summary": "The fourth quarter earnings season is attracting attention as 41 companies, notably Bajaj Finance and Bajaj Finserv, prepare to announce their results on Tuesday. **Key Highlights:**\n\n• **Bajaj Finance’s Performance**: Expected to report strong results, fueled by substantial loan growth across consumer, SME, and rural segments. Analysts predict a **net interest income (NII)** growth of approximately **23-24% year-on-year** and a **profit after tax (PAT)** increase of around **18% YoY**.\n\n• **Asset Under Management (AUM)**: AUM is projected to rise by **31-32%** YoY, primarily driven by high demand in unsecured loans, two-wheeler financing, and personal loans.\n\n• **Market Expectations**: Despite anticipated margin compression due to increased borrowing costs and product mix changes, the company is expected to maintain strong margins owing to its pricing power in consumer finance and commercial lending.\n\n• **Customer Acquisition and Digital Growth**: Bajaj Finance's robust customer acquisition is likely to enhance new loan bookings and fee income growth, supported by digital initiatives and payment ecosystem improvements.\n\n• **Asset Quality**: The company’s asset quality is expected to be stable, with analysts estimating a flat or slightly improved gross non-performing asset (GNPA) ratio.\n\nInvestor interest will focus on management's insights regarding the cost of funds, deposit trends, and any issues related to unsecured loan stress. Alongside Bajaj Finance, results from other companies such as Ambuja and NTPC Green are also crucial to watch.\n\nIn summary, the quarter's outcomes could significantly influence investor sentiment and market trends, especially concerning the lending sector's performance amidst challenging economic conditions."
  },
  {
    "title": "Trump to tout US investments from Nvidia, J&J, Hyundai, Toyota",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/trump-to-tout-us-investments-from-nvidia-jj-hyundai-toyota/articleshow/120713239.cms",
    "summary": "President Donald Trump is set to host an \"Investing in America\" event at the White House, focusing on promoting significant U.S. investments in various sectors, including defense, technology, healthcare, and consumer products. This event aims to highlight contributions from notable companies, featuring CEOs from major corporations such as Nvidia, Johnson & Johnson, Hyundai, Toyota, and SoftBank. The initiative represents a key aspect of Trump’s administration, aiming to bolster manufacturing and investment in the United States amid concerns regarding the impact of imposed tariffs and a broader global trade war.\n\n• **Event Objectives**: \n  - Showcase U.S. investments across various industries.  \n  - Encourage foreign companies to expand manufacturing in the U.S.\n\n• **Challenges Noted**:\n  - The global trade environment remains tense, with tariffs affecting perceptions of U.S. manufacturing.\n  - Companies have expressed the need for clarity on trade policies before making substantial commitments.\n\n• **Current Developments**:\n  - Significant commitments from companies like TSMC, Apple, and Roche indicate confidence in the U.S. economy.\n  - General Motors is reportedly considering a new $60 billion investment in U.S. operations.\n  - Last month, Hyundai announced a $21 billion investment, including establishing a steel plant in Louisiana expected to create over 1,400 jobs.\n\n• **Future Initiatives**:\n  - Trump plans to offer incentives to automakers concerning new auto tariffs.\n  - A proposed $500 billion investment in AI infrastructure aims to position the U.S. as a leader in emerging technologies.\n\nThe White House is optimistic that these corporate commitments will foster greater confidence in the U.S. economy and bolster its dollar strength."
  },
  {
    "title": "After yield surge, US Treasury expected to keep auction sizes steady",
    "url": "https://economictimes.indiatimes.com/markets/bonds/after-yield-surge-us-treasury-expected-to-keep-auction-sizes-steady/articleshow/120713195.cms",
    "summary": "The U.S. Treasury Department is poised to maintain its current auction sizes for the fifth quarter in a row, a decision driven by significant borrowing needs estimated at $514 billion for the upcoming quarter, a stark increase of $391 billion from prior forecasts. The ongoing fiscal uncertainty, particularly surrounding the debt ceiling, has impacted this decision, leading Treasury Secretary Scott Bessent to prioritize stability in debt issuance.\n\nKey highlights from the forthcoming plans include:\n\n• **Stability in Auction Sizes**: The Treasury is likely to keep auction sizes unchanged, providing reassurance to markets amid economic unpredictability.\n\n• **Increased Borrowing**: The updated borrowing estimate reflects a heightened need for short-term financing, attributed to lower cash reserves due to earlier debt ceiling constraints.\n\n• **Market Focus**: Investors are closely monitoring the Treasury's forward guidance for potential signals regarding future changes in auction sizes, particularly the possibility of increasing the scale of shorter-term note auctions, which could enhance market stability.\n\n• **Economic Context**: Current market volatility, sparked by geopolitical events and fiscal policy negotiations, remains a concern. Historical fluctuations in yields following tariff announcements have heightened sensitivity to Treasury actions.\n\n• **Potential Adjustments**: Analysts suggest the opportunity for minor cuts in longer-dated debt auctions as a strategic move to manage yield pressures effectively.\n\nOverall, the Treasury's forthcoming announcements are pivotal for investor confidence and market dynamics, given the intersecting factors of economic policy, borrowing needs, and legislative developments."
  },
  {
    "title": "Oil falls as economic jitters dampen demand outlook",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-as-economic-jitters-dampen-demand-outlook/articleshow/120713151.cms",
    "summary": "Crude oil prices have fallen significantly during early Asian trading sessions due to increasing investor concerns over demand growth, primarily attributed to the ongoing trade tensions between the United States and China, the two largest global economies. This decline is exacerbated by economic forecasts projecting a potential global recession driven by the tariff disputes. As tariffs escalate, economists anticipate a substantial reduction in demand for oil, leading to downward adjustments in both demand and price forecasts.\n\nKey points include:\n\n• **Current Price Movement**: Brent crude futures fell by **$0.25 (0.4%)** to **$65.61 per barrel**, while U.S. West Texas Intermediate crude futures decreased by **$0.18 (0.3%)** to **$61.87 per barrel**. Both benchmarks had already seen decreases of over $1 the previous day.\n\n• **Economic Concerns**: The push from U.S. President Donald Trump to modify global trade through widespread tariffs has heightened fears among economists, who believe these moves could not only impact trade but might also lead to a recession, as reflected in a Reuters poll.\n\n• **OPEC+ Production Strategy**: An increase in output from OPEC+ member countries further pressures oil prices downward. Analysts believe that a substantial price decrease is likely if these countries continue to boost production rates. Specifically, OPEC+ is considering accelerating output increases for the second successive month.\n\n• **U.S. Stockpiles**: An expected rise in U.S. crude oil stockpiles, estimated at about **500,000 barrels** for the week ending April 15, adds to the bearish sentiment in the market.\n\n• **Forecast Adjustments**: Markets have reacted to this situation with significant revisions: Barclays has decreased its 2025 forecast for Brent crude prices by **$4**, now predicting a price of **$70 per barrel**, due to increased supply and ongoing trade tensions.\n\nIn summary, the combination of economic uncertainty from the U.S.-China trade conflict, an increase in oil supply from producing nations, and rising stockpiles are all contributing to declining oil prices, with projections indicating further decreases possible if production continues to rise."
  },
  {
    "title": "Gold And Silver Price Today — Check Prices In Mumbai, Bengaluru, Delhi, Chennai And More",
    "url": "https://www.ndtvprofit.com/markets/gold-and-silver-price-today-check-prices-in-mumbai-bengaluru-delhi-chennai-and-more-9",
    "summary": "• **Gold and Silver Prices**: As of April 29, 2025, the price of gold in New Delhi was approximately **Rs 95,980 per 10 grams**. Rates have seen slight increases in various major cities:\n   - Mumbai: **Rs 96,150**\n   - Kolkata: **Rs 96,020**\n   - Bengaluru: **Rs 96,220**\n   - Chennai: **Rs 96,430** (the highest in the country)\n\n• **Market Trends**: Gold prices surged past the **$3,000-an-ounce mark** in March for the first time, followed by a pullback. This year, gold has seen a **25% increase**, largely driven by the demand for safe-haven assets amid global economic uncertainties.\n\n• **Futures Market**: On the Multi Commodity Exchange, gold futures for June 5 are trading **1.12% higher** at **Rs 96,060**.\n\n• **Global Spot Prices**: Global spot gold prices fell **0.32%**, now trading at approximately **$3,333.39**. This decline occurs in anticipation of upcoming significant economic data from the US.\n\n• **Silver Prices**: Silver prices on this date were recorded at **Rs 97,090**, reflecting a steady demand in light of its role in industrial applications, particularly renewable energy technologies.\n\n• **Market Volatility**: Fluctuations in gold and silver prices are closely linked to ongoing trade tensions initiated by US policies and shifts in investor sentiment towards safer assets.\n\nThis data provides insight into current market conditions for precious metals, encompassing domestic pricing variations as well as global trends affecting investor decisions."
  },
  {
    "title": "Why everyone wants Google Chrome and who might get it",
    "url": "https://finshots.in/archive/why-openai-perplexity-yahoo-want-to-buy-google-chrome-and-who-might-get-it/",
    "summary": "The ongoing discussion surrounding Google Chrome highlights a significant shift in the tech landscape, particularly in light of Google's recent legal challenges and the interest shown by AI companies and legacy players. \n\n**Background Context**  \n• **Legal Scrutiny:** Google is currently entangled in antitrust allegations, with accusations of monopolistic behavior in both search and digital advertising sectors. Notably, a federal court ruled that Google abused its dominant position, leading to ongoing regulatory scrutiny.\n\n• **Potential Breakup:** Prediction markets suggest a 47% likelihood that Google could face a structural breakup by this year, particularly concerning its advertising segments.\n\n**Market Dynamics**  \n• **Interest in Chrome:** Despite Google not officially being for sale, companies like OpenAI, PerplexityAI, and Yahoo are eyeing Google Chrome, which commands a 65% share of the browser market and boasts around 3.3 billion users. This positions Chrome as a highly valuable asset.\n\n• **Strategic Advantages:** \n   - **OpenAI:** Acquiring Chrome would provide OpenAI access to live search data, essential for enhancing its ChatGPT product, allowing integration as a built-in assistant directly in the browser.\n   - **PerplexityAI:** Interest in Chrome stems from their ambition to enhance user tracking for targeted advertising. By owning Chrome, they could gather extensive data beyond their app usage.\n   - **Yahoo:** Historically, Yahoo missed opportunities to acquire Google. They perceive Chrome as a chance to revive their market presence, but face challenges in technological innovation and strategy.\n\n**Implications of Data Ownership**  \n• **Privacy Concerns:** The potential transition of data management from Google to AI firms raises significant privacy risks. The ownership shift from a traditional advertising model to AI training could result in more extensive data collection practices.\n\n• **Market Evolution:** The race for Chrome ownership underscores the competition between traditional tech companies and emergent AI institutions. While Yahoo may struggle to adapt to the fast-paced development of AI, firms like OpenAI and Perplexity are pivoting towards rapid growth and innovation in digital advertising.\n\nAs legal resolutions regarding Google's structure unfold, the future of Chrome remains uncertain, with profound implications for the broader tech industry and user privacy. The developments warrant close observation as stakeholders navigate the intertwining landscape of technology, law, and consumer rights."
  },
  {
    "title": "Dollar limps along on U.S.-China trade standoff",
    "url": "https://economictimes.indiatimes.com/markets/forex/dollar-limps-along-on-u-s-china-trade-standoff/articleshow/120713110.cms",
    "summary": "The U.S. dollar faced significant challenges as it continued to struggle recovering losses against major currencies, particularly amid ongoing uncertainties regarding Sino-U.S. trade relations. The recent discussions and mixed signals have left investors wary, prompting them to seek refuge in traditionally safer currencies such as the yen and Swiss franc. \n\nKey highlights include: \n\n• **Trade Negotiations:** U.S. Treasury Secretary Scott Bessent indicated that the responsibility for de-escalating tariff tensions lies with China, amid conflicting claims from both nations regarding progress in talks.\n\n• **Market Response:** Following investor concerns, the dollar fell sharply, even as it made a slight recovery, recently noted at approximately 142.19 yen and 0.8217 Swiss franc, after a series of losses.\n\n• **Investor Sentiment:** The confusing direction of U.S. trade policy has raised alarms, with analysts expressing skepticism about achieving a near-term agreement. There is concern about a prolonged trade standoff, particularly as the Trump administration exhibits signs of potential tariff reductions and China has begun to exempt some U.S. goods from heavy tariffs.\n\n• **European Currencies:** The euro remains on a strong upward trajectory, performing its best against the dollar in almost 15 years at a rate of $1.1404, as investors pivot towards European assets in light of uncertainty surrounding U.S. stability.\n\n• **Economic Data Monitoring:** Investors are preparing for a week of crucial U.S. economic evaluations, including job reports and inflation data, which might further affect the dollar's status as a secure choice for investment.\n\n• **Canadian and Australian Markets:** The Canadian dollar traded stable at C$1.3837, while the Australian dollar experienced a minor decline against the U.S. dollar.\n\nIn summary, the U.S. dollar's ongoing struggles reflect broader uncertainties tied to trade tensions and the evolving landscape of international economic policies, compelling investors to adopt a more cautious approach while exploring alternative currencies."
  },
  {
    "title": "Gold falls on easing trade war concerns; US data awaited",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-falls-on-easing-trade-war-concerns-us-data-awaited/articleshow/120713079.cms",
    "summary": "Gold prices declined amid easing trade tensions between the United States and its trading partners, which diminished the metal's appeal as a safe-haven asset. Investors are particularly focused on upcoming U.S. economic data, including job openings, personal consumption expenditures, and non-farm payrolls. These figures are crucial for evaluating the Federal Reserve's monetary policy amidst growing concerns of a potential global recession.\n\nKey details include:\n\n• **Price Movement**: Spot gold fell by 0.3% to $3,332.99 an ounce while U.S. gold futures decreased by 0.1% to $3,343.20.\n\n• **Trade Relations**: U.S. Treasury Secretary Scott Bessent highlighted that several major trading partners, including India, have proposed effective strategies to avoid tariffs.\n\n• **China's Stance**: China's recent exemptions on specific U.S. goods from retaliatory tariffs signify a potential de-escalation in tensions between the world's two largest economies.\n\n• **Economic Outlook**: Many economists indicate a high risk of the global economy slipping into recession this year, largely due to damaging effects of tariffs on business sentiment. Last week, bullion reached a record high of $3,500.05/oz, reflecting heightened uncertainties.\n\n• **Upcoming Data**: This week’s economic data will play a vital role in informing market expectations regarding the Federal Reserve's policy direction.\n\n• **Other Metals**: In addition to gold, spot silver decreased by 0.2% to $33.10, while platinum remained stable at $986.13, and palladium dropped by 0.3% to $946.51.\n\nAnalysts assert that the release of pivotal economic reports will be instrumental in shaping the overall market sentiment and guiding future investment strategies amidst the unfolding economic landscape."
  },
  {
    "title": "S&P 500 ekes out slight gain with data, megacap earnings eyed",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ekes-out-slight-gain-with-data-megacap-earnings-eyed/articleshow/120713065.cms",
    "summary": "The S&P 500 experienced a slight gain amidst a volatile trading session, closing nearly unchanged due to pressure from major companies such as Nvidia and Amazon. These megacap stocks contributed to the downturn, particularly as investors awaited significant economic data and earnings reports from leading U.S. companies. Key points from the market analysis include:\n\n• **Market Performance:**  \n  - S&P 500 rose by 3.54 points (0.06%) to finish at 5,528.75.\n  - Dow Jones gained 114.09 points (0.28%) to close at 40,227.59.\n  - Nasdaq Composite declined by 16.81 points (0.10%) to 17,366.13.\n\n• **Sector Influences:**  \n  - Nvidia's shares dipped 2.1%, while Amazon's fell 0.7%, impacting the overall performance.\n  - In contrast, Apple and Meta showed positive movement, rising by 0.4% and 0.5%, respectively.\n\n• **Earnings Reports:**  \n  - The coming week is crucial as 180 components of the S&P 500 are set to disclose their quarterly earnings, including key players from the \"Magnificent Seven,\" such as Apple, Amazon, and Microsoft.\n  - Early indicators suggest a 10.9% estimated rise in profits for the first quarter compared to the previous year, but many firms have expressed caution regarding future projections due to uncertainties stemming from U.S. trade policies.\n\n• **Economic Indicators:**  \n  - Investors are anticipating important economic data including personal consumption expenditure metrics and labor market statistics, culminating in the U.S. payrolls report on Friday.\n  - Concerns remain over potential tariff impacts due to ongoing trade tensions, particularly with China, influencing market sentiment.\n\n• **Stock Specific Developments:**  \n  - Boeing shares increased by 2.4% after a rating upgrade by Bernstein, contributing positively to the Dow.\n  - Overall, advancing stocks outnumbered decliners on major exchanges, with the S&P 500 achieving new highs despite remaining approximately 10% below its record peak from February.\n\nIn summary, while the S&P 500 showed slight gains, the influence of major tech stocks and looming trade-related uncertainties kept the market cautious leading up to critical earnings announcements and economic data releases in the coming days."
  },
  {
    "title": "The Revised LCR Framework Aftermath",
    "url": "https://www.ndtvprofit.com/opinion/the-revised-lcr-framework-aftermath",
    "summary": "The recent revisions to the Liquidity Coverage Ratio (LCR) framework implemented by the Reserve Bank of India (RBI) aim to enhance the liquidity security of banks amidst a rapidly evolving financial landscape. This framework is crucial as it dictates that banks maintain a certain ratio of liquid assets to their total net cash outflows over a 30-day period, thereby ensuring they have adequate liquidity to withstand financial stress.\n\nKey highlights:\n\n• **Impact on Public Sector Banks**: The changes are particularly aimed at public sector banks, which may be disproportionately affected due to their deposit composition. These banks often have a higher proportion of retail deposits, which can be more volatile compared to wholesale funding sources. \n\n• **Adoption of Technology**: The swift technological advancement in banking is making deposits less stable. The increased convenience and speed of online transactions can lead to quicker withdrawals, raising the necessity for banks to adhere more strictly to liquidity requirements.\n\n• **Strengthening Financial Resilience**: The revised LCR framework seeks to bolster banks' capacity to manage liquidity crises by compelling them to hold a more substantial buffer of liquid assets. This is a preemptive measure designed to mitigate risks and improve overall stability in the banking system, especially during periods of financial distress.\n\n• **Regulatory Expectations**: The RBI expects compliance with these new regulations to prevent any potential liquidity shortages, promoting confidence in the banking sector during uncertain economic times.\n\nIn conclusion, these regulatory adjustments aim to ensure that banks are better prepared to manage cash flows and meet obligations, safeguarding the interests of depositors and contributing to the broader stability of the financial system in India."
  },
  {
    "title": "Multi-fuels, exports can make Maruti a good ride",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/multi-fuels-exports-can-make-maruti-a-good-ride/articleshow/120712710.cms",
    "summary": "Maruti Suzuki India has demonstrated solid performance in its financials for the March 2025 quarter, with a **6% year-on-year increase** in standalone net sales, amounting to **₹38,848.8 crore**. Despite a **4% year-on-year decline** in net profit to **₹3,711.1 crore**, there was a **5% sequential increase**. The **EBIT margin** has experienced a gradual decline from **11.1% in June 2024** to **8.7% in March 2025**, attributed to escalating manufacturing overheads, administrative costs, new plant expenses, increased advertising, and adverse commodity pricing.\n\n**Key Performance Indicators:**\n• **Sales Volume:** Highest-ever quarterly sales volume at **604,635 units**, a **3.5% rise** year-on-year.\n• **Rural Market Performance:** Continued strong performance contributing to overall sales growth.\n\nDespite some margin pressures, Maruti's strategic focus on multiple fuel options, a strong export strategy, and a robust upcoming vehicle launch pipeline, including plans for the **e-Vitara and a new SUV**, position the company well for sustained growth. Analysts project a **20% upside** for the stock, with target prices set by brokers Emkay and Motilal Oswal at **₹13,500 and ₹13,985** respectively.\n\n**Growth Expectations:**\n• Anticipated **20% year-on-year growth** in exports primarily from new model launches.\n• Emphasis on expanding **CNG penetration** and enhancing the electric and hybrid vehicle portfolios. \n\nIn alignment, Maruti is planning a capital expenditure of approximately **₹8,000-₹9,000 crore** for FY26, in response to upcoming **Corporate Average Fuel Efficiency (CAFE)** standards as mandated by the government.\n\nOverall, while Maruti faces challenges related to input costs and market conditions, its strategic initiatives and product launches are designed to capitalize on growth opportunities in both domestic and international markets."
  },
  {
    "title": "Reliance fires up Dalal Street to over 1% rise",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-fires-up-dalal-street-to-over-1-rise/articleshow/120712609.cms",
    "summary": "India's equity markets experienced notable gains on April 29, 2025, led by a significant surge in Reliance Industries' stock. Reliance shares increased by over 5%, marking the highest single-day gain since June 2024, and resulting in the company's market capitalization rising from ₹17.6 lakh crore to ₹18.5 lakh crore. This increase was a major contributor to the overall market rally, helping both the Nifty and Sensex indices to recover losses from the previous week, attributed to rising tensions between India and Pakistan.\n\nKey highlights from the trading session include:\n\n• **Market Performance**:\n  - NSE Nifty rose by 1.2%, equating to 289.2 points, closing at 24,328.5.\n  - BSE Sensex saw an increase of 1.3%, or 1,005.8 points, finishing at 80,218.4.\n  \n• **Reliance Industries Impact**:\n  - Reliance, accounting for approximately 8.12% of the Nifty 50, drove market momentum following the release of strong financial results for the March quarter.\n  - Analysts indicated that while results contributed to the rise, the market's underlying readiness for an upswing also played a significant role.\n\n• **Market Outlook**:\n  - Technical analysis suggests potential for further growth, with estimates projecting the Nifty could reach up to 25,000 in the near term.\n  - Recent investor behavior indicates sustained foreign portfolio investment, with net buys of ₹2,474 crore on the reported day, maintaining a strong buying trend over the past weeks.\n\n• **Broader Market Indicators**:\n  - While broader indices followed suit, the market breadth was mixed with 1,914 stocks advancing against 2,091 declining.\n  - The Nifty Mid-cap and Small-cap indices rose 1.4% and 0.5%, respectively, reflecting continued investor interest despite mixed sentiment across the broader market.\n\n• **Sectoral Performance**:\n  - All sectoral indices closed positively except for the IT index, with the Bank Nifty up by 1.4%, and the PSU Bank and Private Bank sectors rallying by 2.4% and 1.4%, respectively.\n\n• **Global Context**:\n  - Internationally, markets showed mixed results with Asian indices like Taiwan and Indonesia gaining modestly, while China and Hong Kong faced slight declines.\n\nExperts maintain a cautious but optimistic view, as they anticipate further fluctuations in market dynamics amid ongoing geopolitical concerns and changes in foreign investment patterns."
  },
  {
    "title": "Ramkrishna Forgings shares fall on disclosure of inventory discrepancies",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ramkrishna-forgings-shares-fall-on-disclosure-of-inventory-discrepancies/articleshow/120712577.cms",
    "summary": "Ramkrishna Forgings Ltd. recently announced a significant decline in its share price, which fell nearly **4.8%** following the revelation of inventory discrepancies during its annual stock assessment. The company disclosed that these discrepancies could diminish its net worth by approximately **4-5%**. In response, the promoters of Ramkrishna Forgings pledged to intervene financially to mitigate any potential shortfalls, with managing director **Naresh Jalan** emphasizing the company's commitment to accurately assess the discrepancies and undertake necessary remedial actions.\n\nKey highlights from the situation include:\n\n• **Impact on Financials:** Analysts estimate Ramkrishna Forgings' net worth at around **Rs 3,000 crore**, suggesting a potential impact of about **Rs 150 crore** due to the discrepancies, with speculation that this figure could increase.\n\n• **Audit Measures:** The company has engaged independent external agencies for a forensic audit, as sanctioned by its audit committee, which is currently investigating the nature and extent of the discrepancies.\n\n• **Historical Context:** This incident is noted as the first of its kind in the company's history. The firm has assured stakeholders that any financial impact will be accounted for as a one-time charge once the external audit concludes.\n\n• **Assurance to Investors:** Jalan publicly accepted moral responsibility and reiterated that the promoters are dedicated to uphold the highest corporate governance standards. \n\n• **Operational Scale:** Ramkrishna Forgings operates **18 manufacturing plants** across India, with Tata Motors being its largest customer. The firm is diversifying its manufacturing capabilities into passenger vehicles, tractors, and light commercial vehicles after making several acquisitions in FY2024.\n\n• **Market Reaction:** Following the announcement, the company's shares declined to **Rs 625.05** on the BSE, while the benchmark Sensex rose by **1.3%** on the same day.\n\nAnalysts remain cautious about the overall financial implications until the independent auditor reports are forthcoming, which will provide clarity on the magnitude and effects of the discrepancies."
  },
  {
    "title": "GIFT Nifty up 10 points; here's the trading setup for today's session",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/120703576.cms",
    "summary": "Indian equities experienced a robust rally on April 29, 2025, primarily driven by favorable earnings reports from major corporations, notably Reliance Industries. The absence of heightened tensions between India and Pakistan over the weekend further supported market stability. Key highlights include:\n\n• **Market Indicators:**\n  • GIFT Nifty increased by 10 points, concluding at 24,476.50.\n  • Analysts propose a 'buy-on-dips' strategy, with the next resistance level anticipated around 24,550, indicating a critical technical threshold.\n\n• **Foreign Investment Trends:**\n  • Foreign Institutional Investors (FIIs) emerged as net buyers, injecting ₹2,474 crore into the market, contrasting with Domestic Institutional Investors (DIIs), who sold shares worth ₹2,818 crore.\n\n• **Currency Movements:**\n  • The Indian rupee appreciated by 18 paise, closing at 85.23 against the US dollar, bolstered by sustained foreign inflows and a bullish domestic equity landscape.\n\n• **Associated Market Developments:**\n  • The volatility index (India VIX), reflecting market fear levels, decreased by 1.3%, settling at 16.94.\n  • Global equities showed a mixed performance, with the S&P 500 remaining largely unchanged amid anticipation of crucial economic data releases.\n\nThe overall sentiment indicates positive momentum in the Indian stock markets, which reflects strong corporate earnings along with stabilizing geopolitical conditions. This outlook fosters an environment conducive to further investment activities as various companies disclose their quarterly earnings."
  },
  {
    "title": "For some public floats, expenses can be up to 17% of funds raised",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/for-some-public-floats-expenses-can-be-up-to-17-of-funds-raised/articleshow/120712333.cms",
    "summary": "Recent data from Uniqus Consulting highlights significant expenses incurred by Indian companies for Initial Public Offerings (IPOs), with costs ranging from 1.5% to 17% of the funds raised over the past three years. \n\n**Key Findings:**\n\n• **Expense Ratios:** The costs associated with IPOs are inversely related to the offering size:\n   - For offerings under ₹500 crore, average expenses were **9.3%**.\n   - Mega IPOs exceeding ₹5,000 crore maintained an average expense ratio of only **2.6%**.\n\n• **Cost Breakdown:** Approximately **49%** of IPO expenses are attributed to fees paid to book running lead managers (BRLMs), which are variable and increase with the size of the issuance. Conversely, other costs like legal fees and regulatory payments represent fixed expenses.\n\n• **Examples:** \n   - Small issuers, such as Mukka Proteins and Shah Polymers, faced expenses of **17.1%** and **16.6%** of their respective offerings.\n   - Larger companies experienced notably lower ratios, e.g., Bharti Hexaware’s IPO had costs amounting to **1.51%** for a ₹4,275 crore offering.\n\n• **Global Comparison:** Compared to international IPO markets, Indian expenses are competitive, attributed to thorough due diligence and compliance requirements. Government-backed companies like NTPC Green Energy and LIC reported exceptionally low expense ratios, around **0.54%** and **0.58%**.\n\n• **Market Trends:** The trend indicates a growing preference for larger fundraising efforts, with the average IPO size rising from **₹814 crore** to **₹2,057 crore** between fiscal years.\n\n• **Future Outlook:** The increase in average listing expenses, which grew from **₹47 crore** in 2023-24 to **₹80 crore** in 2024-25, reflects heightened activity and confidence in the Indian capital markets.\n\nThis analysis provides insight into the financial landscape surrounding IPOs in India, illuminating the cost dynamics associated with varying issuance sizes."
  },
  {
    "title": "IndusInd may slip into red in Q4 on derivative losses",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-may-slip-into-red-in-q4-on-derivative-losses/articleshow/120712201.cms",
    "summary": "IndusInd Bank is facing significant financial challenges as it anticipates a potential net loss for the March quarter of 2025 due to substantial losses in its derivatives portfolio. The bank confirmed that it will absorb these derivatives-related losses, amounting to approximately ₹1,959 crore, following a board-mandated investigation that revealed accounting irregularities involving the premature termination of derivative contracts. This misbooking had inflated previous profit figures, artificially distorting financial results.\n\n• **Projected Losses:** Analysts estimate the bank could report a net loss ranging between ₹300 crore and ₹600 crore, a stark contrast to the net profit of ₹2,347 crore reported in the same quarter of the previous year.\n\n• **Accounting Issues:** The recognition of this accounting discrepancy has raised concerns over the bank's profitability, with credit analysts projecting continued asset quality pressure and elevated credit costs. Nitin Aggarwal, head of BFSI at Motilal Oswal Securities, emphasized that this situation might result in declining business growth.\n\n• **Market Reaction:** Since the announcement of the potential losses, IndusInd's stock price exhibited volatility, plummeting nearly 25% from ₹900 to ₹686. As of the latest close, the stock had somewhat recovered to ₹830.45.\n\n• **Future Expectations:** Financial forecasts for Q4 suggest subdued operational performance, with weak growth in net interest income expected as declining loan yields outpace rising funding costs. Furthermore, the microfinance and vehicle finance sectors are projected to face ongoing challenges, compounding the bank's difficulties in achieving loan growth.\n\nIndusInd Bank's predicament highlights the severe impact of accounting irregularities on financial health and market perceptions, alongside potential implications for its overall operational strategies as it navigates this challenging landscape."
  },
  {
    "title": "Sebi bans broker Patel Wealth, 4 of its directors for 'spoofing'",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-broker-patel-wealth-4-of-its-directors-for-spoofing/articleshow/120711907.cms",
    "summary": "The Securities and Exchange Board of India (Sebi) has notified the ban of Patel Wealth Advisors (PWA), along with its four directors, for alleged manipulation in the securities market through \"spoofing.\" This term refers to a deceptive trading strategy that involves submitting large, fictitious orders to mislead market participants, effectively distorting price discovery.\n\n**Key Details:**\n\n• **Allegations and Practices:**\n  - PWA and its directors engaged in spoofing by placing large buy orders significantly below market prices without the intention to fulfill them.\n  - This tactic created an artificial perception of demand, influencing other traders to react by driving prices up.\n  - Once favorable prices were reached, PWA offloaded its holdings and subsequently canceled these phantom orders.\n\n• **Regulatory Actions:**\n  - Sebi's interim order prohibits PWA and its directors from engaging in trading activities.\n  - The regulator has ordered the impoundment of ₹3.2 crore, reflecting the illegal profits generated from these activities.\n  - An investigation spanning three years uncovered 292 cases of spoofing involving 173 different securities, with PWA's misleading orders comprising nearly 90% of the order books for some stocks.\n\n• **Continued Violations:**\n  - Despite previous warnings and actions from the National Stock Exchange (NSE), PWA persisted in these manipulative practices. \n\nThis action by Sebi underscores the regulatory body's commitment to maintaining market integrity and safeguarding the interests of investors through stringent oversight and enforcement against manipulative trading activities."
  },
  {
    "title": "Sebi sets timeline for brokers to collect margins",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-sets-timeline-for-brokers-to-collect-margins/articleshow/120711585.cms",
    "summary": "The Securities and Exchange Board of India (Sebi) has established new guidelines for brokers regarding the collection of margins from clients, mandating this to occur under a T+1 settlement cycle. This means brokers must now collect margins within one day after the transaction date, as opposed to the previous T+2 cycle. \n\nKey Points:\n• **Mandatory Upfront Collections**: Brokers are required to collect immediate Value at Risk (VaR) margins and Extreme Loss Margins (ELM) from clients before trading.\n• **Timeline Compliance**: For all other margins, brokers have a window of T+2 working days to gather them from clients. If clients fail to make the necessary payments by settlement day, and brokers do not collect the required margins resulting in penalties.\n• **Transition to T+1 Cycle**: This initiative reflects the reduced settlement cycle in the cash market, which transitioned from T+2 to T+1 on January 27, 2023. The objective is to foster a more robust risk management framework among trading and clearing members, enhancing the overall financial stability of the marketplace.\n\nSebi's directive will help ensure timely transactions and mitigate risks associated with delayed margin collections, marking a significant step towards improving market efficiency and safeguarding investor interests."
  },
  {
    "title": "Is the white metal ready for a catch-up rally?",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/is-the-white-metal-ready-for-a-catch-up-rally/articleshow/120711275.cms",
    "summary": "The analysis regarding the potential for silver prices to rally in comparison to gold draws attention to the current gold to silver ratio, which stands at 100, marking its highest level since the onset of the COVID-19 pandemic in 2020. Historical data indicates that this ratio has exceeded 100 only three times in the past 50 years, with notable recoveries in silver prices usually following such events. \n\n• **Current Market Dynamics:**\n  - **Gold Price**: Trading at approximately $3,300 per ounce.\n  - **Silver Price**: Trading around $32.99 per ounce.\n  - **Price Growth**: Gold has surged over 25% in 2025, driven by demand for safe-haven assets amidst geopolitical tensions, particularly related to U.S.-China trade dynamics. In contrast, silver has only appreciated by 14.5% this year.\n\n• **Investment Insights:**\n  - Analysts recommend that given the current undervaluation of silver in relation to gold, investors should consider entering the silver market. \n  - Strategic recommendation includes purchasing silver exchange-traded funds (ETFs) as potential vehicles for investment.\n  - Expectations are set for silver to reach targets of $35-36 per ounce in the near future, translating to approximately ₹1,02,000-1,10,000 per kilogram in Indian markets.\n\n• **Geopolitical Context**:\n  - The potential resolution of geopolitical tensions could lead to a correction in gold prices, which might enhance silver's relative performance.\n  - The ongoing supply deficit in silver for the fifth consecutive year adds another layer of bullish sentiment regarding its future price movements.\n\nExperts advocate for a diversified investment approach, incorporating both silver and gold to balance exposure in precious metals, aligning with anticipated price movements in silver that are expected to occur in the coming months."
  },
  {
    "title": "Advent, Bain, TPG, others drawn to Whirlpool India",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/advent-bain-tpg-others-drawn-to-whirlpool-india/articleshow/120712675.cms",
    "summary": "Whirlpool Corporation is contemplating the sale of a **31% stake** in its Indian subsidiary, Whirlpool of India Ltd, which is significant for generating **85% of its Asia revenue**. This plan aims to secure **$550-600 million** in funds, as the company seeks to retain a **20% stake** while enhancing the operational autonomy of its Indian unit.\n\nKey highlights include:\n• The formal sale process began with consultancy support from **Goldman Sachs**.\n• Interested parties in the potential buyout include major private equity firms such as **Advent International, Bain Capital, TPG, EQT, Carlyle**, and **KKR**.\n• The transaction may involve multiple fund acquisitions, with the stipulation that acquiring a stake of **26% or more** would necessitate a public offering.\n• The initiative aims to allow Whirlpool India to grow independently, enhancing strategic management without direct oversight from the parent corporation, which has struggled to scale compared to competitors like **LG, Samsung**, and local players such as **Voltas**.\n\nThe market reacted to this announcement, with Whirlpool India shares experiencing a decline from **Rs 1,577** on January 29 to a low of **Rs 899** by March 3. After the announcements, shares stabilized at **Rs 1,199.35**.\n\nThe parent company intends to use the proceeds from this stake sale to **refinance existing debt**, similar to prior arrangements. This move also underlines Whirlpool's strategy to concentrate on growth without the interference that generally comes from balancing interests between **U.S. and Indian shareholders**.\n\nOverall, this stake sale presents a complex scenario for minority shareholders, with implications dependent on the evolving dynamics between the new potential investors and the existing management."
  },
  {
    "title": "RIL logs highest one-day gain in 11 months, could rise 11-22% more",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ril-logs-highest-one-day-gain-in-11-months-could-rise-11-22-more/articleshow/120711141.cms",
    "summary": "On April 29, 2025, Reliance Industries Limited (RIL) experienced its highest single-day gain in 11 months, surging over 5% following its positive fourth-quarter results for the year ended in March 2025. Key highlights from the quarterly report include:\n\n• **Financial Performance:** RIL reported a **2% increase** in consolidated net profit and a **10% rise** in revenue year-on-year, surpassing analysts' expectations.\n\n• **Market Response:** The promising earnings led to short covering by traders, driving the stock higher as bearish derivative bets were reduced.\n\n• **Brokerage Outlook:** Many brokerages maintained bullish ratings, projecting target prices between ₹1,520 and ₹1,660, implying a potential upside of **11-22%** from the stock's closing price of approximately ₹1,366.\n\n• **Sector Performance:** The retail segment showed strong performance even in a challenging demand environment, while the telecommunications sector benefited from earlier tariff hikes.\n\n• **Long-Term Strategy:** Analysts suggest that for investors focused on a **12-month horizon**, this could be an opportune time to buy, with projected targets between ₹1,550 and ₹1,600. Despite future growth in the oil and gas sector expected to be minimal, the consumer business (particularly telecom and retail) is anticipated to drive significant growth for the company.\n\n• **Historical Context:** Over the past three years, RIL's share price has risen only **6.7%**, in stark contrast to the Nifty index, which increased by **41.1%** during the same period. Similarly, in the last five years, RIL’s price climbed **113%**, compared to the index’s **160%** growth.\n\n• **Future Considerations:** Concerns persist regarding gross refining margins (GRMs) remaining below the long-term average and potential impacts from digital services and new energy ventures on overall stock performance.\n\nIn summary, Reliance Industries is positioned for potential growth driven by its robust consumer sector and positive market sentiment following recent financial results, despite challenges within the oil and gas sector."
  },
  {
    "title": "Independent Review On US Indictment Found No Irregularities, Says Adani Green",
    "url": "https://www.ndtvprofit.com/business/adani-green-independent-review-on-us-indictment-identified-no-irregularities",
    "summary": "Adani Green Energy Ltd. recently announced the results of an independent review related to a U.S. indictment involving its senior officials. The review concluded that the company and its subsidiaries have adhered to all applicable laws and regulations, dismissing any allegations of irregularities or non-compliance stemming from the indictment which accused three executives of conspiracy involving securities and wire fraud. The company stated that it does not foresee any material consequences from the ongoing legal proceedings.\n\nKey points from the announcement include:\n\n• **Compliance Affirmation**: Adani Green confirmed compliance with laws and regulations post-review.\n• **Indictment Details**: The U.S. Department of Justice indicted three executives last November.\n• **Ongoing Legal Proceedings**: Adani Green's management conveyed that these proceedings are not expected to materially affect the company.\n• **Management Update**: The company’s board approved the reappointment of Vneet S Jaain as managing director for a five-year term starting July 10.\n• **Financial Performance**: For the financial year ending March 31, 2025, Adani Green reported a 35% increase in EBITDA year-on-year, achieving ₹2,453 crore in Q4 and exceeding ₹8,818 crore for the fiscal year, demonstrating strong growth in operational renewable capacity.\n\nThe management's statement emphasizes their commitment to transparency and adherence to regulations amidst the legal challenges faced."
  },
  {
    "title": "Central Bank of India net profit rises 28%",
    "url": "https://www.thehindu.com/business/central-bank-of-india-net-profit-rises-28/article69502659.ece",
    "summary": "Central Bank of India reported a significant **28% increase** in its net profit for the fourth quarter, rising to **₹1,034 crore**, compared to **₹807 crore** during the same period last year. Despite this growth in profit, the bank experienced a **4% decrease** in net interest income, dropping to **₹3,399 crore** during the quarter ending in March 2025. Correspondingly, the net interest margin fell to **3.17%** from **3.6%** in the previous fiscal year.\n\nIn terms of asset quality, there were notable improvements:\n• Gross Non-Performing Assets (NPAs) improved to **3.2%**, down from **4.5%**.\n• Net NPAs declined to **0.5%**, compared to **1.2%** the previous year.\n\nFor the fiscal year **2024-25**, the bank's net profit surged by **48.5%**, reaching **₹3,785 crore**, up from **₹2,549 crore** in FY24.  This financial performance indicates a suggestive recovery and effective management in overcoming the challenges posed by the previous fiscal environments."
  },
  {
    "title": "IIP grows 3% as electricity, manufacturing output surge",
    "url": "https://www.thehindu.com/business/Economy/iip-grows-3-as-electricity-manufacturing-output-surge/article69501438.ece",
    "summary": "The **Index of Industrial Production (IIP)** in India registered a **3% growth** in March 2025, driven by significant increases in production from the electricity and manufacturing sectors. This data, released by the Ministry of Commerce and Industry, reveals that the electricity production rose **2.7 percentage points** to **6.3%**, fueled by higher demand from the summer months. In addition, the manufacturing sector saw an uptick, growing at **3%** compared to **2.7%** the previous month.\n\nKey details include:\n\n• The **consumer durables** sector experienced robust growth, indicating a **6.6%** increase, while the **construction** sector surged by **8.8%**.\n\n• Comparatively, the mining sector’s growth slowed down to **0.4%**, down from **1.6%** in February.\n\n• On a year-on-year basis, the IIP growth reached **4%**, marking the slowest pace observed in four years despite growth prospects being buoyed by domestic factors.\n\n• Consumer non-durables continued to decline, exhibiting a **4.7%** contraction.\n\n• In the broader sector classifications, **capital goods output** grew, albeit at a slower pace of **2.4%** compared to **8.1%** previously.\n\n• Sector performance also illustrated a decline in growth rates across all three major industrial sectors when evaluated from an annual perspective.\n\nIndustry experts note that while domestic market conditions are favorable, global economic pressures might pose challenges to sustaining this growth trajectory."
  },
  {
    "title": "Adani Green Q4 Results: Cons PAT jumps 24% YoY to Rs 383 crore, revenue up 22%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-green-q4-results-cons-pat-jumps-24-yoy-to-rs-383-crore-revenue-up-22/articleshow/120703771.cms",
    "summary": "Adani Green Energy Ltd. (AGEL) has reported a significant increase in its financial performance for the fourth quarter of the fiscal year 2025. The company's consolidated net profit surged by *24% year-on-year* to **Rs 383 crore**, compared to **Rs 310 crore** in the same quarter of the previous year. \n\nKey financial highlights include:\n• **Quarterly Revenue**: Increased by *22%* to **Rs 3,073 crore**, up from **Rs 2,527 crore** in Q4 FY24.\n• **Sequential Comparison**: The profit after tax fell by *19%* from **Rs 474 crore** in Q4 FY24, whereas revenue rose by *31%* from **Rs 2,340 crore** in Q3 FY25.\n• **Total Revenue** in FY25 rose by *23%* year-on-year to **Rs 9,495 crore**.\n\nAGEL's operational capacity also improved, showing a *30%* increase to **14.2 GW**. The sales of energy increased by *28%* year-on-year, resulting in the company generating **27,969 million units** in FY25, which parallels roughly half of Singapore’s annual power consumption.\n\nAdditional operational performance metrics include:\n• **Solar Capacity Utilization Factor (CUF)**: Stood at *24.8%*, demonstrating high availability of 99.5%.\n• **Wind CUF**: Maintained at *27.2%* with 95.9% availability.\n• **Hybrid Portfolio CUF**: Achieved *39.5%* with 99.6% availability.\n\nThe company has refinanced a **$1.06 billion** construction facility with a long-term debt structure, aligning it closely with power purchase agreements (PPAs) cash flows. \n\nThe ongoing growth trajectory and operational enhancements reflect AGEL's commitment to increasing its renewable energy footprint while managing financial stability. This consistent performance accentuates its position in the renewable energy sector as it explores further expansion."
  },
  {
    "title": "HG Infra Engineering Subsidiary Bags Rs 1,123-Crore Contract From NHAI",
    "url": "https://www.ndtvprofit.com/business/hg-infra-engineering-subsidiary-bags-rs-1123-crore-contract-from-nhai",
    "summary": "HG Infra Engineering Limited has announced a significant achievement with its subsidiary, HG Raipur Visakhapatnam OD-6 Pvt, securing a ₹1,123.1 crore contract from the National Highway Authority of India (NHAI). This contract involves the construction of the six-lane Baunsaguar-Baraja section of NH-130-CD Road in Odisha, part of the Raipur-Visakhapatnam Economic Corridor. \n\nKey details include:\n\n• **Project Timeline:** The project is designated for completion within **730 days** and was certified for commercial operation slated to start from January 8, 2025.\n\n• **Contract Award Date:** The award was publicly disclosed in an exchange filing dated April 28, 2025.\n\n• **Financial Instruments:** The company's trading window for its securities will remain closed for all designated persons and their immediate relatives until two days post the announcement of audited financial results for the quarter and year concluding March 31, 2025.\n\n• **Recent Developments:** Earlier in April 2025, HG Infra Engineering noted the resignation of Chandra Pal Mehta, its technical president, effective from April 24, 2025. Additionally, the company was recently awarded a contract for the installation of a **500 MW/1000 MWh battery energy storage system in Gujarat**.\n\n• **Market Response:** As of the latest trading session, shares of HG Infra Engineering recorded a slight decline of 0.02% to ₹1,086.15 on the Bombay Stock Exchange (BSE), while the benchmark Sensex experienced a rise of 1.27%.\n\nThis contract positions HG Infra Engineering strategically within India’s expanding infrastructure sector and underscores its capabilities in handling large-scale civil engineering projects."
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/120702971.cms",
    "summary": "On the 28th of April 2025, Indian stock markets exhibited a robust performance, principally attributable to robust earnings from Reliance Industries and consistent foreign institutional investments amidst geopolitical tensions between India and Pakistan. The BSE Sensex surged by **1,005.84 points** or **1.27%**, closing at **80,218.37**, while the broader Nifty 50 increased by **289.15 points** or **1.20%**, settling at **24,328.50**. This market rebound came after two consecutive days of declines caused partially by rising border tensions.\n\nKey points include:\n\n• **Market Recovery**: The domestic market overturned previous losses, buoyed by significant buying from foreign investors. Market sentiment was notably optimistic due to better-than-expected financial results from Reliance Industries.\n\n• **Foreign Investment Trends**: Analysts suggest that a declining U.S. dollar and ongoing inflationary pressures might continue to draw foreign investment into India. However, market participants are cautioned about potential volatility stemming from geopolitical events, specifically related to the Pahalgam terror attack.\n\n• **Investment Strategy Advice**: Vinod Nair, Head of Research at Geojit Investments, recommended that new investors maintain a portfolio with **40% in cash and debt** while adopting a bottom-up investment strategy based on equities grounded in earnings outcomes.\n\n• **Technical Indicators**: The Nifty index faced resistance at the **24,360** line, with expectations that it might hover around this range unless it decisively breaches this level. If crossed, a potential upward move towards **24,550** could occur, while support is identified at **24,000**.\n\n• **Active Stocks**: The most actively traded stocks based on turnover included Reliance Industries Ltd, Shriram Finance, and ICICI Bank. In terms of volume, Vodafone Idea and RBL Bank led the trading charts.\n\n• **Market Sentiment**: Overall sentiment appeared neutral; of the **4,179** stocks traded, **2,091** experienced declines, **1,914** saw advances, while **174** remained unchanged.\n\nThis comprehensive overview captures the recent movements in the Indian stock markets, reflecting the interplay of corporate performance, investor behavior, and broader economic conditions. Investors are encouraged to remain aware of external risks while navigating their strategies in this evolving market landscape."
  },
  {
    "title": "Urban Company IPO: Offer For Sale By Accel, Elevation And Tiger Global, Fresh Issue Worth Up To Rs 429 Crore",
    "url": "https://www.ndtvprofit.com/ipos/urban-company-ipo-ofs-by-accel-elevation-and-tiger-global-fresh-issue-worth-up-to-rs-429-crore",
    "summary": "Urban Company Ltd., a home services provider, has proposed an Initial Public Offering (IPO) aiming to raise up to **Rs 1,900 crore**. The offering will comprise a **fresh issue** of shares worth **up to Rs 429 crore** to fund various corporate needs, including technology development and marketing efforts.\n\nKey highlights of the IPO proposal include:\n\n- **Stake Sales**: Existing investors plan to sell shares up to **Rs 1,471 crore**, including significant stake offerings from Accel India (**Rs 433 crore**), Bessemer India (**Rs 173 crore**), and Elevation Capital (**Rs 346 crore**).\n- **Fresh Issue Reduction**: A pre-IPO placement may occur for up to **Rs 86 crore**, which will lead to a corresponding decrease in the size of the fresh issue.\n- **Utilization of Funds**: The proceeds from the fresh issue are intended for:\n  • Technology development\n  • Cloud infrastructure investment\n  • Lease payments for office space \n  • Marketing activities\n  • General corporate purposes\n\n### Financial Performance\n\nIn the fiscal year 2024, Urban Company reported a **30% revenue growth**, achieving **Rs 828 crore**, while narrowing its losses significantly from **Rs 312 crore** in FY2023 to **Rs 93 crore**. The company's revenue for the nine months ending December 2024 increased by **41%**, reaching **Rs 846 crore**, with a reduced EBITDA loss of **Rs 22 crore** compared to a **loss of Rs 97 crore** in the previous year.\n\nFurther insights into Urban Company’s fiscal health reveal:\n- Positive operating cash flow for the nine-month period ending December 2024.\n- Current cash reserves amounting to approximately **Rs 590 crore**.\n- A commitment to sustaining high operating expenses as it expands its service offerings and invests in technology.\n\n### Market Position and Future Plans\n\nUrban Company recently launched its **Insta Help service**, marking its entry into the quick commerce market. The IPO seeks to capitalize on the growing demand for home services and the company's established reputation in the technology-driven service sector. This move is anticipated to enhance investor confidence and attract fresh capital for expansion.\n\n### Investment Banks Involved\n\nLeading the underwriting for this IPO are:\n• Kotak Mahindra Capital Co.\n• Morgan Stanley India Co.\n• Goldman Sachs India Securities Pvt.\n• JM Financial Ltd.\n\nAs Urban Company gears up for this IPO, it demonstrates a strategic approach to meeting capital needs while positioning itself for sustained growth in a competitive market landscape."
  },
  {
    "title": "UltraTech’s profit rises 10% on year aided by volume growth",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratechs-profit-rises-10-on-year-aided-by-volume-growth/articleshow/120702927.cms",
    "summary": "UltraTech Cement has reported a **10% increase** in its consolidated net profit, reaching **Rs 2,482 crore** for the March quarter compared to the previous year, primarily driven by a **17% rise in sales volumes**. The company sold approximately **41.02 million tonnes** during this period, which notably includes contributions from their acquisitions of **India Cements** and **Kesoram Cement** from the last financial year. \n\nKey financial and operational highlights include:\n\n• **Consolidated sales** rose by **14% year-on-year** to **Rs 22,788 crore**.\n• Earnings before interest, tax, depreciation, and amortization (EBITDA) increased **11% yearly**, totaling **Rs 4,721 crore**.\n• Despite this growth, revenue realization per tonne of grey cement decreased by **2.3%**, settling at **Rs 5,052**.\n• Costs associated with logistics, fuel, power, and raw materials saw a reduction of **4-16%** compared to last year, with energy costs dropping by **14%**.\n• The company utilized **89%** of its effective capacity during the quarter.\n\nLooking ahead to the fiscal year **2024-2025**, UltraTech's consolidated revenue is projected to climb **7% year-over-year**, achieving **Rs 74,936 crore**, backed by total cement sales of **135.83 million tonnes**, increasing by **14%** from the previous year. However, total profit for the year dipped to **Rs 6,039 crore**, down from **Rs 7,005 crore**, attributed to elevated interest and depreciation costs.\n\nThe company anticipates a sustainable volume growth rate of **7-8%** in the near term, supported by government initiatives focused on infrastructure and housing development. UltraTech also announced the addition of **17.40 million tonnes** of new capacity in 2024-25, raising its overall capacity to **183.36 million tonnes**. This expansion was complemented by the integration of **42.60 million tonnes** of capacity from acquisitions over the past year.\n\nDespite facing some short-term sector challenges, the long-term outlook remains optimistic, with expectations of stable demand facilitating growth. Upon announcement of these results, UltraTech shares closed at **12,108.25 rupees**, marking a **1.05% decrease** from the previous close. Additionally, the company declared a dividend of **Rs 77.50** per share."
  },
  {
    "title": "Rs 1.25 lakh crore OMO likely to bring down yields ahead of the new 10 year auction",
    "url": "https://economictimes.indiatimes.com/markets/forex/rs-1-25-lakh-crore-omo-likely-to-bring-down-yields-ahead-of-the-new-10-year-auction/articleshow/120702811.cms",
    "summary": "The Reserve Bank of India (RBI) has announced its intention to purchase government bonds worth **₹1.25 lakh crore** through open market operations (OMO) in four tranches throughout May. This strategy is aimed at reducing government bond yields prior to a scheduled 10-year bond auction. The specific dates for these bond purchases are **May 6, May 9, May 15**, and **May 19**. \n\nKey points regarding this activity include:\n\n• **Market Reaction**: The announcement has surprised market participants, with expectations that it could lower government bond yields by approximately **4-5 basis points**. Recently, the 10-year benchmark yield had increased slightly, closing at **6.39%**, rising from **6.36%** the previous day.\n\n• **Influencing Factors**: There are ongoing border tensions between India and Pakistan, which have contributed to an uptick in yields by about **7-8 basis points** recently. The OMO initiative is seen as a move by the RBI to counteract these pressures and stabilize yields before the upcoming auction.\n\n• **Auction Details**: The RBI aims to raise **₹30,000 crore** through the new 10-year bond, which will serve as the benchmark security, replacing the current **6.79% 2034 bond** which has an outstanding amount of **₹1.84 lakh crore**.\n\n• **Liquidity and Economic Impacts**: The OMO purchases are anticipated to help ease banking system liquidity to **1%** on Net Demand and Time Liabilities (NDTL) and also offset monthly Goods and Services Tax (GST) outflows that occur around the 20th of each month. Overall, system liquidity has been in surplus, averaging around **₹1.5 lakh crore** as of April.\n\nIn summary, the RBI's proactive measures through OMO are aimed at stabilizing the bond market amidst external economic pressures, thus ensuring favorable conditions for government borrowing and maintaining overall financial stability."
  },
  {
    "title": "Dr. Reddy’s to introduce Sanofi’s novel RSV drug in India",
    "url": "https://www.thehindu.com/business/dr-reddys-to-introduce-sanofis-novel-rsv-drug-in-india/article69502189.ece",
    "summary": "Dr. Reddy's Laboratories has announced an expansion of its partnership with Sanofi Healthcare India (SHIPL) to launch the novel drug Beyfortus (nirsevimab) in India. This drug is a monoclonal antibody delivered via a prefilled injection, designed to prevent respiratory syncytial virus (RSV) lower respiratory tract disease (LRTD) in newborns and infants during their first RSV season. \n\nKey details of this partnership and product launch include:\n\n• **Exclusive Rights:** Dr. Reddy's will hold exclusive rights to promote and distribute Beyfortus in India. This follows prior collaboration on the distribution of Sanofi's vaccine portfolio in the country.\n\n• **Expected Launch Date:** The launch is anticipated in the second quarter of the current fiscal year, 2025.\n\n• **RSV Implications:** RSV is a highly contagious virus responsible for a significant number of hospitalizations among infants, causing diseases such as bronchiolitis and pneumonia. In 2019, it contributed to around 33 million acute lower respiratory infections globally.\n\n• **Regulatory Approval:** Beyfortus has already received marketing authorization in India from the Central Drugs Standard Control Organization (CDSCO) as of June 2025, and has been approved in multiple countries, including the EU, the U.S., China, and Japan.\n\n• **Market Strategy:** The CEO of Dr. Reddy’s emphasized that the introduction of Beyfortus will bolster their immunization portfolio in India, addressing a significant health burden and providing early protection for vulnerable infants.\n\n• **Sanofi’s Positioning:** The Head of Sanofi Vaccines in India noted that this collaboration will enable improved outreach to parents and healthcare providers, ensuring that an effective solution can be delivered to those needing it most.\n\nOverall, this collaboration highlights a significant step in addressing the health needs of newborns and infants in India, particularly concerning RSV diseases."
  },
  {
    "title": "Bajaj Allianz General Insurance launches parametric insurance product",
    "url": "https://www.thehindu.com/business/bajaj-allianz-general-insurance-launches-parametric-insurance-product/article69502296.ece",
    "summary": "Bajaj Allianz General Insurance Company has recently launched a pioneering parametric insurance product titled *ClimateSafe* on April 28, 2025. This innovative initiative addresses the increasing vulnerabilities associated with climate change, particularly affecting those whose livelihoods are significantly impacted by extreme weather conditions.\n\n**Key Features of ClimateSafe Insurance:**\n- **Financial Protection**: Designed to provide rapid financial assistance triggered by specific climate-related parameters such as extreme temperatures and excessive rainfall.\n- **Target Audience**: The coverage is tailored for a diverse clientele, including retail customers, gig workers, taxi drivers, small business owners, and individuals exposed to climate risks.\n- **Claim Processing**: The policy ensures automatic claim settlements within seven days, requiring minimal documentation and allowing customers to purchase coverage multiple times a year.\n- **Dynamic Pricing**: Premiums are adjusted based on real-time climatic data aligned with predefined triggers related to various weather conditions.\n- **Customization Options**: Customers have the flexibility to select their risk location, duration (ranging from one to thirty days), type of weather risk, and the amount insured.\n\nThis launch marks a significant advancement in climate risk management in India, as stated by the Managing Director and CEO, Tapan Singhel, highlighting the urgent necessity of safeguarding livelihoods against the unpredictable impacts of climate change. The *ClimateSafe* offering is positioned as a response to the escalating environmental challenges, providing vital financial assurance to the vulnerable segments of society."
  },
  {
    "title": "Rupee briefly breaches 85/$1 on strong equity inflows; RBI steps in",
    "url": "https://economictimes.indiatimes.com/markets/forex/rupee-briefly-breaches-85/1-on-strong-equity-inflows-rbi-steps-in/articleshow/120702745.cms",
    "summary": "The Indian rupee experienced significant fluctuations recently, briefly surpassing the 85 level against the US dollar due to strong foreign equity inflows. On April 28, 2025, the rupee reached an intraday high of 84.98/$1 before settling at 85.03/$1. This movement was likely influenced by substantial portfolio investments in Indian equities, with Foreign Portfolio Investors (FPIs) purchasing approximately ₹2,474 crore on that day.\n\n• **Reserve Bank of India's (RBI) Intervention:** The Reserve Bank likely intervened to stabilize the currency, absorbing US dollars through state-run banks to prevent excessive volatility around the 85/$1 mark, a key psychological resistance level for traders.\n\n• **Market Sentiment:** Despite the positive momentum from equity flows, persistent selling pressure on the dollar and geopolitical tensions continued to create caution among market participants. As a result, traders are closely watching upcoming economic data, including the US Personal Consumption Expenditures (PCE) inflation numbers and the non-farm payrolls report, which may impact currency trading strategies.\n\n• **Bond Yields:** The yields on the 10-year benchmark government securities increased by three basis points to 6.39%, attributed to geopolitical factors between India and Pakistan and the anticipation of a new bond auction.\n\nIn conclusion, while the rupee's movement past the 85/$1 threshold indicates potential strength bolstered by foreign investments, the market remains vigilant due to external economic factors and the RBI's ongoing role in stabilizing currency fluctuations."
  },
  {
    "title": "Gold cheaper by Rs 4,700 per 10 gram from peak, slips below Rs 95,000. Should you buy, sell or hold?",
    "url": "https://economictimes.indiatimes.com/markets/commodities/gold-cheaper-by-rs-4700-per-10-gram-from-peak-slips-below-rs-95000-should-you-buy-sell-or-hold/articleshow/120702162.cms",
    "summary": "Gold prices in India have recently decreased by 5%, dropping to below Rs 95,000 per 10 grams, a fall of Rs 4,700 from their peak. This decline presents a potential buying opportunity for investors, particularly as the auspicious festival of Akshaya Tritiya approaches. Experts recommend gradually investing in gold amidst the backdrop of a strengthening U.S. dollar, which has rallied back towards the 100-mark following recent political developments, including President Trump's postponement of tariff impositions.\n\nKey points discussed include:\n\n• **Current Market Trends:** \n  - Gold prices have seen a significant correction but remain up 23% year-to-date, contributing an increase of Rs 18,000 per 10 grams.\n  - Analysts suggest a 15-20% allocation in gold and silver for investment portfolios.\n\n• **Investment Strategy:** \n  - The current price drop may facilitate investors to consider staggered purchases via systematic investment plans (SIPs) rather than a lump sum investment. \n\n• **Market Factors Influencing Prices:**\n  - The U.S. dollar's strength shows an inverse correlation with gold prices, further complicating market dynamics.\n  - Any instability in trade talks may lead to fluctuations in gold prices, making ongoing monitoring essential.\n\n• **Technical Analysis:** \n  - Recent patterns indicate a potential reversal in price trends, with predictions of possible further declines if prices move below Rs 95,000, or potential rebounds if they surpass Rs 96,400.\n\nOverall, while the recent dip in gold prices is significant, it offers a strategic opening for long-term investors, particularly given impending festive demand and ongoing market volatility influenced by foreign currency strength."
  },
  {
    "title": "Urban Company files DRHP for Rs 1,900-crore IPO",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/urban-company-files-draft-papers-for-223-million-ipo/articleshow/120711855.cms",
    "summary": "Urban Company, known for its mobile app-based beauty and home care services, has filed for an initial public offering (IPO) of Rs 1,900 crore. The offering will include a primary issuance of new shares worth Rs 429 crore and a secondary sale of shares valued at Rs 1,471 crore from existing investors. Key stakeholders such as Accel, Elevation Capital, Tiger Global, and Vy Capital will offload their stakes through an offer for sale (OFS), although the company's founders, who hold about 21% of Urban Company, will not sell any of their shares.\n\n• The IPO size was reduced from an initially planned Rs 3,000 crore.\n• The company aims to utilize Rs 190 crore of the fresh capital for new technology development and cloud infrastructure. The remaining funds will be allocated for office leases and marketing initiatives.\n• Urban Company has engaged Kotak Mahindra Capital, Morgan Stanley, Goldman Sachs, and JM Financial as underwriters for the IPO.\n\nIn the last fiscal year, the company achieved significant growth, recording an operating revenue of Rs 846 crore, representing a 41% increase year-on-year. Notably, Urban Company has transitioned to profitability, posting a net profit of Rs 242 crore in the first nine months of FY25, compared to a loss of Rs 58 crore during the same period in the prior year. \n\nAlongside its core at-home services, Urban Company has diversified into the direct-to-consumer sector, launching products such as water purifiers and smart locks, and rolled out a service allowing users to book house help in just 15 minutes. This IPO comes at a time when other companies, including Ather Energy and edtech platform PhysicsWallah, are also pursuing public offerings."
  },
  {
    "title": "Market Trading Guide: Paras Defence, Bharat Forge are among 5 stock recommendations for Tuesday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-paras-defence-bharat-forge-are-among-5-stock-recommendations-for-tuesday/slideshow/120700990.cms",
    "summary": "Indian frontline indices observed a notable recovery on Monday, with key stocks such as **Reliance Industries** and **ICICI Bank** driving the performance of the BSE Sensex and **Nifty**. Despite the positive movement in various sectors, particularly **Oil & Gas**, automotive, and pharmaceuticals, the **Nifty** ended the day at **24,328.50**, down by **289.15 points** or **1.2%**, whereas the **BSE Sensex** rose to **80,218.37**, experiencing an increase of **1005.84 points** or **1.27%**.\n\n### Market Overview\n- The **Nifty** has entered a consolidation phase, with **24,360** identified as a crucial resistance level. \n- Technical analyst **Rupak De** from **LKP Securities** highlights:\n  - The potential for the index to remain within the current range unless it decisively surpasses **24,360**.\n  - Possible upward movement towards **24,550** if breached, correlating with the **61.80% Fibonacci retracement**.\n  - Support is noted at **24,000**, below which a decline to **23,800** or even **23,350** could occur.\n\n### Stock Recommendations for Tuesday\n1. **Paras Defence**\n   - **Buy** at ₹1,143.75\n   - **Target**: ₹1,225\n   - **Stop Loss**: ₹1,100\n   - Strong buying interest observed post breakout.\n\n2. **Priviscl**\n   - **Buy** at ₹1,981.90\n   - **Target**: ₹2,100/₹2,150\n   - **Stop Loss**: ₹1,900\n   - Confirmed bullish trend following a range breakout.\n\n3. **Hindustan Petroleum**\n   - **Buy** at ₹392\n   - **Target**: ₹412\n   - **Stop Loss**: ₹378\n   - Exhibited strength at lower levels with bullish candlestick patterns.\n\n4. **Sun Pharma**\n   - **Buy** in the range of ₹1,840-₹1,820\n   - **Target**: ₹1,920\n   - **Stop Loss**: ₹1,770\n   - Triangle breakout signals positive momentum.\n\n5. **Bharat Forge**\n   - **Buy** in the range of ₹1,110-₹1,120\n   - **Target**: ₹1,170\n   - **Stop Loss**: ₹1,078\n   - Positive divergence in RSI suggests recovery strength.\n\nThese recommendations and observations illustrate the market's current dynamics, enabling investors to make informed decisions amid ongoing volatility and sectoral shifts."
  },
  {
    "title": "LG Electronics IPO to be delayed amid market volatility",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/lg-electronics-ipo-to-be-delayed-amid-market-volatility/articleshow/120700632.cms",
    "summary": "• **Overview of Delay**  \n  LG Electronics has postponed the initial public offering (IPO) for its Indian subsidiary due to the current volatility in local share markets. The initial plan was to launch the IPO in the second week of May.\n\n• **Reason for Delay**  \n  The IPO has been deferred for at least one quarter and may face further delays if market conditions remain unfavorable. Factors contributing to this uncertainty include new tariff regulations and the aftermath of a recent terror attack in Jammu & Kashmir.\n\n• **IPO Details**  \n  - The IPO was expected to amount to approximately ₹15,000 crore.\n  - There has been a lukewarm response from potential investors.\n  - The IPO will consist of an **offer for sale (OFS)** of over 10.18 crore equity shares, translating to a 15% stake in LG Electronics India.\n\n• **Current Status**  \n  - A final decision on the IPO listing will be made based on ongoing market assessments.\n  - No fresh issuance of shares will occur, meaning that proceeds will go solely to the parent company, LG Electronics Inc., instead of LG Electronics India.\n\n• **Company Background**  \n  LG Electronics India is a prominent player in the home appliances and consumer electronics market, catering to both B2C and B2B sectors. The company reported a revenue of ₹64,087.97 crore for the financial year ending March 31, 2024."
  },
  {
    "title": "REC raises Rs 5,000 cr via bonds",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/rec-raises-rs-5000-cr-via-bonds/articleshow/120700565.cms",
    "summary": "State-owned REC Ltd announced on April 28, 2025, that it has successfully raised **Rs 5,000 crore** through the issuance of bonds. The bond offering was structured as follows:\n\n• **Rs 3,000 crore** through **five-year bonds** with a coupon rate of **6.87%**.  \n• **Rs 2,000 crore** through **ten-year bonds** with a coupon rate of **6.86%**.  \n\nThe demand for these bonds was robust, indicating **strong investor confidence** in REC's **financial stability** and **growth potential**. The bonds have received a **\"AAA\" rating** from leading credit rating agencies such as **CARE Ratings**, **ICRA**, and **India Ratings & Research Pvt Ltd (IRRPL)**, which signifies the highest level of safety regarding timely payment of interest and principal.\n\nThese bonds will be listed on the **Bombay Stock Exchange (BSE)** and the **National Stock Exchange (NSE)**, which will enhance their **liquidity** and offer investors the ability to trade them easily. This issuance not only reflects the company's sound financial health but also highlights its capability to attract significant funding through capital markets."
  },
  {
    "title": "India's Shriram Finance mulling yen-denominated fundraise to diversify borrowing, CEO says",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/indias-shriram-finance-mulling-yen-denominated-fundraise-to-diversify-borrowing-ceo-says/articleshow/120700493.cms",
    "summary": "India's **Shriram Finance**, a non-banking financial company (NBFC), is currently considering the possibility of raising funds denominated in Japanese yen to diversify its borrowing profile. This initiative is still in the early stages of discussion, according to CEO **YS Chakravarti**. Options being explored include borrowing from banking institutions or through international bond issues available for corporate subscriptions.\n\nKey details of their current financial status include:\n\n• As of March-end, external commercial borrowing accounted for nearly **15%** of Shriram’s total borrowing, while overseas bonds made up about **6.8%**.\n\n• The company had recently raised **$1.28 billion** through a multi-currency social loan in December, which included currencies such as the dollar, euro, and dirham.\n\n• The latest quarter results indicated a smaller-than-expected profit, primarily due to increased finance costs, leading to a **9% drop in shares**.\n\nFuture growth plans involve:\n\n• Targeting **17%-18%** growth in assets under management (AUM) for 2025-26, an increase from the previous estimate of **15%**. \n\n• As of the latest reporting, Shriram Finance's AUM stood at **2.63 trillion rupees** (approximately **$30.96 billion**), reflecting a **17% year-on-year increase**.\n\n• The CEO emphasized leveraging their passenger vehicle and small to medium enterprise loan portfolios to support this growth while also developing new products like unsecured business loans and supply chain financing.\n\n• Additionally, Shriram Finance plans to utilize approximately **300 billion rupees** of excess liquidity to enhance net interest margins, which are expected to range between **8.50%-8.80%** for the current fiscal year, up from **8.25%** in the previous quarter.\n\nChakravarti mentioned that having excess liquidity positions the company to negotiate attractive borrowing rates, projecting a decline in borrowing costs moving forward."
  },
  {
    "title": "UCO Bank to issue 270 crore shares in FY26 to cut govt stake to 75%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/uco-bank-to-issue-270-crore-shares-in-fy26-to-cut-govt-stake-to-75/articleshow/120700390.cms",
    "summary": "UCO Bank has announced its plan to issue **up to 270 crore fresh equity shares** in the fiscal year 2025-26. This initiative aims to reduce the government's stake in the bank to **75%** in accordance with the **Securities and Exchange Board of India (SEBI)**'s minimum public shareholding (MPS) regulations. \n\nKey details include:\n\n• **Background:** The recent decision follows UCO Bank's successful **Qualified Institutional Placement (QIP)** in the March quarter, where it raised **Rs 2,000 crore**. This placement allowed the bank to decrease the government's shareholding from **95.39% to 90.95%**.\n\n• **Share Issuance:** The bank plans to offer shares rated at **Rs 10** each, with an anticipated total valuation of around **Rs 8,000 crore** based on current market prices of around **Rs 31 per share**.\n\n• **Financial Performance:** UCO Bank has shown improvement in its financials, reporting a nearly **24% year-on-year increase** in consolidated net profit, rising to **Rs 665.72 crore** for the quarter ending in March 2025.\n\n• **Asset Quality:** The bank has maintained a steady net Non-Performing Asset (NPA) ratio of **0.7%**, with no significant delinquency pressure reported in the retail segment, despite the **Reserve Bank of India (RBI)**'s prior warnings regarding risks in retail lending.\n\nUCO Bank's focus on enhancing its capital adequacy and asset quality signifies its commitment to improving profitability and reducing reliance on government funding."
  },
  {
    "title": "TVS Motor Now Earns Nearly One Rupee Out Of Every 10 From EV Business",
    "url": "https://www.ndtvprofit.com/auto/tvs-motor-now-earns-nearly-one-rupee-out-of-every-10-from-ev-business",
    "summary": "TVS Motor Company has reported significant growth in its electric vehicle (EV) sales, with revenue from EVs representing nearly **9.27%** of its total revenue for the fiscal year ending March 31, 2025. This equates to approximately **₹3,364 crore** out of a total revenue of **₹36,251 crore**. In the fourth quarter alone, EV revenue increased slightly to **9.51%**, amounting to **₹889 crore** out of **₹9,342 crore** in revenue, excluding benefits from production-linked incentives (PLI).\n\nThe company demonstrated impressive year-on-year growth in EV unit sales, achieving a **44%** increase, selling approximately **279,000 units** across multiple vehicle categories, including two- and three-wheelers. Notably, during the January-March 2025 period, EV sales surged by **54%**, with **76,000 units** sold. CEO KN Radhakrishnan attributed this revenue growth to substantial investments in EV product development.\n\nShifts in consumer preferences are evident, as demand for electric scooters is outpacing motorcycles, supported by a **21% growth** in overall scooter sales to **1.904 million units**, of which electric scooters constituted **12.44%**. The motorcycle segment experienced a more modest **10% increase** to **1.99 million units**. Industry data revealed that EV penetration within the overall two-wheeler segment reached **6.2%** for FY25.\n\nDespite these achievements, TVS Motor aims to strengthen its presence in the electric three-wheeler market, which currently shows a **26-27%** penetration rate. Rivals such as Mahindra and Bajaj dominate this space. The company has only recently entered this segment, focusing primarily on southern India but planning to expand into larger markets in northern and eastern India.\n\nIn response to these developments, shares of TVS Motor rose by **2.48%**, closing at approximately **₹2,803.55** on the Bombay Stock Exchange, even as the broader market, represented by the Sensex index, also experienced an uptick of **1.27%** to **80,218.37 points**."
  },
  {
    "title": "Two Sharp with ET: Sensex scales Mount 80K, Reliance beats Q4 estimates, jumps 5 per cent",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-sensex-scales-mount-80k-reliance-beats-q4-estimates-jumps-5-per-cent/videoshow/120699927.cms",
    "summary": "• **Market Overview:** The Indian stock market experienced a significant upswing, with the Sensex rising by *1,000 points* to touch the *80,000 mark*, while the Nifty increased by *289 points*.\n\n• **Reliance Industries' Performance:** Reliance Industries reported its Q4 results, *exceeding expectations*. The company benefited from robust growth in its *retail and Jio segments*, paired with a reduction in crude oil prices, which contributed to the market rally.\n\n• **Brokerage Predictions:** Following these results, brokerages have become increasingly optimistic about Reliance’s stock, predicting an **upside potential of up to 31%**.\n\n• **Cautionary Notes:** Despite the positive market sentiment, analysts have advised caution due to *ongoing tensions* between India and Pakistan, which could impact market stability.\n\n• **Overall Implications:** The rally in Indian markets, spurred largely by Reliance's strong performance, illustrates the interconnectedness of corporate results and market dynamics. Stakeholders are advised to monitor geopolitical factors that could potentially affect future market movements."
  },
  {
    "title": "App Store an economic miracle for developers in India, says Tim Cook",
    "url": "https://www.thehindu.com/business/app-store-an-economic-miracle-for-developers-in-india-says-tim-cook/article69501604.ece",
    "summary": "The App Store ecosystem in India has significantly benefited developers, generating **₹44,447 crore** (approximately **$5.31 billion**) in billings and sales during **2024**, according to a recent study conducted by **Apple**. The findings highlight that more than **94%** of these revenues were accrued directly to developers without any commission being paid to Apple. Over the past five years, the earnings of India-based developers have tripled, showcasing the vibrant app economy in the country.\n\n**Key Findings from the Study:**\n- The App Store has been described as an **\"economic miracle\"** for developers by Apple CEO **Tim Cook**.\n- The study was led by **Professor Viswanath Pingali** from the **Indian Institute of Management Ahmedabad**, focusing on the factors driving the App Store in India, which includes sectors like food delivery, travel, and entertainment.\n- Developers generated **₹38,906 crore** (around **$4.65 billion**) from sales of goods and services, **₹3,014 crore** (approximately **$352.9 million**) from in-app advertising, and **₹2,527 crore** (around **$302 million**) from digital goods and services within the same year.\n- Apps developed in India cater to a growing quick commerce and gig economy, providing flexible job opportunities and on-demand services that enhance convenience for users.\n\nApple remains committed to further investments in India's app developers to drive continued growth and innovation in the tech industry."
  },
  {
    "title": "Gold Prices Fall Rs 1,000 Amid US-China Trade Deal Optimism",
    "url": "https://www.ndtvprofit.com/markets/gold-prices-fall-rs-1000-amid-us-china-trade-deal-optimism",
    "summary": "Retail gold prices in India experienced a decline of **Rs 1,000**, falling to **Rs 98,400 per 10 grams** amidst growing optimism regarding a potential resolution to US-China trade tensions. The price for gold with a purity of 99.5% also dropped to **Rs 97,900 per 10 grams**. This decrease is attributed to an increase in investor risk appetite driven by developments in US-China tariff exemptions, along with a stronger US dollar, which further pressured gold prices as investors shifted their focus away from safe-haven assets like bullion.\n\n**Key Insights:**\n• **Market Impulse:** Optimism surrounding the US-China trade deal has raised expectations among investors, leading to reduced demand for gold.\n• **Geopolitical Factors:** Chintan Mehta from Abans Financial Services indicated that rising geopolitical tensions, especially conflicts involving major powers, could increase future demand for gold as a safe-haven asset.\n• **Federal Reserve Stance:** US Federal Reserve officials have expressed no immediate need for changes to current monetary policies, which suggests potential delays in interest rate cuts, further diminishing gold's attractiveness as an investment amidst higher interest rates.\n• **Economic Data Predictions:** Analysts are keeping a close watch on upcoming US economic data such as production outputs and labor market statistics, which might influence market dynamics.\n\nOverall, while short-term pressures are evident on gold prices due to external factors, analysts believe that continued geopolitical tensions may lead to a resurgence in demand for gold as a reliable asset."
  },
  {
    "title": "Wall Street takes a breath ahead of another week full of potential swings",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-busy-week-for-earnings-data-kicks-off/articleshow/120699344.cms",
    "summary": "U.S. stock markets experienced mixed performance as key economic reports and earnings announcements loom from major corporations such as Amazon, Apple, and Microsoft. Investors are exercising caution, keen to gauge signals surrounding economic growth alongside concerns regarding consumer confidence and potential slowdowns in hiring due to trade uncertainties.\n\n• The tech-heavy Nasdaq faced declines, primarily driven by losses in megacap stocks. Notably, Tesla dropped by 3.2%, while Nvidia fell by 3.6%. \n• **Upcoming earnings:** Major companies including Apple and Meta Platforms are set to announce results, with investor sentiment heavily influenced by trade policy and economic indicators.\n• An anticipated report detailing China's Huawei Technologies' efforts to test an AI processor aimed at competing with Nvidia's products has contributed to market dynamics.\n• A majority of economists believe that risks of a recession are elevated as uncertainties regarding U.S. tariffs linger, potentially affecting corporate outlooks. Despite expectations of a 9.7% increase in first-quarter earnings for S&P 500 companies, many firms have expressed caution, revising or withdrawing annual forecasts.\n• Crucial economic data, including the U.S. payroll figures and personal consumption expenditures price index, is expected to be released, shaping market trends. \n\nAt midday trading, the **Dow Jones Industrial Average** slipped by 2.29 points (0.01%), closing at 40,111.21; the **S&P 500** decreased by 25.33 points (0.46%) to 5,499.87; and the **Nasdaq Composite** fell by 155.44 points (0.89%) to 17,227.50. While the Dow suffered losses, a ratings upgrade for Boeing managed to offset some declines.\n\nOverall, the situation remains volatile as markets await significant corporate earnings that could provide clearer insights into the impact of current tariffs and trade policies."
  },
  {
    "title": "Sebi slams spoofing scam in 173 stocks, orders Rs 3.22 crore seizure from Patel Wealth Advisors, directors",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-slams-spoofing-scam-in-173-stocks-orders-rs-3-22-crore-seizure-from-patel-wealth-advisors-directors/articleshow/120699213.cms",
    "summary": "The **Securities and Exchange Board of India (Sebi)** has taken decisive action against **Patel Wealth Advisors Private Limited** (PWAPL) and its directors for their involvement in **order spoofing**, a manipulative trading practice. The regulatory body has mandated the impounding of **INR 3.22 crore** from PWAPL for alleged unlawful gains accrued through this practice across **173 different scrips** over **292 contract days**. \n\n**Key Details:**\n• **Order Summary:** Sebi's interim order includes a ban preventing PWAPL and its four directors from accessing the securities markets. \n• **Allegations:** The company engaged in activities characterized as order spoofing, which entails placing orders with the intent to cancel them before execution while executing opposite trades.\n• **Duration of Activities:** The questionable trading practices spanned from **January 1, 2022** to **January 31, 2025**, continuing despite several warnings and actions from the National Stock Exchange (NSE).\n• **Consequences:** The directors of PWAPL are required to deposit the impounded amount into a fixed deposit account, which cannot be accessed without Sebi's approval. \n\nThis stringent regulatory response underscores Sebi's commitment to maintaining market integrity and protecting unwary investors from manipulative trading behaviors that distort market prices and undermine overall market efficiency."
  },
  {
    "title": "TVS Motor Company consolidated PAT jumps 67% to ₹648 crore",
    "url": "https://www.thehindu.com/business/tvs-motor-company-consolidated-pat-jumps-67-to-648-crore/article69501457.ece",
    "summary": "TVS Motor Company has reported significant growth in its financial performance for the fourth quarter ending March 31, 2025. The consolidated net profit surged by **67%**, reaching **₹648 crore**, compared to **₹387 crore** in the corresponding quarter from the previous year. Key highlights include:\n\n• **Consolidated Revenue Growth:** The company also noted a **17% increase** in consolidated revenue from operations, amounting to **₹11,542 crore**.\n\n• **Annual Performance:** For the fiscal year 2025, TVS Motor Company recorded a consolidated net profit of **₹2,236 crore**, which marks a **33% rise** year-on-year, with annual revenue growing by **14%** to **₹44,089 crore**.\n\n• **Standalone Figures:** On a standalone basis, TVS reported a **76% increase** in net profit for the quarter, totaling **₹852 crore**, supported by enhanced other income, reduced interest costs, and favorable tax benefits. Standalone revenue achieved **₹9,550 crore**, reflecting a **17% growth** YoY.\n\n• **Sales Performance:** The overall sales of two and three-wheelers for the year rose by **13%**, totaling **47.44 lakh units** against **41.91 lakh units** previously. Notable sales include:\n  - Motorcycles: Increased by **10%** to **21.95 lakh units**.\n  - Scooters: Grew by **21%**, amounting to **19.04 lakh units**.\n  - Electric vehicles: Showed a significant **44% growth**, with sales reaching **2.79 lakh units**.\n\n• **Quarterly Sales Data:** The company saw overall two-wheeler and three-wheeler sales, including exports, rise by **14%** to **12.16 lakh units** in Q4, with electric vehicle sales increasing by **54%** to **0.76 lakh units**.\n\nThis financial performance illustrates TVS Motor Company's robust growth trajectory amid a favorable market environment, driven by increased demand for its products, particularly in the electric and standard vehicles segment."
  },
  {
    "title": "These 5 stocks with increase in institutional shareholding in March quarter",
    "url": "https://economictimes.indiatimes.com/markets/web-stories/these-5-stocks-with-increase-in-institutional-shareholding-in-march-quarter/slideshow/120699010.cms",
    "summary": "The data provided outlines tracking configurations and insights on institutional shareholding for specific companies for the March 2025 quarter. \n\n**Tracking Configuration:**\n\n- **Google Analytics:**\n  - **gtag_id:** UA-198011-5\n  - **Third-party Events:** Multiple triggers setup for events such as pageviews, story completions, and link clicks for user interaction tracking.\n  - **GA4 Measurement:** G-WZ3Z4GGVRC\n  - **Page Loaded Events:** Configured to capture detailed page metrics, including authorship, publication date, keywords, and URLs.\n\n**Insights on Institutional Shareholding:**\n\n- An increase in institutional shareholding indicates a positive trend, reflecting greater confidence in the companies’ prospects among large investors like mutual funds and foreign institutional investors (FIIs).\n- Key companies with noted increases in institutional shareholding for the March 2025 quarter include:\n  • **AWL Agri Business:** Increased from 1.21% to 13.22%.\n  • **Aptus Value Housing Finance:** Increased from 31.54% to 37.62%.\n  • **JB Chemicals & Pharmaceuticals:** Increased from 31.04% to 37.02%.\n  • **Sammaan Capital:** Increased from 25.83% to 30.56%.\n  • **UCO Bank:** Increased from 1.35% to 5.8%.\n  \nThe increases suggest a trend towards more significant confidence in these companies' fundamentals, likely leading to improved governance and stock liquidity, vital for market stability."
  },
  {
    "title": "These 7 stocks hit 52-week high and rally up to 47% in a month",
    "url": "https://economictimes.indiatimes.com/markets/web-stories/these-7-stocks-hit-52-week-high-and-rally-up-to-47-in-a-month/slideshow/120698843.cms",
    "summary": "• On April 28, 2025, the benchmark *Sensex* experienced a significant surge, rising by 1,006 points to close at 80,218. This rally contributed to the achievement of 52-week highs for seven stocks within the BSE smallcap index, indicating strong market momentum.\n\n• The following smallcap stocks reached their new highs:\n  - **Paradeep Phosphates**: New 52-week high at **Rs 150.9**; Current Market Price (CMP) at **Rs 149.15**; a gain of approximately **47%** over the past month.\n  - **Manorama Industries**: New high at **Rs 1,339.15**; CMP at **Rs 1,296**; a gain of around **24%**.\n  - **Choice International**: New high at **Rs 638**; CMP at **Rs 621**; also gained **24%**.\n  - **Privi Speciality Chemicals**: New high at **Rs 2,031.4**; CMP at **Rs 1,982.8**, with a **16%** gain.\n  - **Anupam Rasayan India**: New high at **Rs 879**; CMP at **Rs 860.8**, gaining **14%**.\n  - **Prataap Snacks**: New high at **Rs 1,295.45**; CMP at **Rs 1,228.3**, with a **13%** gain.\n  - **Krishna Institute of Medical Sciences**: New high at **Rs 707.5**; CMP at **Rs 672**, gaining **5%**.\n\n• The significance of reaching a 52-week high is essential for traders and investors as it may indicate robust growth potential for these securities.\n\n• The segment concludes with a reference to upcoming market discussions about additional stocks that influenced market movements, emphasizing the dynamic nature of the stock market on that day."
  },
  {
    "title": "Embassy Office Parks REIT Approves Rs 675 Crore Commercial Paper Allotment",
    "url": "https://www.ndtvprofit.com/business/embassy-office-parks-reit-approves-rs-675-crore-commercial-paper-allotment",
    "summary": "Embassy Office Parks REIT has successfully secured approval from its board of directors' debenture committee for the allotment of commercial papers amounting to *Rs 675 crore*. A yield of *7.075%* is expected on these papers, which will be listed on the *Wholesale Debt Market Segment of BSE Ltd*. The company intends to utilize these funds as short-term debt to refinance existing borrowings and support working capital requirements. This issuance encapsulates the firm's strategy to streamline its financial obligations amidst positive sentiment in the real estate sector. \n\nThe broader context reveals a growing demand for affordable housing in *Mumbai*, driven by infrastructural projects such as the *Atal Setu Seabridge* and the *Navi Mumbai International Airport*. This demand is likely to enhance market dynamics in regions like *Ulwe*, *Chirle*, *Karanjade*, and *Panvel*. \n\n*Embassy Office Parks REIT*, renowned as India's first publicly listed real estate investment trust, boasts an extensive portfolio of 14 office parks across major cities like *Bengaluru*, *Mumbai*, *Pune*, the *National Capital Region*, and *Chennai*, amassing a total operational area of *51.1 million square feet*, with *38.9 million square feet* designated as completed and operational.\n\nIn terms of stock performance, *Embassy Office Parks REIT Ltd.* witnessed its shares close at *Rs 381.91*, reflecting a 0.62% increase, which aligns with a general uptick in the *Nifty* benchmark of 1.2%. Over the last year, the stock registered a rise of *7.33%*, indicating a strong buy outlook among analysts, with a potential return rate of *10.2%* as per *Bloomberg* insights. \n\nThis strategic financial maneuvering, coupled with favorable market conditions, positions Embassy Office Parks REIT favorably in the competitive landscape of real estate investment."
  },
  {
    "title": "Sensex soars over 1,000 points!: Top 5 factors",
    "url": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/sensex-soars-over-1000-points-top-5-factors/podcast/120698652.cms",
    "summary": "Indian benchmark indices experienced a significant surge on April 28, 2025, with the BSE Sensex rising by 1.27%, equivalent to approximately 1,000 points, while the Nifty50 closed above the 24,300 mark. The following factors contributed to this robust market performance:\n\n• **Reliance Industries' Q4 Results**: Reliance reported better-than-expected quarterly results, leading to a substantial 5.3% increase in its shares, which contributed around 400 points to the Sensex. JP Morgan's insights suggested that the stock's attractive valuation could lead to further price increases.\n\n• **Foreign Institutional Investment (FIIs)**: There was a continual influx of foreign investment, with FIIs purchasing approximately Rs 32,465 crore over the previous eight days. This trend indicates a preference for Indian markets amidst underperformance in the US.\n\n• **Weakening US Dollar**: The US dollar index fell from 109.88 to 99.60, positively impacting emerging markets and supporting sectors like metals which, in turn, enhanced investor sentiment.\n\n• **Declining Oil Prices**: The price of crude oil dropped below $66 per barrel. This decrease alleviated inflation concerns, providing significant relief to India as a major oil consumer.\n\n• **Global Market Trends**: Indian markets followed a positive trajectory seen in global indices, bolstered by favorable trends from Asia, Europe, and discussions in US trade talks.\n\nThese factors collectively explain the pronounced upward movement in the Indian stock market, underscoring a optimistic economic outlook."
  },
  {
    "title": "Breakout Stocks: How to trade Anupam Rasayan, UltraTech Cement & Krishna Institute that hit fresh 52-week high?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-anupam-rasayan-ultratech-cement-amp-krishna-institute-that-hit-fresh-52-week-high/slideshow/120698328.cms",
    "summary": "The Indian stock market exhibited positive momentum, with the BSE Sensex rising over 1,000 points and the Nifty50 closing above the 24,300 mark, reflecting gains exceeding 1% on a Monday influenced by favorable global signals. Sector-wise, there was notable buying activity in the metals, healthcare, automotive, and oil & gas sectors, while the IT sector experienced selling pressure.\n\n**Key Breakout Stocks:**\n• **Anupam Rasayan:** Currently trading at ₹859, the stock has undergone corrections for nearly two years but recently indicated a potential trendline breakout. Analysts suggest that if it sustains above current levels, an upside of approximately 18-20% may be achievable, supported by strong trading volumes and a bullish RSI indicator.\n  \n• **UltraTech Cement:** Priced at ₹12,128, UltraTech has been consolidating for about a year and successfully closed above the consolidation zone last week. Despite facing selling pressure, if it maintains stability in the ₹12,000-12,150 range, it could see an increase of around 15-18%. The RSI remains in a strongly bullish position.\n\n• **Krishna Institute:** This stock is also experiencing significant price movement, having closed above its previous resistance level of ₹670. Analysts notice an Inverted Head & Shoulders pattern, which suggests potential upward movement of 18-20% if it holds steady.\n\n**Market Insights:**\n- Investor sentiment appears optimistic, influenced by global trends.\n- Critical support levels are essential for sustaining upward trajectories in breakout stocks.\n  \nThese insights render a comprehensive perspective on current market dynamics, specifically highlighting key stocks to monitor for potential gains."
  },
  {
    "title": "CP Gurnani's AIonOS, Perpetuuiti Form Joint Venture To Launch AI Business Continuity Agents",
    "url": "https://www.ndtvprofit.com/business/cp-gurnanis-aionos-perpetuuiti-form-joint-venture-to-launch-ai-business-continuity-agents",
    "summary": "• **Joint Venture Formation:** CP Gurnani's AIonOS has partnered with Singapore-based Perpetuuiti to establish a joint venture focused on creating AI-driven business continuity solutions.\n\n• **Targeted Revenue:** The venture aims to achieve revenue between **$5 million to $8 million** in its first year by integrating AI capabilities into Perpetuuiti’s existing enterprise resilience offerings.\n\n• **Innovative Product Development:** The collaboration will produce the world's first certified **Business Continuity Management (BCM) AI Agent**. This innovative technology is designed to assist organizations in anticipating disruptions, autonomously responding to incidents, and restoring critical operations effectively.\n\n• **Establishment of New Unit:** A dedicated **AI-led Resiliency and Cybersecurity Unit** will be launched to further develop these solutions, enhancing operational resilience as cyber threats increase.\n\n• **Market Approach:** Initially, the focus will be on Perpetuuiti’s established customer base of **400 clients**, with plans to expand into industries such as travel, tourism, hospitality, logistics, and telecommunications.\n\n• **Industry Context:** Gurnani highlighted notable incidents that underline the need for advanced automated resilience, citing disruptions experienced by major companies, including Delta Airlines and the UK's NHS.\n\n• **Broader AI Landscape Remarks:** He also commented on India's quickly evolving **Large Language Model market**, indicating ongoing adaptations and integrations with various models based on customer needs.\n\n• **Perpetuuiti Background:** Founded in **2011**, Perpetuuiti is well-regarded for its IT resilience solutions and holds a prominent market position, serving nine of the top 10 Indian listed firms.\n\nThis joint effort signals a significant step towards enhancing cyber resilience in the business sector by leveraging AI technologies."
  },
  {
    "title": "Trent Q4 Preview: Up to 29% YoY rise in revenue expected. Margins could see contraction",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-q4-preview-up-to-29-yoy-rise-in-revenue-expected-margins-could-see-contraction/articleshow/120697727.cms",
    "summary": "Tata Group's Trent is anticipated to announce its Q4 FY2025 earnings, projecting a net profit ranging from **Rs 244 crore to Rs 462 crore**, indicating potential fluctuations in Profit After Tax (PAT). The company is expected to report a **29% revenue growth**, with operational revenues estimated between **Rs 4,079 crore and Rs 4,274 crore**. \n\nKey forecasts from various brokerages include:\n\n• **Nuvama Institutional Equities** predicts a conservative PAT of **Rs 244 crore**, reflecting a **63% YoY drop** due to increased market competition, while suggesting revenues could reach **Rs 4,092 crore**, a **28.4% YoY growth**.\n\n• **Axis Securities** expects a PAT of **Rs 267 crore**, highlighting profitability pressures despite an **expected 28% revenue growth YoY**, indicating a decline in margins.\n\n• **Mirae Asset Sharekhan** forecasts a slightly lower PAT of **Rs 272 crore**, alongside projected revenues of **Rs 4,079 crore**, showing a **28% increase** compared to the previous year.\n\n• **Equirus Securities** offers the most optimistic projection with a PAT of **Rs 462 crore**, showcasing a **35% YoY growth**, and revenues estimated at **Rs 4,274 crore** alongside a promising EBITDA contribution of **Rs 786 crore**.\n\nDespite these promising revenue figures, trends indicate margin pressures primarily attributed to product mix changes and an extended End-of-Season Sale (EOSS). The company successfully added **140 stores** in Q4, meeting its expansion targets while facing challenges in maintaining profit margins.\n\nOverall, while Trent demonstrates healthy revenue growth fueled by store expansion, fluctuations in profit and margins merit close attention from investors, especially with the festive season approaching. Key drivers for growth will include demand patterns observed in metro and tier-2/3 towns and ongoing store expansion strategies."
  },
  {
    "title": "Share market update: Most active stocks in today's market in terms of volume",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/share-market-update-most-active-stocks-in-todays-market-in-terms-of-volume/articleshow/120697139.cms",
    "summary": "The **Indian stock market** demonstrated a notable positive performance as indicated by recent trading activities. The **NSE Nifty index** closed up by **289.16 points**, reaching a total of **24,328.5**, while the **BSE Sensex** experienced a larger increase of **1,005.84 points**, finishing at **80,218.37**.\n\nKey **active stocks in terms of trading volume** include:\n\n• **Mirch Technologies** - 4.95 crore shares traded  \n• **Vodafone Idea** - 4.58 crore shares traded  \n• **Standard Cap** - 3.14 crore shares traded  \n• **Canara Bank** - 1.93 crore shares traded  \n• **Spicejet** - 1.65 crore shares traded  \n• **G G Engineering** - 1.47 crore shares traded  \n• **GTL Infra** - 1.33 crore shares traded  \n• **Sharanam Infra** - 0.94 crore shares traded  \n• **YES Bank** - 0.92 crore shares traded  \n• **Kesoram Industries** - 0.90 crore shares traded  \n\nConversely, the following stocks were among the **top losers** for the day:\n\n• **Shriram Finance Ltd.** - down **5.07%**  \n• **HCL Technologies Ltd.** - down **1.84%**  \n• **UltraTech Cement Ltd.** - down **1.01%**  \n• **Eternal Ltd.** - down **0.70%**  \n• **Hindustan Unilever Ltd.** - down **0.59%**  \n\nThis trading day reflected a significant upward momentum in the market, highlighting a robust interest in several stocks, with key investors likely focusing on high-volume trades as well as the performance of major indices."
  },
  {
    "title": "Sensex jumps 1,006 points; Nifty tops 24,300 level on buying in Reliance, foreign fund inflows",
    "url": "https://www.thehindu.com/business/markets/sensex-jumps-1006-points-nifty-tops-24300-level-on-buying-in-reliance-foreign-fund-inflows/article69501034.ece",
    "summary": "The Indian stock market experienced a significant surge on April 28, 2025, notably driven by substantial gains in Reliance Industries and robust foreign fund inflows. \n\n• **Market Overview**: The BSE Sensex skyrocketed by **1,006 points**, concluding at **80,218.37**, marking a **1.27%** increase. Throughout the trading session, it peaked at **80,321.88**.\n• **Performance**: Out of 30 shares, **23** recorded gains, while **7** declined. The Nifty index also rose by **289.15 points**, ending at **24,328.50**.\n• **Key Players**: Reliance Industries was the standout performer, rising **5.27%** after reporting a **2.4%** increase in net profit for the March quarter, surpassing expectations.\n• **Other Notable Stocks**:\n  - **Mahindra & Mahindra** saw a notable increase of **2.29%** due to a strategic acquisition.\n  - Major laggards included **HCL Tech, UltraTech Cement, Nestle, and Hindustan Unilever**.\n• **Foreign Investments**: Foreign Institutional Investors (FIIs) infused **₹17,425 crore** into Indian equities in the preceding week, buoyed by favorable global conditions and strong domestic fundamentals.\n• **Market Dynamics**: The rally follows a brief decline attributed to geopolitical tensions along the India-Pakistan border. Experts indicated that improved performance from Reliance and sustained foreign buying positively impacted investor confidence.\n\nOverall, the market's performance reflects recovery from previous losses and a favorable outlook stemming from positive economic indicators and corporate earnings."
  },
  {
    "title": "'Gold isn’t just about returns': Naveen Mathur of Anand Rathi explains how to invest in 2025",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/gold-isnt-just-about-returns-naveen-mathur-of-anand-rathi-explains-how-to-invest-in-2025/slideshow/120696360.cms",
    "summary": "Gold has emerged as a significant asset in the current investment climate, with its value increasing substantially amidst global economic uncertainties. Notably, in 2025, gold prices rose by over 27%, primarily driven by factors such as geopolitical tensions, inflation concerns, and shifts in currency values. The asset acts as a protective measure against financial instability, evidenced by its performance during periods of market volatility, such as the Russia-Ukraine conflict and U.S.-China trade challenges.\n\n**Key Insights on Gold Investment:**\n\n• **Role of Gold as a Safe-Haven Asset:** Gold is traditionally regarded as a safe-haven investment, gaining value when stock markets decline. It serves as a hedge against inflation and currency devaluation.\n\n• **Recent Performance:** In the past year, gold's returns ranged from 20% in India to about 23-24% globally, aided by central bank purchases and heightened retail investments in gold ETFs.\n\n• **Investment Strategy:** Naveen Mathur of Anand Rathi Wealth indicates that gold should be viewed not simply for returns, but as a risk mitigation strategy. He suggests that investors should consider entering the gold market steadily, emphasizing that there's no wrong time to invest in this commodity.\n\n• **Recommended Allocation:** A portfolio allocation of 12-15% to gold is considered effective for diversification, while exceeding 25% may not be advisable.\n\n• **Methods of Investment:** Investors can choose to invest in gold through various avenues, such as Gold ETFs, Fund of Funds, or physical gold; however, physical gold entails additional storage costs.\n\n• **Market Outlook:** Short- to medium-term trends appear bullish, although volatility necessitates a cautious approach. Future corrections in gold prices could arise if geopolitical tensions ease or if there are favorable developments in trade negotiations.\n\nIn summary, while investing in gold can yield significant returns, its primary value lies in its capacity to safeguard investments during turbulent economic times. A thoughtful and measured approach is crucial for those considering gold as part of their investment portfolio."
  },
  {
    "title": "Sneha Seth picks 2 stocks to go long on in this market",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/sneha-seth-picks-2-stocks-to-go-long-on-in-this-market/articleshow/120693745.cms",
    "summary": "Angel One's Derivatives Analyst, *Sneha Seth*, proposes a *bullish outlook* for the current market, particularly recommending **long positions** in **Punjab National Bank (PNB)** and **Tata Power**. The following points summarize her analysis:\n\n• **Punjab National Bank (PNB):**\n  - Target price range: *Rs 105 to Rs 109*.\n  - Suggested stop loss: *Rs 98.5*.\n  - PNB displays a strong chart structure indicating possible upward movement, supported by a higher top and bottom formation.\n\n• **Tata Power:**\n  - Target price: *Rs 410 to Rs 415*.\n  - Suggested stop loss: *Rs 392*.\n  - The stock shows strength by surpassing previous resistance and is poised for an upswing.\n\n• **Market Observations:**\n  - The **Nifty index** has shown resilience by closing above *24,000*, despite some profit-taking. Current support levels are seen between *23,800 to 24,000*, while resistance is noted at approximately *24,350 to 24,400*.\n  - **Nifty Bank** also demonstrates positive sentiment with increasing open interest, suggesting robustness in the banking sector overall. The **support zone** is identified at *54,400 to 54,500*, with a resistance level around *56,200*.\n  \n• **Sector Performances:**\n  - Sneha indicates a favorable stance towards the *pharmaceutical* sector and *PSU banks*, given their recent performance and potential for further growth.\n\nSeth encourages traders to utilize any dips for potential long opportunities while being cautious of possible consolidations in the market shortly."
  },
  {
    "title": "UltraTech Cement board announces Rs 77.50 per share final dividend",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-board-announces-rs-77-50-per-share-final-dividend/articleshow/120695748.cms",
    "summary": "UltraTech Cement has announced a final dividend of **Rs 77.50 per share**, representing a **775%** dividend on its equity share of face value **Rs 10**. This declaration was made during a board meeting that coincided with the firm's **Q4 FY25** results. The company's financial performance showed a **10% year-on-year (YoY)** growth in consolidated net profit, reaching **Rs 2,482 crore**, while total revenues increased by **13% YoY**, amounting to **Rs 23,063 crore**.\n\nKey highlights from the earnings report include:\n\n• **Revenue Growth:** \n  - **Consolidated revenues:** Rs 22,788 crore (up 14% YoY).\n  - **Grey Cement (Domestic Business):** Rs 18,347 crore, a rise of 7% compared to the previous year.\n  - **ReadyMix Concrete segment:** Revenue of Rs 1,819 crore, marking a 17% growth.\n  - **Overseas business:** Significant revenue surge of 38%, totalling **Rs 933 crore**.\n\n• **Dividend Taxation:** The dividend will be subjected to the applicable tax rates as per the provisions of the Finance Act, 2020.\n\n• **Dividend History:** Over the last **12 months**, the company has consistently provided an equity dividend of **Rs 70 per share**, with the current share price in consideration yielding a dividend rate of **0.58%**.\n\nThis strong financial showing underscores UltraTech Cement's robust operational performance, especially in segments such as **ReadyMix Concrete** and its international operations, indicating a positive outlook for the company within the cement industry."
  },
  {
    "title": "Buoyant equities help boost rupee, technical resistance limits gains",
    "url": "https://economictimes.indiatimes.com/markets/forex/forex-news/buoyant-equities-help-boost-rupee-technical-resistance-limits-gains/articleshow/120695298.cms",
    "summary": "The Indian rupee experienced a significant improvement, marking its best performance in over two weeks, primarily driven by anticipated capital inflows into local equities. On a trading day, the rupee reached a high of 84.98 against the U.S. dollar before settling at 85.03, up by nearly 0.5%. This positive outcome coincided with benchmark equity indices, the BSE Sensex and Nifty 50, both rising approximately 1.2%. A substantial contributor to this gain was Reliance Industries, which surged over 5% following a quarterly earnings report that surpassed analyst expectations.\n\nKey factors impacting the rupee include:\n• Increased foreign investment in Indian stocks, reversing previous selling trends.\n• Positive sentiment towards domestic equities, contributing to overall market bullishness.\n• Technical resistance near the 200-day moving average around 84.97-84.98, posing a challenge for further appreciation.\n• The rupee has risen by 0.6% for the month so far, aided by the liquidation of long positions on the USD/INR pair and easing of regional geopolitical tensions.\n\nLooking ahead, analysts are monitoring forthcoming U.S. economic data, including personal consumption expenditure (PCE) inflation and non-farm payrolls, as potential catalysts for the dollar's performance. Any unexpected negative indicators in the U.S. economy could lead to renewed selling pressure on the dollar."
  },
  {
    "title": "U.S. tariff hike can slash Indian auto component exporters’ earnings by up to Rs 4,500 crore, ICRA warns",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/u-s-tariff-hike-can-slash-indian-auto-component-exporters-earnings-by-up-to-rs-4500-crore-icra-warns/articleshow/120693789.cms",
    "summary": "Indian auto component exporters face significant earnings reductions due to new U.S. tariffs, as estimated by ICRA. The increase in tariffs, effective from May 2025, is projected to cost the industry between Rs 2,700 crore and Rs 4,500 crore, negatively impacting profits, particularly for exporters. Key findings include:\n\n• **Impact on Operating Margins:** The tariffs will likely decrease operating margins by 50 to 100 basis points in FY2026, with the overall auto components sector potentially experiencing a 3-6% decline in operating profits.\n\n• **Earnings Losses:** Exporters may see earnings down by 10-15%, while those with U.S.-based operations could be shielded from tariffs.\n\n• **Domestic Market Resilience:** Despite challenges in export markets, the domestic auto industry remains robust, with over 70% of revenue coming from local sales. Companies like Mahindra & Mahindra and Samvardhana Motherson are well positioned due to strong product portfolios and global diversification.\n\n• **Adjusted Growth Expectations:** ICRA revised revenue growth for the auto component sector in FY2026 from 8-10% to 6-8%, primarily due to anticipated declines in U.S. export revenues.\n\n• **Mixed Effects on Auto Ancillaries:** While higher tariffs will exert pressure on margins, the liquidity and debt profiles for many exporters remain stable, which differs from the broader challenges of subdued growth and rising global competition, especially from China.\n\n• **Market Opportunities:** ICRA suggests that amid immediate tariff impacts, medium-term opportunities could arise for Indian exporters in the U.S. market as they may capture market share from competitors affected by the tariffs.\n\nThe overall sentiment for the automotive sector in FY25 is bearish, yet companies including TVS Motor and Eicher Motors have shown resilience against the backdrop of broader market uncertainty."
  },
  {
    "title": "Brace For 5-6% Earnings Cuts, Says Nomura’s Saion Mukherjee;  Favours Domestic Plays Over Banks",
    "url": "https://www.ndtvprofit.com/business/brace-for-5-6-earnings-cuts-says-nomuras-saion-mukherjee-favours-domestic-plays-over-banks",
    "summary": "Nomura has issued a warning regarding the outlook for corporate earnings in India, projecting potential downgrades of 5-6% for the upcoming year. This forecast aligns with the expectation that earnings growth will generally track with nominal GDP growth, estimated to be around 10% in the financial year 2025. Saion Mukherjee, Nomura’s India Equity Strategist, cautioned that recent optimism concerning earnings momentum may be overstated, citing \"misplaced earnings growth optimism.\"\n\n### Key Insights:\n• **Earnings Outlook**: Nomura forecasts cuts in earnings projections for Indian corporations, specifically for the Nifty50 index. They see limited upside potentials in stock prices (6-7% increase) and note heightened global volatility as a concerning factor. \n\n• **Investment Strategy**: Nomura is adopting a defensive investment approach, emphasizing sectors with robust domestic demand and stable earnings. The firm is particularly favorable towards consumption-driven sectors, like automobiles, rather than export-facing sectors such as IT and global cyclicals.\n\n• **Market Sentiment**: Despite foreign portfolio investors' continued interest in Indian equities, Mukherjee pointed out that this trend is susceptible to fluctuations in global sentiment and the strength of the U.S. dollar, urging investors to remain cautious amid ongoing external risks.\n\n• **Banking Sector Analysis**: Within the banking, financial services, and insurance sectors, Nomura anticipates steady credit growth but limited room for positive earnings surprises, making banks less appealing in the current environment.\n\n### Recommendations for Investors:\n• Focus on high-quality companies with strong domestic fundamentals.\n• Moderate expectations for returns and prepare for increasing market volatility.\n• Closely monitor external economic indicators and global developments, which could influence investor confidence and market dynamics. \n\nIn summary, while there are positive growth trends expected in alignment with GDP, the caution advised by Nomura points to potential challenges in the corporate earnings landscape, warranting a strategic and defensive investment approach."
  },
  {
    "title": "Commodity Radar: Expect gold prices to soften ahead of Akshaya Tritiya. Buy on dips, recommends Jateen Trivedi",
    "url": "https://economictimes.indiatimes.com/markets/commodities/commodity-radar-expect-gold-prices-to-soften-ahead-of-akshaya-tritiya-buy-on-dips-recommends-jateen-trivedi/articleshow/120693274.cms",
    "summary": "Gold prices have recently faced a decline after reaching an all-time high of Rs 99,358 per 10 grams. Currently, the June futures contract on the Multi Commodity Exchange (MCX) is priced at Rs 94,484, representing a 5% drop, or Rs 4,800, ahead of the auspicious day of Akshaya Tritiya. This decline can be attributed to easing trade tensions between the US and China, alongside a strengthening US dollar.\n\n**Technical Analysis:**\n- **Resistance Levels:** Rs 97,800 – Rs 98,200\n- **Support Levels:** Near Rs 93,000, with stronger support around Rs 91,000.\n- There are signs indicating that the momentum of the rally is cooling, as the Relative Strength Index (RSI) has retreated to 65 from previously overbought levels near 75, which may signal a potential reversal in trend for bullish traders.\n\n**Market Sentiment:**\n- Analysts predict a range-bound consolidation phase for gold prices, with the possibility of further corrections if certain price thresholds are breached. \n- Significant market-moving data, such as the US consumer confidence index, GDP figures, and employment reports, are anticipated and will likely affect gold’s trajectory.\n\n**Global Factors:**\n- The interplay of tariffs between the US and China continues to impact market sentiment and pricing for gold.\n- The dollar index has observed significant growth, which inversely affects gold prices.\n\nIn conclusion, the current market strategy suggested by analysts is to consider a *buy-on-dips* strategy as long as gold prices remain above Rs 93,000, while staying vigilant of market shifts and fundamentals that might alter this outlook."
  },
  {
    "title": "IRFC Q4 Results: PAT declines 2% YoY at Rs 1,682 cr, revenue surges 4%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/irfc-q4-results-pat-declines-2-yoy-at-rs-1682-cr-revenue-surges-4/articleshow/120693144.cms",
    "summary": "The Indian Railway Finance Corporation (IRFC) has released its fourth quarter results for the financial year 2025. Key highlights from the earnings report include:\n\n• **Net Profit Decline:** The net profit for Q4 2025 stood at **Rs 1,682 crore**, reflecting a **2.1% decrease** year-on-year (YoY) from **Rs 1,717.32 crore** in the previous year.\n\n• **Revenue Growth:** Despite the profit decline, the company's revenue from operations rose by **3.8%** to **Rs 6,722.83 crore**, up from **Rs 6,477.99 crore** in the same quarter last year.\n\n• **Increase in Expenses:** Operating expenses increased by approximately **6% YoY**, amounting to **Rs 4,760.67 crore**.\n\n• **Provisions Rise:** The provisions for the quarter increased to **Rs 3.38 crore**, up from **Rs 0.46 crore** in the previous quarter.\n\n• **Fundraising Plans:** The board approved an extensive fundraising plan, intending to raise **up to Rs 60,000 crore** during the financial year 2025-26 through varied instruments such as tax-free bonds and loans from financial institutions. This fundraising will support refinancing, new business activities, and corporate purposes.\n\n• **Navratna Status:** In a notable development, IRFC achieved **Navratna status**, which is a recognition granted by the Government of India to enhance operational autonomy. \n\n• **Market Reaction:** Following the earnings report, IRFC's share price experienced a **1% drop**, trading at **Rs 127.30** on the Bombay Stock Exchange (BSE).\n\nOver the last year, IRFC's shares have witnessed a **19.52% decline**, with year-to-date falls of **15.37%**, indicating a challenging market environment. However, in the past month, the stock regained some momentum, showing a modest **2.29% gain**. \n\nOverall, while the IRFC continues to see revenue growth, the decline in net profit alongside rising expenses highlights the financial pressures the company faces as it moves forward with its plans for expansion and investment in infrastructure for Indian Railways."
  },
  {
    "title": "Mahindra Lifespace Q4 Results: Sale bookings down 3% to Rs 1,055 cr; FY25 sales up 20%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-lifespace-q4-results-sale-bookings-down-3-to-rs-1055-cr-fy25-sales-up-20/articleshow/120692981.cms",
    "summary": "In the latest report, Mahindra Lifespaces Developers Ltd has announced its financial results for the fourth quarter of FY 2024-25, revealing a **3% decrease in sale bookings** in the residential segment, amounting to **Rs 1,055 crore**. This represents a decline from **Rs 1,086 crore** recorded in the same quarter of the previous fiscal year. However, the company's total pre-sales for the financial year increased to **Rs 2,804 crore**, a substantial rise of **20%** compared to **Rs 2,328 crore** in FY 2023-24.\n\nKey financial metrics from the report include:\n\n• **Net Profit**: Increased by **19%** to **Rs 85.09 crore** for Q4 FY 2024-25, up from **Rs 71.48 crore** in the corresponding period last year.  \n• **Total Income**: Slightly improved to **Rs 55.44 crore**, compared to **Rs 54.60 crore** in the previous year's quarter.  \n• **Full Year Performance**: For the entire fiscal year, net profit decreased to **Rs 60.94 crore**, down from **Rs 97.95 crore** the prior year, despite total income rising to **Rs 463.87 crore** from **Rs 279.12 crore** year-on-year.\n\nMahindra Lifespace, established in 1994, is recognized as one of India’s major real estate developers, with a development footprint covering **41.11 million square feet** across seven cities. Additionally, the company has over **5,000 acres** designated for ongoing and upcoming projects under its industrial clusters and integrated developments.\n\nOverall, while the reduction in quarterly sales bookings may raise concerns, the significant increase in pre-sales for the fiscal year indicates a positive momentum in the company's business activities going forward."
  },
  {
    "title": "Stocks to Buy | Spotting Value: Dinshaw Irani  on sectors with strong potential for solid returns",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-spotting-value-dinshaw-irani-on-sectors-with-strong-potential-for-solid-returns/slideshow/120693273.cms",
    "summary": "• **Market Overview**: Market expert Dinshaw Irani highlighted a resurgence of Foreign Institutional Investors (FIIs) in the Indian market, with significant inflows estimated at *$3.5–4 billion* over the past fortnight. This indicates a shift from passive ETF flows to more active market participation, which is perceived as a positive development for market health. However, Irani remains vigilant due to high valuations and concerns raised by current earnings reports, which show profitability cuts across diverse sectors.\n\n• **Investment Approach**: Despite being fully invested, Irani maintains a cautious strategy, holding a net exposure of *61-62%* in long-short strategies. This conservative stance reflects the ongoing earnings weakness and concerns regarding market valuation sustainability.\n\n• **Geopolitical Risks**: Irani acknowledges the geopolitical tensions between India and Pakistan but expresses confidence in the resilience of the Indian markets. He notes that while midcaps and smallcaps have faced challenges, largecap stocks continue to perform robustly.\n\n• **Sectoral Insights**:\n  - **BFSI Sector**: Irani identifies potential in the Banking, Financial Services, and Insurance (BFSI) sector, which has exhibited strong performance recently.\n  - **Hospitality and Healthcare**: The hospitality and healthcare sectors are also viewed positively due to strong year-on-year growth, particularly in hotels and hospitals.\n  - **Power Sector**: Irani is optimistic about the power sector, driven by increased electricity demand, especially during heatwaves. However, he notes a scarcity of attractive stock options in this area.\n\n• **Investment Strategy**: For the upcoming 90 days, Irani advises caution, recommending that investors conserve capital and refrain from entering new positions. He predicts that while there have been improvements in tariff concerns from the US, a comprehensive recovery in markets might only be realized by December.\n\n• **Banking Sector Outlook**: Irani assesses that despite the recent rallies in banking stocks, they are not overvalued. He observes that recent FII investments have favored banking stocks previously sold off, which could bode well for future performance as liquidity improves under new regulatory leadership. \n\nThis comprehensive analysis underscores the interplay between market recovery, sectoral performance, and cautious investment strategies amidst prevailing economic uncertainties."
  }
]