[
  {
    "title": "Ather Energy Has A Margin Lever Against Waning Subsidy, In Quest For Profitability",
    "url": "https://www.ndtvprofit.com/auto/ather-energy-has-a-margin-lever-against-waning-subsidy-in-quest-for-profitability",
    "summary": "Ather Energy Ltd. is effectively navigating the challenges posed by decreasing subsidies, positioning itself for long-term profitability within the electric two-wheeler market. Leveraging innovative strategies, Ather has introduced the ‘Ather Propack,’ a software add-on which accounts for 6% of its revenue with impressive EBITDA margins of 53-56%. This initiative has contributed to an overall gross margin increase from 7% to 19% year-on-year, despite a dramatic 77% reduction in hardware subsidies.\n\nImportant insights regarding the Ather Propack include:\n\n• **Revenue Generation:** 86-89% of Ather's customers opt for this software upgrade, which enhances their riding experience via features such as traction control, hill-hold assist, over-the-air updates, and anti-theft alerts.\n\n• **Pricing Strategy:** Offered at a price range of Rs 13,000-20,000, the Propack is bundled with vehicle purchases as an opt-in.\n\n• **Strategic Advantage:** The software revenue opportunity serves as a robust hedge against declining hardware margins, significantly bolstering profitability per unit.\n\n• **Market Context:** Ather's proactive measures demonstrate foresightedness within a highly competitive and rapidly evolving EV market, ensuring sustainability and financial stability moving forward.\n\nThe data surrounding Ather’s performance is emphasized in their red-herring prospectus, hinting at positive investor sentiment as the company prepares for its Initial Public Offering (IPO). Overall, Ather Energy is set to remain a pivotal player in the industry's transition to a subsidy-less era, underpinned by its proactive approach and expanding software solutions."
  },
  {
    "title": "From campus to stock market: How IIT Madras' bet on Ather Energy turned into a Rs 50 crore profit",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/from-campus-to-stock-market-how-iit-madras-bet-on-ather-energy-turned-into-a-rs-50-crore-profit/articleshow/120614305.cms",
    "summary": "Ather Energy's upcoming IPO on April 28, 2025, represents a significant achievement for both the company and Indian Institute of Technology (IIT) Madras, which initially backed the electric scooter manufacturer. IIT Madras is poised to earn approximately Rs 50 crore from its investment, owning 15.58 lakh shares through its incubation arms. This investment was formalized with Ather Energy, which allocated 5% of its paid-up share capital in exchange for essential support, including office space and mentorship.\n\nKey financial details include:\n• **IPO Price Band:** Rs 321 per share.\n• **IIT's Planned Sell-off:** Under the Offer for Sale (OFS), IIT Madras intends to partially liquidate its holdings.\n  • IITM Incubation Cell will offload approximately 31,050 shares.\n  • IITM Rural Technology and Business Incubator will sell around 4,191 shares.\n\nOther significant stakeholders, such as Tiger Global, which invested in Ather in 2015, are also positioned to reap substantial profits from the IPO, with expectations of an 8.3-fold return on investment. Additionally, Caladium Investment and the National Investment and Infrastructure Fund (NIIF) anticipate attractive returns of 1.6x and 1.7x, respectively.\n\nAther Energy aims to raise around Rs 3,000 crore, marking one of the most anticipated IPOs of the year in India's burgeoning electric two-wheeler market. The company stands out for its innovative electric scooter features, which include a touchscreen dashboard with navigation, an aluminum chassis, and fast charging capabilities. Its product offerings target not only performance-oriented consumers but also families seeking practical urban mobility solutions.\n\nOverall, this IPO signifies the successful transition from academic support to substantial market presence, reaffirming IIT Madras's influential role in fostering innovative startups in India's evolving electric vehicle sector."
  },
  {
    "title": "China, Hong Kong stocks register second week of gains on tariff relief",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/china-hong-kong-stocks-register-second-week-of-gains-on-tariff-relief/articleshow/120614022.cms",
    "summary": "China and Hong Kong's stock markets have exhibited a notable positive trend, marking their second consecutive week of gains as of April 25, 2025. This upward movement has occurred amidst a softening of the trade conflict stance between the United States and China, providing investors with a sense of relief. Key indexes include:\n\n• **CSI300 Index**: Rose slightly by less than 0.1% at the close. \n• **Shanghai Composite Index**: Remained relatively unchanged.\n• **Hang Seng Index**: Increased by 0.3% in Hong Kong. \n\nThese gains for the week reached 2.7%, representing the best performance in nearly two months and culminating in all three indexes achieving their highest values since early April. This positive shift in the market can be attributed to various factors:\n\n• **Tariff Exemptions**: China has begun to provide exemptions on certain U.S. imports from its 125% tariff to mitigate economic impacts from the trade tensions.\n• **U.S. Trade Discussions**: U.S. President Donald Trump hinted at active trade talks, further easing investor anxieties.\n• **Support from the Chinese Government**: The Politburo announced plans to support businesses and workers adversely affected by U.S. tariffs while assuring measures to stabilize the economy.\n\nDespite this optimism, market participants are advised to maintain caution. Eugene Hsiao, a key strategist, emphasized a 'wait-and-see' approach due to recent market volatility. Tech segments have been particularly buoyant, with:\n\n• **CSI Artificial Intelligence Index**: Increased by 1%.\n• **Chip Sector**: Recovered from earlier losses, climbing by 0.2%.\n\nMarket strategists are currently adopting a diverse investment strategy, emphasizing a barbell approach that prioritizes technology and consumer staples, specifically favoring companies with robust pricing power and resilience against tariff-related challenges."
  },
  {
    "title": "Bitcoin is digital equivalent of gold, showing signs of decoupling from Nasdaq: Jefferies' Chris Wood",
    "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/bitcoin-is-digital-equivalent-of-gold-showing-signs-of-decoupling-from-nasdaq-jefferies-chris-wood/articleshow/120613965.cms",
    "summary": "As global financial markets navigate increasing bond yields and geopolitical tensions, Bitcoin is beginning to emerge as a digital safe-haven asset, comparable to gold. In a recent analysis by Chris Wood, Global Head of Equity Strategy at Jefferies, significant developments in Bitcoin's behavior were highlighted, particularly its decoupling from the sagging Nasdaq Composite index. \n\n• **Performance Divergence**: Since April 8, 2025, Bitcoin's value has surged by 20%, while the Nasdaq has seen a decline of 2.4%. This indicates a growing investor confidence in Bitcoin as a legitimate store of value amid economic uncertainties and Federal Reserve unpredictability.\n\n• **Market Context**: Wood's commentary emphasizes that Bitcoin has historically been considered a store of value, but to solidify this position, it had to detach from the performance trends of technology stocks, particularly reflected in the Nasdaq's performance. This decoupling is viewed as a crucial milestone in Bitcoin's maturation as a safe-haven asset.\n\n• **Portfolio Considerations**: The GREED & Fear portfolio reflects this sentiment by maintaining a 5% allocation to Bitcoin, alongside substantial holdings in physical gold, indicating a strategic approach to asset allocation during market volatility.\n\n• **Geopolitical and Policy Influences**: The backdrop of rising treasury yields, geopolitical instability, and uncertainty surrounding U.S. fiscal policies, especially under the Trump administration, has amplified the demand for reliable stores of value like Bitcoin and gold. Current concerns include inflation, interest rate volatility, and potential quantitative easing measures.\n\n• **Long-term Outlook**: Wood also notes the disruptive potential of rising recession risks and stresses within private equity sectors, as many recent acquisitions made during the low-rate era struggle with cash flow issues. These macroeconomic factors compound the uncertainty for corporations and markets alike, enhancing the allure of stable asset classes.\n\n• **China's Positioning**: In contrast, China's economic policy remains more stable, avoiding aggressive stimulus measures while promoting free trade. This measured approach signifies its adaptability in a fluctuating global market.\n\nOverall, the evolution of Bitcoin as it increasingly resembles gold in its trading patterns during market downturns underscores its potential to function as a secure asset in uncertain times. This shift reflects broader trends in investor psychology and strategic asset allocation in response to escalating market risks."
  },
  {
    "title": "Valuations & Volatility: Vikash Kumar Jain on India’s Market Outlook",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/valuations-volatility-vikash-kumar-jain-on-indias-market-outlook/slideshow/120614176.cms",
    "summary": "CLSA's Vikash Kumar Jain provided insights into India's market outlook during an interview, emphasizing key themes around global uncertainty and investor behavior. \n\n• **Market Influence from Global Events**: Jain noted that the Indian market is significantly swayed by international developments. The current global trade turmoil has led Foreign Institutional Investors (FIIs) to consider India as a safer investment haven, representing a temporary respite from global volatility.\n\n• **Renewed Interest in India**: The resurgence in interest toward Indian equities stems less from domestic progress and more from the scarcity of attractive alternatives worldwide. Investors are gravitating toward India due to the prevailing notion of \"There Is No Alternative\" (TINA), suggesting a lack of viable options elsewhere amid improved expectations for rate cuts.\n\n• **Market Performance Volatility**: Despite a rocky performance early in 2025, where India was among the worst global performers, a robust recovery occurred in March and April, making it the top-performing market during that period. However, the year-to-date performance reflects modest growth around 3%, largely resulting from high volatility.\n\n• **Concerns Over Rally Sustainability**: Jain warned against overconfidence in this market rally, pointing out that geopolitical factors, such as US-China trade negotiations, could change investor sentiment and reduce the appeal of India as a safe haven.\n\n• **FII Sector Preferences**: In the early 2025 sector landscape, value stocks showed promising performance, with FIIs pivoting towards domestic sectors, particularly consumption and those sensitive to interest rate fluctuations, while sectors reliant on global exposure suffered a downturn in confidence.\n\n• **Fixed Income Market Dynamics**: The Indian equity market is currently the most expensive globally, trading at a premium to historical valuations. Simultaneously, bond yields are declining sharply but may have limited scope for further decreases, indicating limited upside potential for both bonds and equities moving forward.\n\n• **Domestic Investor Landscape**: Limited avenues for Indian investors in global markets underscore the significance of domestic investment flows. Jain highlighted that substantial market rallies in India typically hinge on robust buying from FIIs; while domestic investments offer some stabilization, they are insufficient for major upward movements alone.\n\n• **Cautious Outlook**: Overall, India's market trajectory remains heavily contingent on external factors rather than intrinsic strength. Jain advised investors to exercise caution, as stretched valuations in both equities and fixed income suggest constrained potential for further gains. The near-term outlook will likely be driven by evolving global conditions, with current enthusiasm potentially diminishing as international circumstances improve. \n\nIn conclusion, while India presents some appealing investment opportunities amid global instability, a prudent approach remains essential, given the unpredictable nature of external influences and market dynamics."
  },
  {
    "title": "Maruti Suzuki Q4 Results: Cons PAT falls 1% YoY to Rs 3,911 crore, revenue rises 6%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q4-results-cons-pat-falls-1-yoy-to-rs-3911-crore-revenue-rises-6/articleshow/120613555.cms",
    "summary": "Maruti Suzuki India has reported its fourth-quarter (Q4FY25) financial results, indicating a *1% decrease* in consolidated profit after tax (PAT) year-on-year (YoY) to ₹3,911 crore, down from ₹3,952 crore compared to the same quarter in the previous year. Notably, this result exceeded market expectations, with analysts predicting a profit of ₹3,801 crore. Additionally, the company experienced a sequential increase in PAT of *4.9%*, compared to ₹3,727 crore in Q3FY25.\n\nKey details from the earnings announcement include:\n\n• **Total Revenue**: Increased by *6.4%* YoY to ₹40,920 crore, compared to ₹38,471 crore in Q4FY24. Revenue from product sales was ₹38,842 crore, while other operating revenues contributed ₹2,078 crore.\n\n• **Sales Performance**: Maruti Suzuki recorded its highest quarterly sales ever, achieving *604,635 units sold*, which represents a *3.5% growth* in total sales. Domestic sales rose by *2.8%* to *519,546 units*, and exports increased by *8.1%* to *85,089 units*.\n\n• **Expenses**: The decline in profitability is attributed to higher expenses related to the new Kharkhoda plant, increased sales promotion and advertising costs, and escalated manufacturing and administrative expenses.\n\n• **Operating Earnings**: The company’s Earnings Before Interest, Taxes, Depreciation, and Amortisation (EBIT) fell by *14.2%* YoY to ₹3,392 crore, with its EBIT margin decreasing by *210 basis points* to *8.7%*.\n\n• **Full Financial Year Performance**: For FY25, Maruti Suzuki saw a PAT increase of *5.6%* YoY to ₹13,955 crore, alongside *net sales growth* of *7.5%* to ₹1,45,115 crore. Total sales volume rose by *4.6%* to *2,234,266 units*.\n\nIn addition to its financial results, Maruti Suzuki announced a final dividend of ₹135 per share, totaling ₹4,244.4 crore, scheduled to be paid out following shareholder approval. The stock price of Maruti Suzuki experienced a *2.3% decline*, closing at ₹11,630 per share on the National Stock Exchange (NSE) post-announcement."
  },
  {
    "title": "Samsung To Invest Additional Rs 1,000 Crore In Tamil Nadu Facility, Creating 100 More Jobs",
    "url": "https://www.ndtvprofit.com/business/samsung-to-invest-additional-rs-1000-crore-in-tamil-nadu-facility-creating-100-more-jobs",
    "summary": "Samsung, the South Korean electronics giant, has announced plans to invest an additional **₹1,000 crore** in its existing manufacturing facility located in **Sriperumbudur, Tamil Nadu**. This investment is expected to create **100 new jobs**, reaffirming the company's commitment to the region's workforce and local economy. The announcement was made by **T. R. B. Rajaa**, the Tamil Nadu Minister of Industries, on April 25, 2025.\n\n### Background Information\n- In **March 2022**, Samsung had already signed a Memorandum of Understanding (MoU) with the Tamil Nadu government to establish a new compressor manufacturing plant in the same area, which aims to enhance the local component ecosystem.\n- The Sriperumbudur facility is one of two factories Samsung operates in India, with its other plant located in **Noida, Uttar Pradesh**. The facility, which commenced operations in **2007**, is strategically important for Samsung as it produces critical components, including compressors used in various appliances such as refrigerators, washing machines, and air conditioners. These appliances are manufactured for both domestic consumption and international markets.\n\n### Future Plans\n- The new compressor plant has a current production capacity of **8 million compressor units annually**, which is anticipated to rise in the future as the facility expands operations. This enhancement aligns with Samsung's broader strategy to solidify its presence and increase capacity in the Indian market.\n\nThis additional investment reflects Samsung's ongoing dedication to the Indian market and its role as a significant player in India's electronics and consumer appliances sector. The company's efforts are expected to contribute positively to local employment and the overall economic development of Tamil Nadu."
  },
  {
    "title": "India's economic growth outlook unchanged, poised to outperform global growth despite risks: Lakshmi Iyer",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/global-bond-index-inclusions-to-boost-indian-bond-market-drive-foreign-flows-lakshmi-iyer/articleshow/120613047.cms",
    "summary": "Lakshmi Iyer, CEO of Kotak Investment Advisors, recently discussed India's economic growth, maintaining that the outlook remains positive and is expected to outpace global growth, despite several risks. Key points from her analysis include:\n\n• **Inward-Focused Strategy**: Iyer highlights an inward-focused economic approach, driven by increasing rural and urban consumption. The Banking, Financial Services, and Insurance (BFSI) sector is notably pivotal in this trajectory.\n\n• **Global Economic Context**: Amidst concerns regarding global growth rates and volatile dollar dynamics, India's bond market remains appealing. This is attributed to robust domestic institutional investment, which counters sales of US treasury yields by foreign entities.\n\n• **RBI's Monetary Policy Influence**: The Reserve Bank of India's (RBI) recent stance trending towards a dovish policy is anticipated to contribute to bond yield reductions. Iyer expects further potential rate cuts from the RBI, which would support the fixed income market.\n\n• **Foreign Investment Considerations**: The impending inclusion of Indian bonds in global indices, such as JPMorgan and Bloomberg, is viewed as a beneficial catalyst for attracting foreign investments. Despite existing global uncertainties, these developments promise to sustain bond market interest.\n\n• **Growth Projections**: While acknowledging possible GDP slowdowns, Iyer asserts that India can maintain growth above 6% for fiscal year 2026. Comparatively, she notes a global growth average near 3%, underscoring India's relative strength.\n\n• **Currency Dynamics**: The Indian Rupee (INR) is projected to stabilize. Iyer specifies a potential range of 84 to 86 INR per dollar, suggesting that currency movements will likely remain non-disruptive in the immediate future.\n\n• **Long-Term Outlook**: The stability and appeal of Indian bonds should persist, driven by ongoing RBI support and favorable domestic conditions, even amidst fluctuating global economic sentiments.\n\nIn summary, Iyer's insights reflect confidence in India's growth trajectory, underpinned by domestic consumption, strategic monetary policy, and bolstered by future global investment flows into Indian bonds."
  },
  {
    "title": "RIL Q4 Results Live Updates: PAT expected to drop 5% YoY due to weak O2C business",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/ril-q4-results-live-reliance-industries-ltd-q4-fy25-revenue-earning-net-profit-loss-bonus-shares-date-time-25-april-2025/liveblog/120612787.cms",
    "summary": "• **Market Overview:**  \n  The Nifty benchmark has seen a decline, currently standing at *24,039.35*, down by *207.36 points*.  \n  Featured mutual funds include:\n  - **Canara Robeco ELSS Tax Saver Regular - Growth**: 5-Year Return of *23.29%*.\n  - **HSBC Large Cap Fund Direct-Growth**: 5-Year Return of *22.11%*.\n\n• **Reliance Industries Ltd (RIL) Q4 Results Update:**  \n  Reliance Industries, a major oil-to-telecom conglomerate, is expected to report decreased net profits for the quarter ending March 2025. Analysts predict a *5% year-on-year (YoY) decline* in net profit due to weak performance in the oil-to-chemicals (O2C) business while revenue is expected to increase by *4% YoY*.\n\n  - **Earnings Before Interest, Taxes, Depreciation, and Amortization (EBITDA):**  \n    Analysts anticipate EBITDA growth between *1-3%*, driven by:\n    • Increased telecom tariff rates.\n    • A stronger retail performance.\n    • However, the O2C segment is projected to deliver weak results due to declining refining margins.\n\n  - **Specific Analyst Insights:**  \n    • ICICI Securities expects a *14.5% increase* in the retail segment’s earnings YoY.\n    • RJio (Reliance Jio) is forecasted to see a 16.2% YoY rise in EBITDA, supported by improved average revenue per user (ARPU).\n  \n• **Stock Performance and Market Reactions:**  \n  RIL shares closed slightly lower, at *Rs 1,300.40*, indicating market caution ahead of the earnings report. As the results are released, investors are keeping a close watch on various segments, particularly retail and telecom, which are expected to show resilience amidst a challenging O2C environment."
  },
  {
    "title": "Japan's Nomura posts record annual profit and can ride choppy market, says CFO",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nomura-posts-record-annual-profit-and-can-ride-choppy-market-says-cfo/articleshow/120612751.cms",
    "summary": "Japan's largest investment bank and brokerage, **Nomura Holdings**, has announced a **27% increase in its fourth-quarter net profit**, reaching a record annual profit as revenues grew across all business segments. The reported profit for the January-March period stood at **72 billion yen** (approximately **$501.15 million**), up from **56.8 billion yen** in the same period last year. \n\nKey details include:\n\n• **Market Resilience:** Nomura's Chief Financial Officer, **Takumi Kitamura**, indicated that volatility benefits their business model, enhancing margins in equity and foreign exchange trading.\n\n• **Revenue Growth:** The investment management division generated its highest revenue for five consecutive quarters, although assets under management declined due to a dip in share prices. \n\n• **Strategic Expansion:** Nomura has announced a **share buyback program** of up to **60 billion yen** and plans to acquire the U.S. and European public asset management businesses of Australia's **Macquarie Group** for **$1.8 billion**, marking a pivotal push for international expansion.\n\n• **Wholesale Division Performance:** Income from the wholesale division, which includes investment banking, surged **82%** year-over-year, despite market volatility causing many firms to pause on equity issuances and mergers.\n\n• **Outlook on Volatility:** Experts suggest that once market conditions stabilize, traditional financial activities, including equity issuance and M&A, will likely resume.\n\nDespite recent geopolitical tensions and tariff announcements impacting markets, Nomura's robust performance reflects confidence in its business strategy and adaptability in challenging financial environments."
  },
  {
    "title": "European shares rise on signs of easing Sino-US trade tensions",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-on-signs-of-easing-sino-us-trade-tensions/articleshow/120612428.cms",
    "summary": "European shares experienced a rise due to signs of potential easing in the ongoing Sino-US trade tensions, which has been a significant concern for global markets. Investors have responded positively to multiple factors that indicate a de-escalation of trade hostilities. \n\n• **Market Upturn:** The pan-European STOXX 600 index increased by 0.5% by 0710 GMT, marking a potential weekly gain of 2.9%, representing its second consecutive week of positive performance.  \n• **Key Drivers:** Apart from the geopolitical easing, several companies reported better-than-expected quarterly earnings, adding to the overall market optimism.  \n• **Sector Performance:** European travel stocks led the gains with a 1.7% increase, while automotive and parts sectors followed suit with a 1.4% rise.  \n• **Corporate Highlights:** Notable performers included Stora Enso, which saw a 4.3% increase in its stock price after surpassing market expectations in its first-quarter operating profit. French aerospace manufacturer Safran also surged by 2.9% on the back of a significant rise in its quarterly revenues.\n• **U.S. Influence:** Statements from U.S. President Donald Trump reflecting a softer approach towards the trade war added further stability to investor sentiment this week.\n\nThese developments collectively have contributed to a more bullish outlook within European markets, as fears regarding the trade conflict transition towards a more constructive dialogue."
  },
  {
    "title": "Global events will keep driving Indian market sentiment over next 90 days: Vikash Kumar Jain",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/global-events-will-keep-driving-indian-market-sentiment-over-next-90-days-vikash-kumar-jain/articleshow/120611431.cms",
    "summary": "Benchmarks are currently at **Nifty 24,038.85**, reflecting a decrease of **207.86 points**. Notable featured funds include:\n\n• **Canara Robeco ELSS Tax Saver Regular - Growth**: 5-year return of **23.29%**  \n• **HSBC Large Cap Fund Direct-Growth**: 5-year return of **22.11%**  \n\nIn the given commentary regarding the Indian market outlook, **Vikash Kumar Jain** from CLSA suggests that **global events** will continue to drive market sentiment over the next **90 days**. As uncertainty surrounding global trade diminishes, the temporary reliance on India as a safe investment haven may dissipate. However, the market remains fundamentally influenced by global conditions rather than domestic factors, with Foreign Institutional Investors (FIIs) currently viewing India as a \"hiding place\" amid international volatility.\n\nKey points highlighted include:\n\n• **Current Market Performance**: The year has reported a **3% Year-To-Date** increase amidst high volatility, where historically India transitioned from being one of the poorest-performing markets to the best over a two-month span (March-April).\n• **Investment Trends**: Domestic consumption and interest rate-sensitive sectors are likely to receive more attention from investors. Value stocks have significantly outperformed after several quarters.\n• **Pricing Concerns**: India is indicated as the **most expensive market** globally, trading above **20%** of its long-term valuation averages, suggesting limited room for significant price rerating.\n• **Sector Preference**: There is a marked shift towards domestic plays as investors shy away from those heavily reliant on global growth.\n\nDespite positive trends, caution is advised as the dominance of foreign investment flows remains critical for sustained market growth. Therefore, the outlook for Indian markets is heavily contingent on **global economic developments** and FII engagement, hinting at a predominantly **headline-driven** market environment in the near term."
  },
  {
    "title": "FIIs reduce stakes over last 4 quarters; 10 stocks see over 40% decline in 1-year",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-reduce-stakes-over-last-4-quarters-10-stocks-see-over-40-decline-in-1-year/slideshow/120612102.cms",
    "summary": "• **Market Overview:** As of April 25, 2025, the Nifty index stands at **24,051.30**, reflecting a decrease of **195.41** points.\n\n• **Investment Insights:**\n  - **Featured Funds:**\n    - **Canara Robeco ELSS Tax Saver Regular - Growth**: 5-Year Return of **23.29%**.\n    - **HSBC Large Cap Fund Direct-Growth**: 5-Year Return of **22.11%**.\n\n• **Foreign Institutional Investors (FIIs) Trends:**\n  - **General Trend:** Over the last four quarters (from June 2024 to March 2025), FIIs have been gradually decreasing their stakes in around **58 smallcap stocks**.\n  - **Significant Declines:** \n    - Ten specific stocks have seen their prices drop by over **40%** in the past year, indicating a considerable sell-off by FIIs.\n  \n• **Stocks with Notable Declines**:\n  - **Allcargo Terminals**: Price decreased **55%** (from ₹60 to ₹27).\n    - FII holdings reduced from **7%** to **6.23%**.\n  \n  - **Dreamfolks Services**: Price decreased **52%** (from ₹528 to ₹252).\n    - FII holdings reduced from **3.88%** to **0.98%**.\n\n  - **BLS E-Services**: Price decreased **47%** (from ₹299 to ₹158).\n    - FII holdings reduced from **5.69%** to **0.41%**.\n\n  - **Sula Vineyards**: Price decreased **47%** (from ₹555 to ₹295).\n    - FII holdings reduced from **12.03%** to **7.97%**.\n\n  - **Mangalore Refinery and Petrochemicals**: Price decreased **43%** (from ₹249 to ₹141).\n    - FII holdings reduced from **2.26%** to **1.31%**.\n\n  - **Yatra Online**, **Dhampur Sugar Mills**, **Gateway Distriparks**, **Exicom Tele-Systems**, and **Juniper Hotels** also reported significant declines ranging from **39%** to **42%**.\n\n• **Investment Implications:**\n  - Investors are advised to closely monitor the movements of FIIs, as substantial withdrawals indicate waning confidence in certain smallcap stocks, potentially signaling a need for cautious investment strategies.\n  \n• **Conclusion:**\n  - The analysis highlights a volatile market environment where institutional behaviors reflect broader investor sentiment, necessitating vigilant management of investment portfolios to navigate upcoming challenges and opportunities."
  },
  {
    "title": "Google-Kantar study paints a cautiously optimistic picture of Gen AI adoption in India",
    "url": "https://www.thehindu.com/sci-tech/technology/google-kantar-study-paints-a-cautiously-optimistic-picture-of-gen-ai-adoption-in-india/article69489849.ece",
    "summary": "The recently conducted **Google-Kantar study** explores the adoption of **Generative AI (GenAI)** technology in India, with significant insights based on **8,000 interviews across 18 cities** from various socioeconomic backgrounds. While there is a growing enthusiasm for this technology, notable barriers persist, particularly regarding **awareness** and **ease of use**.\n\n• **Awareness Gap:** Three out of five respondents are unfamiliar with AI concepts, and less than one-third have engaged with any Generative AI tools. A substantial **75%** of non-users cited challenges in understanding how to access and utilize these tools.\n\n• **User Experience Improvements:** Google is responding to these challenges by simplifying access to its GenAI offerings. The **Gemini platform** is being consolidated into a more user-friendly application. According to **Manish Gupta**, Senior Director at Google DeepMind, the goal is to integrate multiple capabilities into a single application, aiming to alleviate confusion surrounding disparate AI services.\n\n• **Multimodal Interaction:** To enhance usability, Google is focusing on **multimodal interactions**, allowing users to engage with the AI using text, voice, and visual inputs, creating a more intuitive experience for diverse users.\n\n• **Local Language Support:** Recognizing India's linguistic diversity, Google has developed AI capabilities to understand over **100 Indian languages**, tailoring functionalities to users with varying levels of English proficiency.\n\n• **Practical Applications:** Early users of Gemini report positive outcomes, leveraging the AI for tasks such as academic assistance, travel planning, professional email management, shopping suggestions, and more. Notably, the platform serves as a potential \"daily growth collaborator\" for **75%** of respondents.\n\n• **Conclusion:** The study reflects a cautiously optimistic perspective towards GenAI adoption in India. Although significant barriers remain in awareness and usability, Google's ongoing efforts to streamline access, support local languages, and incorporate AI directly into devices could substantially enhance its acceptance and utility, paving the way for broader integration of AI technologies into everyday life.\n\nFurther insights on generational perspectives regarding AI's benefits and challenges will be forthcoming in the complete report."
  },
  {
    "title": "The old edge is gone: Investors now need new tools to stay ahead",
    "url": "https://economictimes.indiatimes.com/markets/market-moguls/the-old-edge-is-gone-investors-now-need-new-tools-to-stay-ahead/articleshow/120611046.cms",
    "summary": "The article discusses the evolving landscape of investing, particularly emphasizing the diminishing *informational advantage* traditional investors once leveraged. With advancements in technology and the proliferation of AI, the data landscape has become democratized, meaning that access to information is no longer a unique edge. As a result, to remain competitive, investors must adopt various *newly identified edges*:\n\n• **Informational Edge:** Access to timely and relevant data through industry contacts, alternative data sources, and sophisticated analytical tools is becoming crucial. \n\n• **Analytical Edge:** Investors can distinguish themselves by developing better frameworks for interpreting data, fostering deep domain-specific knowledge, and applying second or third-order thinking.\n\n• **Behavioral Edge:** The ability to remain rational amid market volatility allows investors to make decisions that are not driven by emotion, often supported by rule-based investing strategies.\n\n• **Decision Edge:** This involves making sound judgments with incomplete information, especially crucial as uncertainty in investment increases.\n\n• **Time Horizon Edge:** A long-term investment perspective helps in managing short-term volatility, contrasting with prevalent short-term thinking among many investors.\n\n• **Structural Edge:** Unique access to markets or opportunities, not available to every investor, can be advantageous.\n\n• **Process Edge:** A systematic, adaptable investment approach that uses checklists, rules, and feedback mechanisms can significantly enhance investment outcomes.\n\n• **Network Edge:** Connections to mentors and likeminded investors can facilitate the exchange of ideas, providing insights that may not be available through traditional channels.\n\nAs investment strategies shift toward leveraging these new forms of advantages, adherence to a multifaceted approach can significantly increase the likelihood of long-term success in contemporary markets."
  },
  {
    "title": "Stocks to Buy | Sandip Sabharwal’s take global macros and sector outlook",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-sandip-sabharwals-take-global-macros-and-sector-outlook/slideshow/120610526.cms",
    "summary": "Market expert *Sandip Sabharwal* provided insights on various sectors and companies in an interview with ET Now, reflecting on macroeconomic influences and investment opportunities.\n\n**IT Sector Outlook**  \n• The IT sector has shown signs of recovery after significant corrections, notably with stocks like *Infosys* dropping from **₹2,000** to **₹1,300**.  \n• Recent positive trends stem from reduced negative earnings outlooks, though concerns regarding the US economy, discretionary spending, and tariffs persist.  \n• Mid-tier companies, such as *Cyient*, are likely to experience volatility linked to client-specific issues.\n\n**Global Macros and Sector Impact**  \n• Global macroeconomic factors are increasingly vital in assessing sectors including pharmaceuticals, automobiles, chemicals, and IT.  \n• Tariffs affecting *China* could present opportunities for the chemicals sector; however, a decline in demand from China poses risks.  \n• Sabharwal encourages investment in domestic companies benefiting from easing monetary rates and upcoming tax cuts, suggesting that more clarity on global conditions is expected in the next quarter.\n\n**Company-Specific Insights**  \n• *Reliance Industries* is projected to underperform in its oil and gas segment amid crude prices hovering around **$66** per barrel. Conversely, its retail and *Jio* sectors are anticipated to perform well, with lower valuations making it an attractive investment. Future growth will rely heavily on new investments and their outcomes on cash flows.  \n• *Axis Bank* is recognized for its conservative management approach, mitigating surprises such as bad loans. Though credit costs remain high, a relaxed monetary policy should foster growth, positioning Axis favorably among large private sector banks for the upcoming year.  \n• In the *FMCG sector*, companies like *Godrej Consumer*, *Dabur*, and *Jyothy Labs* are deemed to offer more favorable growth-to-valuation ratios compared to larger firms like *Nestlé* and *Hindustan Unilever*. Notably, *Britannia's* performance merits closer scrutiny regarding growth and margin sustainability.  \n• In the *automobile sector*, while *Tata Motors* faces global challenges and tariff uncertainties, prospects are brighter for *Mahindra & Mahindra* and *Maruti*, which are expected to achieve commendable growth through fiscal and monetary stimulus during **2025-2026**.\n\nThese insights reflect an overarching theme of cautious optimism in various markets as investors navigate through global economic conditions and company-specific performances."
  },
  {
    "title": "Gensol Crisis: ED Seeks Lookout Circular Against Promoters Jaggi Brothers",
    "url": "https://www.ndtvprofit.com/business/gensol-engineering-crisis-enforcement-directorate-ed-requests-look-out-circular-promoter-anmol-jaggi-reportedly-in-dubai",
    "summary": "The Enforcement Directorate (ED) has initiated investigations against Gensol Engineering for alleged foreign exchange management violations, estimating irregular overseas fund transfers between Rs 200 crore and Rs 300 crore. As part of this probe, the agency executed searches at the residences of the company's promoters, Puneet Singh Jaggi and Anmol Singh Jaggi, in multiple locations including Delhi and Ahmedabad. Anmol Jaggi is reportedly in Dubai and has been summoned for questioning.\n\nThe ED's inquiry stems from concerns that a significant portion of loans raised by Gensol may have been unlawfully diverted abroad. Investigators are examining potential connections to cryptocurrency transactions that might have facilitated these transfers. Currently, Puneet Singh Jaggi has been questioned for several hours, with conflicting reports regarding his custody status being clarified by an ED official.\n\nAdding to Gensol's woes, the Securities and Exchange Board of India has barred Gensol and its executives from operating in the securities market, restricting them from holding key managerial positions. This action followed allegations of fund misappropriation linked to a loan-financed electric vehicle purchase scheme where out of Rs 975 crore raised, only Rs 567.73 crore was accounted for in vehicle purchases, with over Rs 200 crore unaccounted for according to SEBI’s findings. \n\nIn recent months, Gensol's financial status has deteriorated significantly, with major credit rating agencies downgrading Rs 2,050 crore of its debt to 'default' status due to delays in loan servicing and allegations of data falsification. Consequently, their share value has witnessed a sharp decline, negatively impacting investor confidence and further complicating the company's situation amid increasing regulatory scrutiny. \n\nThe situation is evolving as more details emerge from ongoing investigations and responses from Gensol's management."
  },
  {
    "title": "Gensol Engineering fall another 5%; drop for 12th day",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/gensol-engineering-fall-another-5-drop-for-12th-day/articleshow/120608484.cms",
    "summary": "Shares of **Gensol Engineering** have continued to decline, experiencing a drop of **5%** and reaching the lower circuit limit for the **12th consecutive day**. This persistent decrease, totaling over **44%** in the past 12 days, follows a crisis precipitated by actions from the Enforcement Directorate (ED), including searches and the detention of co-promoter **Puneet Singh Jaggi**.\n\nThe stock declined to **Rs 91.05**, its permissible trading limit for the day, marking a significant **52-week low** on the Bombay Stock Exchange (BSE). Concurrently, it fell to **Rs 90.16** on the National Stock Exchange (NSE), which is also its lower circuit limit and a **52-week low**. Comparatively, the stock has plummeted by **91.91%** from its **52-week high** of **Rs 1,125.75**.\n\nThe ED's actions included conducting searches at the company's offices in **Delhi, Gurugram, and Ahmedabad** under the Foreign Exchange Management Act (FEMA). The proceedings adhere to an ongoing investigation concerning the Jaggi brothers, Puneet and **Anmol Singh Jaggi**, who are accused of **financial misconduct** and **corporate misgovernance** based on a report by the **Securities and Exchange Board of India (Sebi)**. Following the findings, Sebi has barred the brothers from accessing securities markets indefinitely.\n\nAdditionally, Sebi's investigation originates from a complaint received in **June 2024**, related to allegations of share price manipulation and financial discrepancies. Consequently, the regulatory body has instructed Gensol Engineering to **suspend** its planned stock split proposal of **1:10** until the resolution of these investigations.\n\nGensol Engineering specializes in solar consulting, engineering, procurement, and construction (EPC) services, along with leasing electric vehicles. The current issues highlight the potential risks for investors and the broader implications for the company's operational future amidst regulatory scrutiny."
  },
  {
    "title": "Stock markets decline; trade lower dragged down by Axis Bank",
    "url": "https://www.thehindu.com/business/markets/stock-markets-decline-trade-lower-dragged-down-by-axis-bank/article69489745.ece",
    "summary": "*On April 25, 2025, the Indian stock markets experienced a decline, largely influenced by a drop in shares of Axis Bank. While the BSE benchmark index initially rose by 329.23 points to reach 80,130.66, it later fell by 174.24 points, settling at 79,627.19. Similarly, the NSE Nifty index, which reached 24,365.45, saw a reduction of 94.35 points by the end of trading, closing at 24,152.35.*\n\n*Key Highlights:*\n\n• **Axis Bank Performance:**  \n   - Shares declined by **3.50%** following the bank's announcement of a slight fall in quarterly profits from ₹7,130 crore in the previous year to ₹7,117 crore.\n\n• **Market Context:**  \n   - Despite initial gains attributable to foreign fund inflows and positive global market trends, these gains could not be sustained.\n   - Other notable laggards included **Adani Ports**, **Bajaj Finance**, and **Tech Mahindra**.\n   - Conversely, major gainers included **Tata Consultancy Services**, **Infosys**, and **ICICI Bank**.\n\n• **Market Trends:**  \n   - In the broader Asian context, indices such as South Korea's Kospi and Japan's Nikkei 225 were performing positively.\n   - U.S. markets showed substantial gains on the preceding day, reflected in the jumps of 2.74% for the Nasdaq and 2.03% for the S&P 500.\n\n*Conclusion:*  \n*The volatility in the Indian markets highlights a complicated economic landscape where individual performance of major financial institutions like Axis Bank can significantly impact broader indices. Investors are advised to stay informed about global trends and specific market movements.*"
  },
  {
    "title": "SBI Life Insurance Shares At Over Six-Month High After Q4 Results",
    "url": "https://www.ndtvprofit.com/markets/sbi-life-insurance-share-price-at-over-six-month-high-after-q4-results",
    "summary": "SBI Life Insurance's shares reached a six-month high on April 25, 2025, following the announcement of its fourth-quarter results for the previous fiscal year. The company reported a consolidated net profit of Rs 814 crore, slightly above the previous year’s profit of Rs 811 crore, yet below analysts' expectations of Rs 1,038 crore. \n\nKey financial metrics from the quarter include:\n\n• Net premium income decreased by **5% year-on-year**, totaling **Rs 23,861 crore**, compared to **Rs 25,116 crore** in the same quarter last year.\n• Despite missing profit estimates, UBS has retained a ‘buy’ rating on the shares, raising the target price to **Rs 1,915** from **Rs 1,880**, attributing this increase to stronger-than-expected value of new business metrics.\n• SBI Life's annualized premium equivalent grew by **9% year-on-year** for fiscal 2025, and the value of new business rose by **7%**.\n• The bancassurance channel's growth stabilizes, lauded for its contribution to premium growth, while the agency channel requires enhanced product diversification to sustain growth rates.\n• The company maintains a **solvency ratio** of **1.96%**, showing a slight decrease from the preceding quarter's **2.04%**.\n• The **13th month persistency ratio** improved to **86.64%**, up from **85.76%** in the previous year, and the **61st month persistency ratio** increased to **61.51%** from **57.8%**.\n\nThe shares of SBI Life surged as much as **9.56%** to **Rs 1,762** per share, reflecting a **16.47%** increase over the past year and a **21.03%** rise year-to-date. Trading volume on this day was significantly high, standing at **17 times** the average over the last 30 days, indicating robust investor interest. Currently, **33 out of 36 analysts** tracking the stock maintain a ‘buy’ recommendation, projecting an average price target of **16.4%** upside potential based on current trading prices. \n\nIn the broader market context, the NSE Nifty 50 index experienced a decline of **1.27%** on the same day."
  },
  {
    "title": "IT sector faces limited upside amid global uncertainty and tariff risks: Sandip Sabharwal",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/it-sector-faces-limited-upside-amid-global-uncertainty-and-tariff-risks-sandip-sabharwal/articleshow/120607392.cms",
    "summary": "The current dynamics within the IT sector, as articulated by Sandip Sabharwal, indicate that while certain companies may present limited downside risk, especially due to their zero debt status and strong cash flow generation, significant upside potential appears constrained. Several factors contribute to this situation:\n\n• **Market Performance**: Recently, technology stocks have experienced considerable corrections due to adverse tariff news, impacting firms like Infosys, which saw its stock decline from a peak of over 2000 to approximately 1300.\n\n• **Economic Uncertainty**: The overall growth outlook remains fraught with uncertainty, primarily driven by global economic conditions and the US's discretionary spending patterns influenced by tariffs.\n\n• **Volatility**: Expectations of increased volatility in mid-tier IT companies, particularly in cases where specific client issues arise, could further complicate performance assessments.\n\n• **Macroeconomic Focus**: Sabharwal advocates for a greater emphasis on domestic-focused companies, suggesting that the domestic macroeconomic climate may yield better opportunities following fiscal stimuli and tax breaks starting from April.\n\n• **Sector Gauging**: When analyzing sectors like chemicals and pharmaceuticals, the influence of global tariffs and demand from the US on Chinese companies remains critical, as these elements create a complex dynamic that could either bolster or hinder sector growth.\n\n• **Company-Specific Outlooks**: As seen with Reliance Industries, there are mixed signals. While crude oil prices have stabilized around $66 per barrel, generating questions about future earnings in oil and gas segments, expectations for Jio's performance remain cautiously optimistic.\n\n• **Axis Bank Analysis**: Axis Bank appears well-placed due to its conservative management strategy that prioritizes early write-offs and provisions, which is expected to enhance its performance as monetary easing takes effect.\n\nIn conclusion, while opportunities exist, particularly among domestically focused sectors, a cautious stance is warranted given the current macroeconomic uncertainties and sector-specific challenges. The upcoming quarter is anticipated to clarify the evolving landscape."
  },
  {
    "title": "Sensex Falls Over 1,000 Points Amid Tensions Over Pahalgam Terror Attack",
    "url": "https://www.ndtv.com/india-news/sensex-falls-over-900-points-amid-tensions-over-pahalgam-terror-attack-8251550#publisher=newsstand",
    "summary": "Indian equity markets are experiencing significant turmoil following a terror attack in Pahalgam, Kashmir, which has heightened tensions between India and Pakistan. The Sensex, a benchmark for the Bombay Stock Exchange, has plunged by over **1,000 points**, falling below the **79,000 mark**, while the Nifty index has dropped beneath **24,000 points**. \n\n• **Market Behavior:**\n   - Initially, the markets showed positive momentum due to a global rally and substantial fund inflows.\n   - However, this uptick was short-lived, as the markets reverted to negative territory, impacted by disappointing earnings from major companies.\n\n• **Company Earnings:**\n   - **Axis Bank**, the third-largest private sector bank in India, reported a slight decline in quarterly profits from **₹7,130 crore** to **₹7,117 crore**, contributing to a **4.65% drop** in its shares.\n   - Other companies facing declines include **Bajaj Finance**, **Bajaj Finserv**, **Tata Motors**, and **Tech Mahindra**.\n   - Notable gainers amidst the downturn are **TCS**, **Infosys**, **Reliance**, **HCL Tech**, **HDFC Bank**, and **ICICI Bank**.\n\n• **Terror Attack Details:**\n   - The attack resulted in the deaths of **at least 26 civilians** and has prompted both countries to withdraw their diplomatic personnel and cancel issued visas.\n   - There has been an escalation of hostilities along the Line of Control, with Indian troops responding effectively to provocations from Pakistani forces.\n\n• **Global Market Trends:**\n   - Despite the losses in Indian markets, global equities have displayed resilience, with increases in indices such as South Korea's **Kospi**, Japan's **Nikkei 225**, and the **S&P 500** in the United States showing positive performances.\n\nThis situation reflects a broader concern regarding regional stability and its implications for the financial markets, as investors react to both geopolitical uncertainties and corporate financial performances."
  },
  {
    "title": "Balancing Act: BOJ policy outlook amid US tariff concerns",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/balancing-act-boj-policy-outlook-amid-us-tariff-concerns/slideshow/120607496.cms",
    "summary": "The Bank of Japan (BOJ) has articulated its intention to maintain a proactive stance on interest rates, with Governor Kazuo Ueda asserting that any future increases will be enacted if the underlying inflation trends towards the 2% target consistently. This decision-making process will be influenced by developments in inflationary patterns and the broader economic landscape at both domestic and international levels.\n\nKey Points of Interest:\n\n• **U.S. Tariff Impact**: Ueda highlighted that tariffs from the United States are having a detrimental effect on the Japanese economy, primarily through reduced trade activities, weakened business confidence, and heightened market volatility. Many global financial leaders echoed this sentiment during recent discussions.\n\n• **Future Policy Considerations**: The BOJ aims to assess incoming data meticulously before determining any policy changes. Ueda emphasized the absence of a fixed path for the central bank, signifying a flexible approach that will adapt to evolving risks, particularly those linked to U.S. tariffs and their potential impacts on inflation and economic growth.\n\n• **Upcoming BOJ Meeting Expectations**: Analysts anticipate that the BOJ will likely keep interest rates steady at 0.5% in the forthcoming policy meeting. There are speculations regarding a possible revision downwards of growth forecasts due to the uncertainty arising from global economic developments.\n\n• **Recent Policy Context**: Earlier in the year, the BOJ transitioned away from its traditionally ultra-loose monetary policy, implementing a short-term interest rate hike to 0.5% in January, fueled by the belief that the Japanese economy was approaching stable inflation.\n\n• **IMF Growth Projections**: The International Monetary Fund (IMF) has revised Japan's growth forecast for 2025, downgrading it to 0.6% from the previously estimated 1.1%, citing negative repercussions from U.S. tariff policies as a primary reason for this adjustment.\n\nIn summary, while the BOJ remains poised to increase interest rates pending sustained inflation progression, it must navigate significant global challenges, notably the constraints imposed by U.S. tariffs, which underline the necessity of a careful, data-driven approach to economic policy. The IMF's adjustments further illuminate the complexities ahead for Japan's economic outlook."
  },
  {
    "title": "Why stock market is falling today: Sensex slumps 1,100 pts as Pahalgam attack fuels geopolitical concerns. 5 reasons behind bloodbath",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-falling-today-sensex-slumps-1000-pts-as-pahalgam-attack-fuels-geopolitical-concerns-5-reasons-behind-bloodbath/articleshow/120607175.cms",
    "summary": "Indian stock markets experienced a significant decline on April 25, 2025, primarily influenced by escalating geopolitical tensions between India and Pakistan following a deadly terrorist attack in Pahalgam that resulted in the loss of 26 civilian lives. \n\n• **Market Performance:**\n  - The **BSE Sensex** fell by 588 points (0.74%) to close at 79,212.\n  - The **NSE Nifty** dropped 207 points (0.86%), ending just below the 24,050 mark.\n  - Total market capitalization of BSE-listed companies decreased by Rs 8.8 lakh crore, settling at Rs 420.83 lakh crore.\n\n• **Reasons for Market Decline:**\n  1. **Geopolitical Risks:**\n     - Escalating tensions between India and Pakistan heightened investor caution.\n     - Analysts pointed out that India's decisions to downgrade diplomatic relations and suspend the Indus Water Treaty could further undermine market confidence.\n\n  2. **Profit-Taking:**\n     - After a robust 8.6% gain over seven consecutive days, investors became wary about valuations, opting to book profits amidst escalating geopolitical uncertainties.\n\n  3. **Weak Performance of Financial Stocks:**\n     - Major financial institutions such as Axis Bank, SBI, and Bajaj Finance were leading contributors to the Sensex's decline, collectively responsible for a significant portion of the market drop. \n\n  4. **Technical Corrections:**\n     - Following a prolonged rally, technical analysts noted signs of fatigue among Nifty bulls, suggesting a necessary correction given the overbought conditions.\n\n  5. **Muted Earnings Reports:**\n     - The ongoing earnings season has been underwhelming, with many companies failing to meet earnings expectations. Reports indicated Hindustan Unilever (HUL) missed profit targets, and Axis Bank experienced a slight decline in profits.\n\nOverall, while governmental efforts from the RBI and Indian authorities aimed at stimulating GDP growth remain in place, ongoing geopolitical tensions combined with financial market uncertainties are anticipated to restrict any immediate economic benefits. Investors are advised to remain vigilant and assess their positions carefully, particularly in light of the newly shifting market landscape."
  },
  {
    "title": "Share market update: Most active stocks of the day in terms of total traded value",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/share-market-update-most-active-stocks-of-the-day-in-terms-of-total-traded-value/articleshow/120607233.cms",
    "summary": "The recent performance of the Indian stock markets indicates a downward trend. As of April 25, 2025, the **NSE Nifty index** shows a decline of **345.66 points**, settling at **23,901.05**. Similarly, the **BSE Sensex** has dropped by **1,019.12 points**, reaching **78,782.31**. Extensive trading activity was noticed in several securities on the National Stock Exchange (NSE).\n\nKey points include:\n• **Top traded stocks by value**:\n  - Apollo Hospital: ₹347.89 crore\n  - Waaree Energies: ₹154.37 crore\n  - Reliance Industries Ltd. (RIL): ₹127.18 crore\n  - Dixon Technologies: ₹66.93 crore\n  - Suzlon Energy: ₹66.02 crore\n  - Vodafone Idea: ₹59.69 crore\n  - SBI Life: ₹54.12 crore\n  - SpiceJet: ₹45.68 crore\n  - Havells India: ₹44.72 crore\n  - Tata Power: ₹44.58 crore\n\n• **Market Movers**:\n  - Among **top gainers in the Nifty index**:\n    - SBI Life Insurance (up **3.69%**)\n    - Infosys (up **0.48%**)\n    - IndusInd Bank (up **0.29%**)\n    - Tata Consultancy Services (TCS) (up **0.25%**)\n    - Tech Mahindra (up **0.20%**)\n\n  - Conversely, the **top losers** included:\n    - Axis Bank (down **4.74%**)\n    - Adani Enterprises (down **4.40%**)\n    - Adani Ports & Special Economic Zone (down **4.15%**)\n    - Trent Ltd. (down **3.67%**)\n    - Bajaj Finserv (down **3.56%**)\n\nThese movements are reflective of the broader economic conditions amidst a noted recovery in the global economy and a decrease in COVID-19 cases in India, with active cases dropping below 20% of previous highs from May. The market dynamics continue to be influenced by these factors as investors react to the unfolding economic landscape."
  },
  {
    "title": "Sensex  falls! These  stocks are down 5% or more on BSE",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/sensex-falls-these-stocks-are-down-5-or-more-on-bse/articleshow/120607093.cms",
    "summary": "As of April 25, 2025, the BSE Sensex has experienced a significant decline, dropping by **1,028.1 points** to settle at **78,773.33**. This downturn is reflective of vigorous selling activities, particularly among leading blue-chip stocks. Within the Nifty index, only **four stocks** remained in positive territory, while a staggering **46 stocks** traded in the negative. \n\nKey Highlights:\n• Among the notable stocks that plummeted by over **5%** were:\n  - **Aryan Shares & Stock**: down **17.41%**\n  - **DCM Nouvelle**: down **14.64%**\n  - **Purple Entertainment**: down **13.95%**\n  - **Jetmall Spices**: down **12.40%**\n  - **AMD Industries**: down **12.14%**\n  \n• Currently, the Nifty index is quoted at **23,898.8**, reflecting a decrease of **347.91 points**.\n\n• The session also recorded several companies hitting new **52-week lows**, including:\n  - **KIC Metaliks**\n  - **Hilton Metal**\n  - **Jai Balaji Industries**\n  - **VMV Holidays Ltd.**\n  - **Unimode Overseas**\n\n• Conversely, stocks reaching **52-week highs** included:\n  - **Country Condos**\n  - **Trident Texofab**\n  - **SER Industries Ltd.**\n  - **Taparia Tools**\n  - **Soni Medicare**\n\nInvestment guidance suggests that investors might consider leveraging dips in stock prices, specifically within the Nifty range of **15,200** to **15,400**, to accumulate quality large-cap and mid-cap stocks. This overview provides an insight into the problematic trends impacting the stock market and the respective investor strategies in response to these fluctuations."
  },
  {
    "title": "Q4 Results Live: Reliance Industries, Maruti Suzuki, Tata Tech, L&T Finance Earnings In Focus",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/q4-results-2025-today-tech-reliance-ril-hindustan-zinc-tata-tech-lt-finance-rbl-bank-earnings-live-blog",
    "summary": "The live updates from NDTV Profit for April 25, 2025, provide a comprehensive overview of the fourth-quarter financial results from various companies, including notable figures from Maruti Suzuki and Shriram Finance. The report highlights several key financial outcomes as follows:\n\n• **Maruti Suzuki**:\n  - Reported a slight **profit decline** of **4%** compared to the previous year.\n\n• **Shriram Finance**:\n  - Total income increased by **20.7%**, reaching ₹11,460.25 crore, compared to ₹9,497.85 crore.\n  - Net profit surged by **9.9%** to ₹2,139.39 crore from ₹1,945.87 crore.\n  - Consolidated net interest income grew by **9.4%** to ₹5,565.5 crore.\n\n• **Cholamandalam Investment**:\n  - Experienced revenue growth of **29.8%**, amounting to ₹7,136.91 crore.\n  - Net profit rose by **18.2%** to ₹1,259.54 crore.\n\n• **Motilal Oswal**:\n  - Reported a shift to a **loss** during this quarter.\n\n• **Hindustan Zinc**:\n  - Profits beat market estimates, indicating strong performance.\n\n• **Bank of Maharashtra**:\n  - Reported an increase in profit during the quarter.\n\n• Other notable mentions include dividends declared by Orient Electric (₹0.75) and Cholamandalam (₹0.70) along with various financial metrics from multiple companies revealing varying trends in their operational performance. \n\nThis day's updates signify a significant market day, with numerous economic indicators potentially impacting future investment decisions and financial strategies across sectors."
  },
  {
    "title": "Stock market update: Sugar stocks  down  as market  falls",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-sugar-stocks-down-as-market-falls/articleshow/120606944.cms",
    "summary": "The stock market is experiencing notable declines, particularly in the sugar sector. As of April 25, 2025, the Nifty 50 index has fallen by 306.36 points, currently at 23940.35, while the BSE Sensex has decreased by 915.07 points, resting at 78886.36. \n\nKey points include:\n\n• **Sugar Stocks Performance:**\n  - Major sugar companies like Uttam Sugar Mills Ltd. (-6.77%), Vishwaraj Sugar Industries Ltd. (-6.31%), and Bajaj Hindusthan Sugar Ltd. (-6.09%) are among the top decliners, reflecting a negative trend in the sector.\n\n• **Top Gainers in Nifty:**\n  - On the brighter side, certain companies have shown positive movement; SBI Life Insurance Company Ltd. is up by 4.64%, followed by Infosys Ltd. (+0.97%) and Tata Consultancy Services Ltd. (+0.58%).\n\n• **Wider Market Impact:**\n  - Other notable declines include Axis Bank Ltd. (-4.69%) and Adani Enterprises Ltd. (-4.0%), indicating a broader downturn across various sectors.\n\nThe overall outlook points to considerable volatility in the market, with several sectors, notably sugar, facing significant pressure amidst fluctuations in other stocks."
  },
  {
    "title": "Swiggy shares may face near-term pressure as lock-in expiry looms, JM Financial retains buy rating",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-may-face-near-term-pressure-as-lock-in-expiry-looms-jm-financial-retains-buy-rating/articleshow/120606872.cms",
    "summary": "Swiggy’s stock is projected to experience significant volatility due to the impending expiry of a major pre-IPO shareholder lock-in period, which ends on May 12. This event will allow approximately 83% of the company’s shares to be traded for the first time, which could lead to substantial offloading. JM Financial estimates that if 15% of the locked-in shares are sold, the resultant outflows could reach around ₹120 billion, nearly matching the entire IPO size of ₹113 billion.\n\nIn the trading session preceding this report, Swiggy’s shares fell by 1.6% to ₹342.4 on the Bombay Stock Exchange (BSE). There is considerable pressure on Swiggy’s stock from rising losses in its quick commerce division, Instamart, which are anticipated to expand to ₹7.8 billion in Q4 FY25, up from ₹5.8 billion the previous quarter due to increased competition and operational costs. For the entire fourth quarter, Swiggy is expected to report a consolidated EBITDA loss of ₹8.56 billion, compared to ₹7.26 billion in Q3 FY25. \n\nDespite the immediate challenges, JM Financial maintains a 'Buy' rating with a target price of ₹500, indicating a belief in the company’s long-term potential. Although technical indicators show mixed signals, with the stock having declined by 25% over the past three months but recovering slightly in the last week, the analysts suggest that the valuation reflects only the food delivery segment without adequately accounting for Instamart or other emerging areas.\n\nIn addition, Swiggy recently issued equity shares under its ESOP plans, raising its paid-up share capital slightly. The company recorded a significant 31% year-on-year revenue increase to ₹3,993 crore in Q3 FY25, yet consolidated losses also widened.\n\n• Swiggy faces potential stock volatility as lock-in expiry approaches.\n• JM Financial estimates possible outflows of ₹120 billion with 15% shares sold.\n• Stock fell 1.6% to ₹342.4 recently; significant losses projected in quick commerce division.\n• Q4 FY25 may see an EBITDA loss of ₹8.56 billion.\n• JM Financial retains a 'Buy' rating, setting a ₹500 target price despite near-term challenges.\n• Long-term outlook remains optimistic, focusing on food delivery growth potential. \n\nThe overall scenario indicates that while immediate forecasts are troubled, the long-term strategy could yield positive outcomes for Swiggy, making it an intriguing option for potential investors."
  },
  {
    "title": "Rate cuts or holding steady? Decoding Fed officials’ latest signals",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/rate-cuts-or-holding-steady-decoding-fed-officials-latest-signals/slideshow/120606819.cms",
    "summary": "• As of April 25, 2025, the Nifty index stands at **24,076.95**, experiencing a decline of **169.75 points**.  \n• Featured mutual funds include:  \n    - **Canara Robeco ELSS Tax Saver Regular - Growth**: 5-year return of **23.29%**.  \n    - **HSBC Large Cap Fund Direct-Growth**: 5-year return of **22.11%**.  \n• In the upcoming U.S. Federal Reserve meeting on May 6–7, 2025, officials are anticipated to maintain short-term borrowing rates, evaluating the impact of President Trump's trade policy on inflation and employment metrics.  \n• The Fed's uncertainty about economic forecasts has led to a projected **half-point rate cut for 2025**, but this remains contingent on forthcoming data.  \n• Federal Reserve officials categorize themselves as either *doves*, who lean towards supporting labor markets, or *hawks*, who concentrate on controlling inflation.  \n• Dovish officials emphasize caution and patience in responding to economic changes, while hawkish counterparts stress the necessity of prioritizing price stability.  \n• The **Federal Open Market Committee (FOMC)** comprises seven voting members, including the Fed Chair, with additional regional Fed presidents participating in discussions.  \n• Current sentiments suggest the Fed is likely to avoid rate changes amid prevailing uncertainties surrounding trade policies, emphasizing the need for clearer economic indicators in the months ahead."
  },
  {
    "title": "BPCL, IOCL, HPCL Q4 Results Preview: Weaker Margins, Net Profit Expected",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/bpcl-iocl-hpcl-q4-results-preview-weaker-margins-net-profit-expected",
    "summary": "The fourth quarter results for major oil marketing companies in India, including Bharat Petroleum Corporation Limited (BPCL), Indian Oil Corporation Limited (IOCL), and Hindustan Petroleum Corporation Limited (HPCL), are projected to show significant declines in net profits, attributed primarily to weaker margins. Analysis suggests:\n\n• **Project Profitability Decline**:\n  - **BPCL**: Expected net profit drop of **41%** to Rs 2,747 crore from Rs 4,649 crore in the previous quarter. Net revenue is anticipated to increase marginally by **0.4%** to Rs 1,13,639 crore.\n  - **IOCL**: Forecasted to experience a **25%** fall in net profit, projected at Rs 1,646 crore, down from Rs 2,194 crore. Revenue is likely to decrease by **1.6%** to Rs 1,90,837 crore.\n  - **HPCL**: Expected to see a dramatic **46%** fall in net profits to Rs 1,645 crore, against Rs 3,023 crore previously. Revenue may decline by **1%** to Rs 1,09,544 crore.\n\n• **Factors Influencing Earnings**:\n  - The profitability of these companies is contingent on both **gross marketing revenues and refining margins**, both of which have come under pressure in Q4 FY25 due to unfavorable conditions.\n  - **Refining margins** are projected to weaken to approximately **$3.1 per barrel**, significantly lower than **$5** in the previous quarter.\n  - **Marketing margins** are expected to decrease **by 28%** quarter-on-quarter, dropping from Rs 9.4 per liter in Q3 FY25 to Rs 6.8 per liter.\n\n• **Market Volatility**:\n  - The volatility in Brent crude oil prices during the quarter, fluctuating between $70 and $82 per barrel, may also influence the companies' inventory holdings and overall market performance.\n\n• **Key Points to Monitor**:\n  - Investors should pay attention to management’s commentary regarding changes in retail fuel pricing, the impact of LPG subsidies, projections for gross refining margins, and capital expenditure plans.\n\nThis analysis underscores the challenges faced by India's oil marketing sector as they navigate shrinking profit margins while dealing with fluctuating crude prices."
  },
  {
    "title": "Paras Defence to consider stock split at April-end board meeting",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/paras-defence-to-consider-stock-split-at-april-end-board-meeting/articleshow/120606374.cms",
    "summary": "Paras Defence and Space Technologies is currently deliberating on a stock split, with a crucial board meeting scheduled for April 30, 2025. This meeting will not only address the proposal for the stock split but will also review the financial results for the quarter and fiscal year ending March 31, 2025, as well as a potential dividend recommendation. Over the last year, Paras Defence shares have risen significantly, achieving a 40% gain, and showing a 9% increase in the past six months. The stock has recently risen by 2.6%.\n\nKey points regarding the company's activities include:\n\n• **Stock Split Discussion**: The board will decide on splitting existing equity shares, although the specific ratio has not been disclosed.\n• **Financial Performance Review**: The meeting will include the examination of audited financial statements.\n• **Recent Developments**: Paras Defence has secured a manufacturing license from the Department for Promotion of Industry and Internal Trade (DPIIT) for producing MK-46 and MK-48 Light Machine Guns, allowing an annual production capacity of 6,000 units for each model.\n• **Technical Analysis**: The stock is performing well, trading above most key moving averages, although still below its 200-day average. The Relative Strength Index (RSI) stands at 63.8, suggesting a balanced market position.\n\nThis stock split may enhance liquidity and broaden market participation, aligning with the company's growth trajectory and recent regulatory approvals."
  },
  {
    "title": "Gold Price Today: Gold prices open slightly higher after sell-off earlier this week, open at Rs 96,120/10 g",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-today-gold-prices-open-slightly-higher-after-sell-off-earlier-this-week-open-at-rs-96120/10-g/articleshow/120606074.cms",
    "summary": "Gold prices have seen a slight recovery following a recent sell-off, opening at **Rs 96,120 per 10 grams** as of April 25, 2025. This comes amid high price volatility caused by fluctuations in the domestic and international markets. Notably, gold futures at the Multi Commodity Exchange (MCX) rose by **1.26%**, while silver prices remained relatively flat with only a **0.29%** decline.\n\nKey observations include:\n\n• **Market Response:** A significant uptick in U.S. jobless claims, with numbers jumping to **222,000** from **215,000**, has fueled buying interest in gold. Furthermore, indications of potential economic stimulus from China have contributed to the upward pressure on gold prices.\n\n• **Price Fluctuations:** Gold futures experienced a notable surge, rising by **Rs 208** or **0.22%** after showing a sharp decline earlier in the week. The current spot price surpassed **$3,300 per troy ounce**.\n\n• **Market Volatility:** Experts anticipate continued volatility amid geopolitical tensions and fluctuations in the dollar index. Analysts have suggested profit booking for gold, while recommending the purchase of silver around **Rs 97,000**.\n\n• **Technical Analysis:** \n  - **Support Levels:** Gold is projected to have support levels between **Rs 95,250 - 94,400**, and resistance levels between **Rs 96,600 - 97,280**.\n  - Silver's support is noted at **Rs 96,850 - 96,200**, with resistance at **Rs 98,200 - 99,100**.\n\n• **Regional Pricing Variations:** In physical markets:\n  - Delhi: 22 carat gold at **Rs 57,960**, 24 carat at **Rs 61,768**.\n  - Mumbai: 22 carat at **Rs 56,984**, 24 carat at **Rs 60,752**.\n  - Chennai: 22 carat at **Rs 56,768**, 24 carat at **Rs 60,536**.\n  - Hyderabad: 22 carat at **Rs 56,832**, 24 carat at **Rs 60,576**.\n\nAdvisors recommend cautious trading, particularly with gold's fluctuating trend, as market conditions remain unsettled with a focus on upcoming U.S. economic indicators and trade negotiations affecting investor sentiment."
  },
  {
    "title": "Stock market update: Stocks that hit 52-week highs on NSE",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-stocks-that-hit-52-week-highs-on-nse/articleshow/120606013.cms",
    "summary": "The NSE benchmark Nifty index experienced a decline of **280.5 points**, closing at **23,966.2**, driven by selling pressure in prominent blue-chip stocks. Conversely, several companies, including **Country Condos**, **Navin Fluorine**, **Choice International**, **Dalmia Bharat**, and **SBFC Finance**, achieved new 52-week highs, specifically noted at **10:39 AM IST**.\n\nKey market details include:\n\n• **Decline in Nifty**: The Nifty 50 index reflected a predominantly negative sentiment, with **46** out of **50** stocks trading lower.\n• **Top Gainers on Nifty**: Notable performers included **SBI Life**, **TCS**, **Infosys**, **IndusInd Bank**, and **ICICI Bank**, contributing to the limited green spots in the market.\n• **Significant Declines**: Stocks such as **Axis Bank**, **Adani Ports SEZ**, **Adani Enterprises**, **Trent**, and **BEL** faced losses.\n\nAdditionally, the **BSE Sensex** also fell sharply, dropping **817.02 points** to reach **78,984.41** at the same time. The market activity revealed a concentration of trading in sectors such as General, IT Enabled Services, and Auto, whereas selling trends were prevalent in Chemicals, Airlines, and Learning & Education sectors.\n\nOverall, market participants observed increased trading activity, particularly among several sectors, amidst a broader sentiment of caution due to the underlying volatility in stock performances."
  },
  {
    "title": "Prestige Hotel Ventures files DRHP with Sebi for Rs 2,700 crore IPO; details here",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/prestige-group-hospitality-arm-files-document-with-sebi-to-launch-rs-2700-cr-ipo/articleshow/120605473.cms",
    "summary": "Prestige Hotel Ventures Ltd, a subsidiary of Prestige Estates Projects, has submitted its Draft Red Herring Prospectus (DRHP) to the Securities and Exchange Board of India (SEBI) for an Initial Public Offering (IPO) amounting to **₹2,700 crore**. This dissolution comprises a fresh equity issue of **₹1,700 crore** and an offer for sale of **₹1,000 crore** by its promoter, Prestige Estates.\n\n**Purpose of Fund Utilization:**\n• The funds from the IPO will primarily be directed towards:  \n  • **Debt repayment and acquisition funding**, with an estimated **₹1,121.276 crore** earmarked for repaying **₹397.248 crore** in borrowings for the company and its subsidiaries, specifically Sai Chakra Hotels and Northland Holding.  \n  • Investing approximately **₹724.028 crore** in these subsidiaries.  \n  • Supporting strategic initiatives for **inorganic growth** through potential acquisitions.  \n  • Covering **general corporate purposes**.\n\n**Business Overview:**\n• Prestige Hotel Ventures specializes in managing luxury hospitality assets across India, with a portfolio that includes **seven operational hospitality assets** totaling **1,445 keys**. This includes **1,255 operating keys** and **190 keys** under renovation.  \n• Revenue from hospitality services exhibited impressive growth, increasing from **₹191.715 crore in FY22** to **₹795.695 crore in FY24**, translating to a **CAGR of 103.73%** during this period.\n\n**Market Position:**\n• The company operates primarily in major urban centers, including **Bengaluru, Delhi-NCR, Mumbai, Goa, Hyderabad**, and **Chennai**.  \n• It also has partnerships with various established global hotel brands, especially **Marriott International**, thereby ensuring a broad and diverse client base. This includes a notable position within Marriott’s managed portfolio with **9% of its keys** attributed to Prestige Hotel Ventures.\n\n**Future Growth Path:**\n• The firm anticipates continued demand in the hospitality sector, driven by both business and leisure travel segments.  \n• The IPO is structured to enhance its operational capabilities, expand market presence, and solidify Prestige Hotel Ventures as a leading name in luxury hospitality in India. \n\nIn sum, the IPO marks a strategic move aimed at leveraging market opportunities while addressing existing financial obligations and facilitating growth through potential acquisitions, illustrating the firm’s ambitious trajectory in the competitive hospitality landscape."
  },
  {
    "title": "Sensex Opens 265 Points Higher, Nifty Climbs 89 Points In Early Trade",
    "url": "https://www.ndtv.com/business-news/sensex-opens-265-points-higher-nifty-climbs-89-points-in-early-trade-8251211#publisher=newsstand",
    "summary": "The Indian stock market exhibited positive movement on April 25, 2025, with benchmark indices recording gains amid favorable global market cues. Key highlights include:\n\n• **Market Performance**: At approximately 9:27 AM IST, the BSE Sensex was up by **265.3 points**, equivalent to **0.33%**, reaching **80,066.81**. Concurrently, the Nifty 50 index increased by **89.85 points** or **0.37%**, settling at **24,336.55**.\n\n• **Sector Insights**: Buying activity observed in sectors such as IT, pharmaceuticals, and automotive contributed to the positive opening. However, the Nifty Bank index saw a decline, falling **222.85 points** or **0.40%**, to **54,978.55**. \n\n• **Midcap and Smallcap Performance**: The Nifty Midcap 100 index showed a marginal increase, rising by **10.95 points** or **0.02%**, while the Nifty Smallcap 100 index experienced a decrease of **60.20 points** or **0.35%**.\n\n• **Market Outlook**: Analysts suggest that the Nifty could find support levels at **24,200**, **24,100**, and **24,000**, while immediate resistance levels are noted at **24,500**, **24,600**, and **24,700**. For the Bank Nifty, support is anticipated at **55,000**, while key resistance is identified at **55,500**.\n\n• **Top and Bottom Performers**: In the Sensex pack, companies such as TCS, Tata Steel, Maruti Suzuki, and ICICI Bank are highlighted as top gainers. Conversely, Axis Bank and Tech Mahindra were among the underperformers.\n\n• **Global Influence**: The performance was aided by international markets where the Dow Jones, S&P 500, and Nasdaq indices reflected strong gains, reinforcing confidence in Indian equities. Foreign institutional investors notably purchased equities worth approximately **₹8,250.53 crore** on April 24, despite domestic institutional investors selling equities of **₹534.54 crore**.\n\nIn summary, today's trading reflects a robust start for Indian equities, driven by significant sectoral support and positive global market trends. Analysts and investors are closely watching resistance and support levels as the day progresses."
  },
  {
    "title": "Buy Swiggy, target price Rs 500:  JM Financial",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/buy-swiggy-target-price-rs-500-jm-financial/articleshow/120590945.cms",
    "summary": "JM Financial has made a strong recommendation to *buy shares of Swiggy*, setting an ambitious target price of **Rs 500**, with the current market price at **Rs 340.85**. Despite the company reporting a net loss of **Rs 798.95 crore** during the last quarter ended December 31, 2024, their consolidated total income increased to **Rs 4095.84 crore**, reflecting a significant year-over-year rise of **30.82%** and a quarter-over-quarter growth of **11.11%**. \n\nKey details include:\n\n• **Market Position**: Swiggy, established in 2013, operates within the services sector and holds a market capitalization of approximately **Rs 77,877.54 crore**. \n\n• **Revenue Streams**: The company's income is generated from various segments, including platform services, other operating revenue, and food sales.\n\n• **Management Team**: The top executives include Mr. Anand Kripalu, Mr. Sumer Juneja, and others, with B S R & Co. LLP serving as the auditors.\n\n• **Investment Rationale**: \n   - JM Financial projects a high valuation for Swiggy’s food delivery business at **45 times the estimated EBITDA for FY27**, while valuing the Instamart segment at **1 time** its projected gross order value.\n   - They suggest that strategic investors capitalize on short-term stock price fluctuations due to impending lock-in expiries, as long-term prospects in India's hyper-local delivery market remain robust.\n\n• **Current Holdings**: As of March 31, 2025, promoter holdings stood at a notable percentage, with Foreign Institutional Investors (FIIs) and Domestic Institutional Investors (DIIs) owning **4.89%** and **9.32%**, respectively.\n\nIn summary, despite facing short-term financial challenges, JM Financial maintains a bullish outlook on Swiggy's growth potential, supporting the recommendation for investors to leverage current market conditions for future gains."
  },
  {
    "title": "IPO-starved investors pin hopes on Ather Energy for listing gains. Will softer GMP play dampener?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-starved-investors-pin-hopes-on-ather-energy-for-listing-gains-will-softer-gmp-play-dampener/articleshow/120604807.cms",
    "summary": "India's IPO market is experiencing a notable slowdown in 2025, marked by a lack of new listings for the past two months. However, the upcoming IPO of Ather Energy, slated to open for subscription on April 28, is generating significant investor interest as it aims to raise approximately ₹3,000 crore. \n\nDespite tightening market conditions, Ather Energy's IPO is expected to provide a much-needed impetus to the stagnant primary market. The IPO has been priced between ₹304 and ₹321 per share, but the grey market premium has decreased dramatically from ₹17 to just ₹6, indicating concerns over strong listing gains. Analysts point to a drop in investor enthusiasm for paying higher premiums amid current volatile market conditions.\n\nKey Details:\n• **Company Overview**: Ather Energy is a prominent player in the Indian electric two-wheeler market, competing primarily with Ola Electric. They manufacture smart electric scooters along with supporting software and infrastructure.\n• **Product Portfolio**: Their offerings include two main lines: the Ather 450 aimed at performance enthusiasts, and the Ather Rizta, which focuses on family convenience, featuring advanced technology such as WhatsApp notifications and voice control via Alexa.\n• **Sales Performance**: In fiscal 2024, Ather Energy's sales grew 39% year-on-year, surpassing 100,000 units sold, and gaining a 25% market share growth in the first three quarters of fiscal 2025.\n• **Competitive Landscape**: The electric vehicle market is intensifying with competition not just from startups like Ola Electric but also established manufacturers such as TVS and Bajaj entering the fray with their own electric models.\n\nThe hope is that Ather Energy's IPO will reignite investor confidence in the IPO market, though prevailing trends may make strong gains challenging. The overall market sentiment remains cautious as investors await the IPO's outcome."
  },
  {
    "title": "Q4 Earnings Impact: SBI Life Rises 9%; Tech Mahindra, L&T Tech, Cyient Decline",
    "url": "https://www.ndtvprofit.com/markets/q4-earnings-impact-sbi-life-rises-9-tech-mahindra-lt-tech-cyient-decline",
    "summary": "• The stock market displayed mixed performance following recent Q4 earnings reports, with notable movements among major companies.  \n• **SBI Life Insurance Ltd.** experienced a **9% increase** in its share prices, reflecting positive investor sentiment. In contrast, **Cyient Ltd.** saw a **9.5% decline**, marking it as the sharpest decrease in the same period.  \n• **Axis Bank Ltd.** reported a **4.02% drop** in share price with a net profit of ₹7,117.5 crores, which was marginally lower than expectations. The bank's net interest income rose by 6% to ₹13,811 crores.  \n• **Tech Mahindra's** shares fell by **4.86%**, despite reporting a **18.7% increase** in net profit and a slight revenue rise. However, the company did not meet revenue expectations as per analysts' projections.  \n• **L&T Technology Services** shares dropped by approximately **7%**, driven by a decline in net profit despite a revenue uptick.  \n• **Indian Energy Exchange** observed a **4.48% increase** in share price, with both revenue and net profit showing significant gains compared to the previous year.  \n• Other companies, such as **Aavas Financiers** and **Mphasis**, also reported varied results, reflecting broader market dynamics.  \n• Subsequently, market observers expect continued volatility as companies navigate post-earnings scenarios. Insights from these reports may help investors make informed decisions moving forward."
  },
  {
    "title": "Commercial Tax inspector had fixed monthly bribe to allow consignments of pan masala company into Bengaluru illegally",
    "url": "https://www.thehindu.com/news/cities/bangalore/commercial-tax-inspector-had-fixed-monthly-bribe-to-allow-consignments-of-pan-masala-company-into-bengaluru-illegally/article69486989.ece",
    "summary": "The Lokayukta officials in Bengaluru apprehended a Commercial Tax inspector, Nijanandamurthy, and his associate on April 24, 2025, for soliciting a **bribe of ₹20 lakh**. The inspector was involved in facilitating illegal consignments of pan masala from a Delhi-based company into Bengaluru. His associate, Manoj M., was caught in the act while collecting the bribe from the company representative near a hotel in Nagarabhavi. Following this, the Lokayukta conducted a raid on Nijanandamurthy's residence, where evidence of the crime was secured. The action was taken under the **Prevention of Corruption Act**, highlighting ongoing efforts to combat corruption within government agencies and uphold accountability. \n\n• **Accused**: Nijanandamurthy, Commercial Tax inspector\n• **Associate**: Manoj M.\n• **Amount of Bribe**: ₹20 lakh\n• **Charges**: Prevention of Corruption Act violations\n• **Location**: Bengaluru\n\nThis incident underscores the continuing challenges posed by corruption in public offices, particularly regarding regulatory approvals related to commercial activities. The Lokayukta's intervention reflects a commitment to transparency and integrity within administrative processes."
  },
  {
    "title": "Sensex erases early gains, tanks over 850 points, Nifty slips below 24K as caution grips D-Street",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-250-points-nifty-tops-24300-tracking-asian-peers/articleshow/120604329.cms",
    "summary": "Indian equity markets experienced a significant downturn on April 25, 2025, as investor sentiment faltered following a terrorist attack in Kashmir. The initial uptrend in benchmark indices, driven by positive cues from Wall Street and a surge in IT stocks, was negated. \n\n- **Market Movement:**\n  - The **BSE Sensex** plunged **981 points** (1.23%) to **78,819**.\n  - The **Nifty50** fell **301 points** (1.24%) to **23,948**, retreating below the **24,000 mark**.\n  - Market capitalization of listed companies dropped by ₹8.5 lakh crore, totaling ₹421.13 lakh crore.\n\n- **Geopolitical Impact:**\n  - Increased geopolitical tensions between India and Pakistan have led experts to recommend caution for investors.\n  - The impact of the Kashmir attack has heightened concerns regarding stability in the region.\n\n- **Sector Performance:**\n  - Except for IT and Auto, all major sectors traded in negative territory.\n  - The Nifty indices in sectors such as Private Banking, Healthcare, Pharmaceuticals, and FMCG saw declines of up to 0.8%.\n  - Waaree Energies declined sharply by 8.8% amid increased share trading following the expiration of a shareholder lock-in period.\n\n- **Investor Insights:**\n  - **Devarsh Vakil**, Head of Prime Research at HDFC Securities, noted indicators of investor caution, with Foreign Portfolio Investors (FPIs) raising their long-to-short ratio.\n  - Support for Nifty is anticipated around the **23,900-24,000** range, with resistance levels identified at **24,360** and **24,545**.\n\n- **Global Market Trends:**\n  - Asian markets indicated positive momentum, with some gains expected due to softening of U.S.-China trade tensions.\n  - The U.S. market also showed resilience with major tech firms exceeding profit expectations, particularly Google’s parent company, Alphabet.\n\n- **Foreign Investment Trends:**\n  - FPIs remained net buyers for the seventh consecutive session, contributing ₹8,251 crore ($968 million) to Indian equities.\n\n- **Commodity Markets:**\n  - Crude oil prices edged higher but showed signs of a weekly loss influenced by anticipated increases in OPEC+ output and fluctuating U.S. tariffs.\n\n- **Currency Updates:**\n  - The Indian rupee appreciated by **18 paise** to **85.15** against the US dollar.\n\nThe combination of local geopolitical instability and global market influences continues to shape investor strategies within the Indian equity landscape."
  },
  {
    "title": "Buy J B Chemicals & Pharmaceuticals, target price Rs 2,225:  JM Financial",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/buy-j-b-chemicals-amp-pharmaceuticals-target-price-rs-2225-jm-financial/articleshow/120589983.cms",
    "summary": "JM Financial has issued a **buy recommendation** for J B Chemicals & Pharmaceuticals, with a target price set at **Rs 2,225**, significantly higher than its current trading price of **Rs 1,608.45**. The brokerage retains optimism despite recent discussions regarding a potential ban on **ranitidine products**, including J B Chemicals' flagship brand, **Rantac**. \n\nThe key highlights from the analysis include:\n\n• **Market Position**: J B Chemicals, established in 1976, is classified as a mid-cap firm with a market capitalization of **Rs 25,050.02 crore**.\n\n• **Financial Performance**: In the last quarter ending December 2024, the company recorded a consolidated total income of **Rs 971.49 crore**, reflecting a decline of **3.87%** from the previous quarter but an increase of **14.04%** year-on-year. The net profit after tax for the same period was **Rs 162.49 crore**.\n\n• **Ranitidine Product Controversy**: Recent media coverage indicated that an expert panel has suggested a suspension on the manufacturing and sale of ranitidine, which is under review by the **Drug Controller General of India (DCGI)**. The panel's assessment revealed that **21 out of 42 samples** exceeded acceptable levels of **N-nitrosodimethylamine (NDMA)**. However, analysts believe that a widespread ban on ranitidine is unlikely, citing that the acute nature of Rantac's prescription, combined with its significant benefits outweighing potential risks, supports its continued availability.\n\n• **Impact Assessment**: Should a complete ban be enacted, J B Chemicals could see a **5-6% reduction** in revenue and a **4-6% decrease** in EBITDA for fiscal years **2026/27**. To mitigate any adverse effects, the company might consider launching **Famotidine** as an alternative under the Rantac brand, similar to precedents in the industry.\n\n• **Stakeholder Composition**: As of March 31, 2025, promoters of J B Chemicals hold **47.84%** of the company, while foreign institutional investors (FIIs) and domestic institutional investors (DIIs) own **18.3%** and **18.71%**, respectively.\n\nOverall, JM Financial's assessment projects a positive outlook for J B Chemicals, positioning it as a viable investment option within the pharmaceutical sector amidst regulatory uncertainties."
  },
  {
    "title": "Google parent Alphabet beats quarterly revenue estimates",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/google-parent-alphabet-beats-quarterly-revenue-estimates/articleshow/120604396.cms",
    "summary": "Alphabet, Google's parent company, has reported a notable **$70 billion share buyback** following a strong performance in their first-quarter earnings that exceeded estimates. The revenue reached **$90.23 billion**, surpassing analyst expectations of **$89.12 billion**. This growth was primarily driven by the digital advertising sector, which generated **$66.89 billion**—an **8.5% increase** year-over-year, albeit a slowing growth rate compared to the previous quarter's **10.6%**. \n\nKey details include:\n\n• **Google Cloud Performance**: Revenue rose by **28%** to **$12.26 billion**, slightly under the anticipated revenue of **$12.27 billion**.\n• **Market Reactions**: Following the earnings report, shares of Alphabet saw a **6% increase** in extended trading hours.\n• **Advertising Market Outlook**: Despite economic concerns and potential downturns due to trade policies, analysts maintain confidence in the resilience of the digital advertising market.\n\nThis performance highlights Alphabet's strong positioning in the highly competitive landscape of digital services, particularly in maximizing revenue from advertising, which constitutes approximately **75%** of its total income."
  },
  {
    "title": "Gensol Engineering’s retail, FII holdings spiked weeks before Sebi crackdown",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/gensol-engineerings-retail-fii-holdings-spiked-weeks-before-sebi-crackdown/articleshow/120604382.cms",
    "summary": "Gensol Engineering has faced significant scrutiny recently, particularly following a surge in retail and foreign institutional investor (FII) holdings prior to the Securities and Exchange Board of India (Sebi) issuing a critical interim order against the company for corporate governance failures and fund diversion. \n\n**Investor Trends:**\n• Between December 2024 and March 2025, the stake of retail investors increased markedly from 23.44% to 30.68%, demonstrating a robust 7.24 percentage point rise in just one quarter.\n• Similarly, FII holdings grew from 0.63% to 4.88% during this timeframe.\n• This investor influx coincided with a 1:10 stock split in January 2025 that made shares more accessible to smaller investors, amidst a rally in clean energy and electric vehicle stocks.\n\n**Regulatory Actions and Financial Irregularities:**\n• Sebi's investigation unveiled that Gensol misappropriated approximately ₹977.75 crore intended for electric vehicle acquisition. Only a fraction of the planned vehicles were actually procured, with 4,704 out of 6,400 intended purchases made.\n• Allegations surfaced regarding the company diverting over ₹200 crore to personal expenses, including luxury items linked to promoter-related entities.\n• The regulatory body highlighted instances of falsified documentation and a blatant misuse of company funds, leading Sebi to impose sanctions, which included barring the company's promoters from the securities market and mandating a forensic audit.\n\n**Credit Rating Downgrades:**\n• As a direct consequence of these findings, credit ratings for Gensol’s bank facilities were reassessed. CARE Ratings downgraded ratings to CARE D, indicating high credit risk and potential defaults.\n• ICRA followed suit, downgrading various loan facilities, raising concerns over the company's financial stability.\n\n**Implications for Investors:**\n• Many investors had invested in Gensol without awareness of the impending governance issues, highlighting a significant failure in corporate transparency.\n• Analysts caution that the situation could replicate in other companies where aggressive capital-raising measures and stock splits mask underlying financial distress.\n\nIn conclusion, Gensol Engineering stands at a critical juncture, facing severe regulatory scrutiny and financial instability, which has alarmed investors and analysts alike. The unfolding situation underscores the importance of due diligence and transparency in corporate governance, particularly as rising investor interest can obscure potential risks."
  },
  {
    "title": "Stocks to buy today: Antique reduces target price on Cyient; Motilal Oswal sees 34% upside in Tech Mahindra post Q4",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-antique-reduces-target-price-on-cyient-motilal-oswal-sees-34-upside-in-tech-mahindra-post-q4/articleshow/120604328.cms",
    "summary": "Analysts from leading brokerage firms maintain bullish perspectives on select IT stocks, including Cyient, Persistent Systems, and Tech Mahindra, despite varying performances in the recent March quarter. The recommendations are based on strong deal pipelines, robust margin delivery, and positive long-term growth outlooks. \n\n• **Cyient:** \n  - **Rating:** Buy \n  - **Target Price:** Rs 1,675, adjusted from Rs 1,900\n  - **Current Price:** Rs 1,243 \n  - **Potential Upside:** 34%\n  - **Analysis:** The downgrade reflects a weak quarterly performance with visibility issues in key sectors like connectivity and transportation. Recent earnings missed estimates, prompting a 6% cut in earnings per share (EPS) forecasts for FY26 and FY27.\n\n• **Persistent Systems:**\n  - **Rating:** Buy \n  - **Target Price:** Rs 6,450 \n  - **Current Price:** Rs 5,157 \n  - **Potential Upside:** 25%\n  - **Analysis:** The company has demonstrated steady margins and a strong growth trajectory, with projected USD revenue CAGR of 19% from FY25 to FY27. Recent revisions also upwardly adjusted FY27 earnings.\n\n• **Tech Mahindra:** \n  - **Rating:** Buy \n  - **Target Price:** Rs 1,950 \n  - **Current Price:** Rs 1,446 \n  - **Potential Upside:** 34%\n  - **Analysis:** Although revenue estimates were missed, Tech Mahindra achieved stronger margins, highlighting resilience in the BFSI sector. Analysts express optimism about ongoing restructuring and potential recovery in telecom segments.\n\nOverall, these recommendations underscore investor confidence in the capacity for growth within these companies, despite recent challenges, indicating favorable investment opportunities contingent upon robust performance metrics and market analysis."
  },
  {
    "title": "SBI Cards Q4 Results Review: Credit Cost Decline Brings Relief, But Valuations Remain A Concern",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/sbi-cards-q4-review-credit-cost-decline-brings-relief-but-valuations-remain-a-concern",
    "summary": "SBI Cards and Payment Services Ltd. reported a mixed performance in its fourth-quarter results for fiscal year 2025. The company achieved a **net profit of Rs 530 crore**, reflecting a **19% year-on-year decline** but a commendable **39% increase quarter-on-quarter**, surpassing analysts' expectations by 13%-15%. Significant factors contributing to this performance include:\n\n• **Decrease in Credit Costs:** The company observed a reduction in credit costs, dropping to **9.0% from 9.5% quarter-on-quarter**, after experiencing upward pressure for eight consecutive quarters.\n\n• **Net Interest Margins (NIM):** NIMs improved by **54 basis points sequentially to 11.2%**, exceeding projections, which aided in offsetting operational challenges.\n\n• **Operational Expenses:** A drop in operational expenses aided the overall profit, indicating better cost management strategies employed by the management.\n\nAnalyst reactions vary: \n\n• **Macquarie:** Holds an ‘outperform’ rating, setting a target price of **Rs 1,000**. The firm noted that while credit costs aligned with expectations, the increase in NIMs and enhanced cost efficiency bolstered the earnings outlook.\n\n• **Morgan Stanley:** Maintains an ‘equal-weight’ rating but is cautious, raising its price target to **Rs 775** from **Rs 685**, citing a reduction in the cost of equity and some positive earnings revisions. They highlight improvements in asset quality metrics but express concern over the uncertain long-term trajectory of credit costs.\n\nAsset quality metrics reveal a decrease in Stage 2 Non-Performing Assets (NPAs) from **5.6% to 5.0%** and Stage 3 NPA from **3.2% to 3.1%**. The revised Expected Credit Loss (ECL) model has led to increased provisions for Stage 2 while reducing coverage for Stage 3, complicating predictions about normalized credit costs moving forward.\n\nWhile both brokerages acknowledge the relief from credit costs as a positive sign, they present differing views on future stock valuation dynamics. Morgan Stanley notes that the shares are relatively expensive, with a trading multiple of **33 times FY26 estimated P/E** and **25 times FY27 estimated P/E**, suggesting potential overvaluation given the company's recovery pace outlook. Conversely, Macquarie remains optimistic about further upside potential.\n\nInvestors are advised to closely monitor the evolving trends in credit costs and operational efficiency as these will be crucial in determining the sustainability of SBI Cards' financial health and stock performance moving forward."
  },
  {
    "title": "Macrotech Developers shares in focus after Q4 net profit jumps 38.5% to Rs 922 crore",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/macrotech-developers-shares-in-focus-after-q4-net-profit-jumps-38-5-to-rs-922-crore/articleshow/120604306.cms",
    "summary": "Macrotech Developers has recently reported a significant **38.5% year-on-year increase** in its net profit for Q4FY25, amounting to **Rs 921.7 crore**, up from **Rs 665.5 crore** in the same quarter the previous year. This growth has been largely attributed to strong pre-sales, enhanced profit margins, and ongoing demand in key markets such as the **Mumbai Metropolitan Region (MMR)**, Pune, and Bengaluru. \n\nKey Financial Highlights:\n• **Revenue Growth:** Revenue from operations saw a **5.1% increase**, reaching **Rs 4,224.3 crore**.\n• **EBITDA Performance:** EBITDA rose by **16.6%**, resulting in an increase in margins to **28.9%** from **26.1%** in the previous year. This improvement indicates better realizations and improved cost efficiencies.\n• **Sales Bookings:** The company reported a **21% rise** in sales bookings for FY25, totaling **Rs 17,630 crore**, fueled by robust customer collections of **Rs 14,490 crore**, which reflects a **29% growth**.\n• **Debt Management:** Macrotech managed to reduce its net debt by **7%**, now standing at **Rs 3,990 crore**, despite making investments in **10 new land parcels**, cumulatively valued at **Rs 23,700 crore**.\n\nDividends and Growth Focus:\n• The company's board has proposed a final dividend of **Rs 4.25 per share**, signaling confidence in ongoing growth initiatives. Macrotech maintains a focus on expanding its affordable and mid-income housing portfolio, which represents approximately **60% of total revenue**.\n\nMarket Outlook:\n• Analysts project an average target price of **Rs 1,406** for Macrotech Developers, suggesting a potential **6% upside** from its current trading level. The stock has a 'Buy' rating based on consensus from **18 analysts**. As of the last session, shares closed at **Rs 1,320.3**, reflecting a **19% gain** in two weeks and a **191% increase** over the last two years, with the company’s market capitalization valued at **Rs 1,31,720 crore**.\n\nThrough these latest developments, Macrotech Developers is positioned strategically within the real estate market, reflecting both strong financial management and growth strategies tailored to current market dynamics."
  },
  {
    "title": "Smart money's smallcap secret: 13 stocks FIIs & MFs can't stop buying in FY25",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/smart-moneys-smallcap-secret-13-stocks-fiis-mfs-cant-stop-buying-in-fy25/articleshow/120604279.cms",
    "summary": "Foreign institutional investors (FIIs) and mutual funds (MFs) have shown consistent interest in 13 smallcap stocks during Fiscal Year 2025, indicating a robust investment trend. Notable stocks include Archean Chemical, Paradeep Phosphates, and Pokarna, reflecting significant increases in institutional holdings, with Pokarna's MF stake rising from 7.45% to 11.77% and delivering a return of 108% over the past year. Paradeep Phosphates has seen MFs increase their ownership to 24.06%, contributing to a 98% return.\n\nDespite this strong performance, analysts warn that smallcap valuations have reached elevated levels, largely fueled by momentum rather than underlying earnings growth. Reports suggest that the Nifty small cap index is trading above its five-year median price-to-earnings (P/E) and price-to-book (P/B) multiples, raising concerns about sustainability. Analysts recommend that investors exercise caution and prioritize company fundamentals—such as revenue growth and debt levels—before making investment decisions.\n\nKey considerations for investors include:\n• **Institutional Confidence:** Consistent buying by institutions can signal strong fundamentals but does not guarantee future performance.\n• **Valuation Analysis:** Investors are advised to compare current P/E and P/B ratios against historical averages and sector peers to ascertain a better entry point and margin of safety.\n• **Market Sentiment:** The recent recovery in smallcaps may be more sentiment-driven than based on actual business performance, which underscores the risk of potential revaluation.\n\nIn conclusion, while the data underscores notable institutional interest in certain smallcap stocks, a prudent approach encompassing thorough fundamental analysis is essential to navigate potential market volatility and make informed investment decisions."
  },
  {
    "title": "IEX shares rise 5% as PAT jumps 21% YoY; co achieves highest quarterly traded electricity volume",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-in-focus-after-pat-jumps-21-yoy-co-achieves-highest-quarterly-traded-electricity-volume/articleshow/120604194.cms",
    "summary": "IEX shares experienced a notable rise of **5.5%**, reaching an intraday high of **₹201.25** following the company's announcement of a **21.1%** year-on-year increase in profit after tax (PAT), which amounted to **₹117.1 crore** for the fourth quarter of the financial year 2025 (Q4FY25). This performance aligns with the company's achievement of its highest-ever electricity trading volume of **31.7 billion units (BU)** during the same quarter.\n\nKey Financial Highlights:\n• **Q4FY25 Consolidated Revenue:** Increased by **17%** year-on-year, reaching **₹174.6 crore**, compared to **₹149.3 crore** in Q4FY24.\n• **Full Fiscal Year Revenue (FY25):** Consolidated revenue rose by **19.3%**, totaling **₹657.4 crore**, up from **₹550.8 crore** previously.\n• **Profit After Tax Comparison:** The latest PAT of **₹117.1 crore** compares favorably to **₹96.7 crore** in the corresponding quarter of the previous fiscal year.\n\nFurther developments included IGX, IEX's gas market subsidiary, achieving record gas trading volumes of **60 million MMBtu** in FY25, reflecting a **47%** increase year-on-year. Its PAT also saw robust growth of **34.3%**, advancing from **₹23 crore** in FY24 to **₹31 crore** in FY25.\n\nDuring Q4FY25, IGX traded a total volume of **20.2 million MMBtu**, significantly higher than the **8.7 million MMBtu** recorded in Q4FY24, marking a **132%** year-on-year growth. The PAT for IGX was reported at **₹8.9 crore**, up from **₹4.4 crore** in the same quarter the previous year.\n\nIn light of these financial results, IEX's board of directors also announced a dividend of **₹1.5 per share**.\n\nPerformance Metrics:\n• **1-Year Share Performance:** Increased by **23.98%**\n• **Year-to-Date (YTD):** Gained **5.80%**\n• **6-Month Return:** Stood at **3.53%**\n• **3-Month Increase:** Recorded at **12.60%**\n• **1-Month Performance:** Increased by **7.10%**\n\nThese results reflect IEX's strengthened position in the market and its focused strategy for growth within the energy sector."
  },
  {
    "title": "IndusInd Bank shares in focus after clarification on engagement of EY for forensic audit",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-clarification-on-engagement-of-ey-for-forensic-audit/articleshow/120604142.cms",
    "summary": "IndusInd Bank's shares have recently attracted attention following the bank's clarification concerning its engagement with the global professional services firm EY to conduct a second forensic audit. This audit specifically aims to investigate a significant discrepancy of ₹600 crore related to the accrual of interest income within the bank's microfinance portfolio. \n\nIn a regulatory filing, IndusInd Bank clarified that it has not formally engaged EY for a forensic audit, as previously reported. Instead, EY is assisting the bank's Internal Audit Department (IAD) in reviewing certain records as part of the normal process involved in finalizing accounts. The IAD is currently evaluating the microfinance business to address specific internal concerns. The bank emphasized that EY's involvement is merely to support the ongoing internal review, rather than initiating a forensic investigation.\n\nThe clarification follows earlier reports suggesting that EY was commissioned for in-depth forensic audits addressing both the microfinance portfolio discrepancy and irregularities in accounting related to forex derivatives being scrutinized by Grant Thornton Bharat. Following this news, shares of IndusInd Bank saw an increase of 3.2%, closing at ₹819.65 on the BSE.\n\nKey Points:\n• **Engagement of EY:** Formal clarity on lack of a forensic audit engagement.\n• **Focus of Audit:** ₹600 crore discrepancy concerning microfinance interest income.\n• **Role of EY:** Assistance in routine audits rather than forensic investigation.\n• **Recent Share Performance:** IndusInd Bank shares rose by 3.2% post-announcement, indicating investor confidence may have been positively affected by the clarification."
  },
  {
    "title": "I-Sec maintains Hold call on LTIMindtree, lowers target price to Rs 4,410",
    "url": "https://economictimes.indiatimes.com/markets/stocks/recos/i-sec-maintains-hold-call-on-ltimindtree-lowers-target-price-to-rs-4410/articleshow/120589419.cms",
    "summary": "ICICI Securities has maintained a **Hold** call on **LTIMindtree** and revised its target price to **Rs 4,410** from the previous **Rs 4,510** due to a muted financial performance in the last quarter. Key points are:\n\n• **Revenue Performance:** For the quarter ending March 31, 2025, LTIMindtree reported a **Consolidated Total Income** of **Rs 10,022.90 crore**, reflecting a **1.51%** increase from the previous quarter and a **10.14%** rise from the same period last year. However, the revenue growth was below expectations, attributed to several adverse factors:\n  - **Delayed Deals:** The revenue suffered from delays in deal closures.\n  - **Healthcare Vertical Ramp-Down:** A reduction in healthcare-related projects adversely affected earnings.\n  - **Top Client Revenue Decline:** There was a notable decline in revenue from top clients, which affected overall growth.\n\n• **Margins:** The company's margin stayed flat at **13.8%**, consistent with estimates from ICICI Securities. The management anticipates potential improvements in the upcoming quarter due to strategic shifts aimed at enhancing operational efficiency.\n\n• **Future Outlook:** The brokerage projects a cautionary perspective for FY26, expecting a modest **6.8% YoY USD growth** and anticipating a **67 basis points QoQ EBIT margin expansion** in Q1 FY26. It has adjusted earnings per share (EPS) estimates downward by **3-6%**.\n\n• **Stock Information:** As of March 31, 2025, LTIMindtree has about **30 crore shares** outstanding and is categorized as a large-cap company, with a market capitalization of approximately **Rs 134,329.94 crore**.\n\n• **Promoter and FII Holdings:** As of the specified date, **promoters held** **68.57%** ownership in the company, while foreign institutional investors (FIIs) and domestic institutional investors (DIIs) held significant percentages as well.\n\nOverall, while the immediate financial metrics indicate a struggle, management's strategic focus may yield better results as they navigate these challenges."
  },
  {
    "title": "These 5 stocks are showing RSI Trending Up on April 24",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-stocks-are-showing-rsi-trending-up-on-april-24/slideshow/120604104.cms",
    "summary": "Nifty's current benchmark is at **23,967.55**, reflecting a decrease of **279.16** points. Among featured mutual funds, the **Canara Robeco ELSS Tax Saver Regular - Growth** has delivered a **5-year return of 23.29%**, while the **HSBC Large Cap Fund Direct-Growth** stands at **22.11%** for the same period.\n\nOn **April 24**, five stocks from the **Nifty500** identified through an RSI (Relative Strength Index) scan exhibited upward momentum:\n\n• **Sonata Software**\n  - Current RSI: **53.09**\n  - Previous RSI: **41.79**\n  - Current Market Price (CMP): **Rs 355.50**\n\n• **JSW Infrastructure**\n  - Current RSI: **52.87**\n  - Previous RSI: **49.39**\n  - CMP: **Rs 301.25**\n\n• **Apar Industries**\n  - Current RSI: **51.29**\n  - Previous RSI: **46.74**\n  - CMP: **Rs 5,504**\n\n• **Zydus Lifesciences**\n  - Current RSI: **51.14**\n  - Previous RSI: **48.29**\n  - CMP: **Rs 880.25**\n\n• **JB Chemicals & Pharmaceuticals**\n  - Current RSI: **50.31**\n  - Previous RSI: **47.20**\n  - CMP: **Rs 1,609.10**\n\nThe **RSI trend above 50** indicates enhancing momentum, which may signal potential buying opportunities within these stocks, reflecting a bullish outlook for investors. \n\nFurthermore, the market movements noted include various stocks currently showing fluctuations and potential actions, such as investments, dividends, and other market activities involving prominent companies like Tata Motors, Infosys, and HDFC Bank, highlighting the dynamic environment of the Indian stock market."
  },
  {
    "title": "SBI Life shares in focus after Q4 PAT comes in flat at Rs 813 crore",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-shares-in-focus-after-q4-pat-comes-in-flat-at-rs-813-crore/articleshow/120604060.cms",
    "summary": "Shares of SBI Life Insurance witnessed a significant increase of 9.5% on the Bombay Stock Exchange, reaching an intraday high of ₹1,763, following the announcement of their Q4 FY25 financial results. The company reported a marginal **0.3%** year-on-year (YoY) rise in consolidated net profit, totaling **₹813.5 crore** compared to ₹810.8 crore during the same period last year. \n\nKey Financial Highlights:\n• **Net premium income** experienced a decline of **5%** YoY, amounting to **₹23,861 crore**, down from ₹25,116 crore in the previous year.\n• **First-year premiums** increased by **7.3%** YoY, rising to **₹4,858.7 crore** from ₹4,528.3 crore.\n• **Renewal premiums** saw a robust **12.9%** increase YoY to **₹14,680.3 crore**, compared to ₹13,003.2 crore previously.\n• Conversely, **single premium income** plummeted by **42.1%** YoY, falling to **₹4,462.5 crore** from ₹7,709.5 crore.\n\nOther Notable Metrics:\n• **Assets Under Management (AUM)** grew by **15%** YoY, reaching **₹4.48 lakh crore** as of March 31, 2025, compared to ₹3.89 lakh crore the year prior.\n• The **13th-month persistency ratio** improved to **86.64%**, strengthening from **85.76%** a year earlier, while the **61st-month persistency ratio** also increased to **61.51%** from **57.81%** YoY.\n\nIn addition to these achievements, the company reported a **17.2%** rise in net commission to **₹998 crore** from ₹851 crore last year, showcasing a growth in revenue generation capabilities despite challenges in certain premium segments. \n\nOverall, while SBI Life's net profit showed slight improvement, the sharp decline in single premium income raises concerns, presenting a mixed bag of results for the insurer."
  },
  {
    "title": "ETMarkets PMS Talk | Rs 1 cr in April FY25 became Rs 1.38 cr: Here’s how Pawan Bharaddia is building wealth for investors",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-pms-talk-rs-1-cr-in-april-fy25-became-rs-1-38-cr-heres-how-pawan-bharaddia-is-building-wealth-for-investors/articleshow/120576870.cms",
    "summary": "The article discusses Pawan Bharaddia, Co-founder and CIO of Equitree Capital, and his successful investment strategy that converted an initial investment of ₹1 crore in April FY25 into ₹1.38 crore by the end of the financial year, achieving a notable return of 38%. This performance predominantly stemmed from a disciplined, long-term strategy focused on investing in high-growth businesses, emphasizing earnings growth driven by profit rather than market sentiment.\n\n**Key Insights:**\n\n• **Investment Philosophy:** Bharaddia's approach is founded on identifying fundamentally robust, scalable companies early, thus allowing for significant positions and sustained growth over time. Over the last five years, their strategy has realized a compounded annual growth rate (CAGR) of 52%.\n\n• **Thematic Focus:** The portfolio is strategically aligned with structural themes in manufacturing, engineering, and ancillary sectors. This positioning benefits from strong operational leverage and the ability of firms to capture market share through innovation, such as solar-powered agricultural technologies.\n\n• **Earnings Performance:** The portfolio exhibited stability, with a median profit growth of approximately 19% in FY25's first nine months, contrasting with broader market volatility. This solid performance is attributed to valuation discipline and a focus on earnings rather than speculative bets.\n\n• **Cash Management:** Bharaddia highlights the importance of maintaining liquidity, particularly during periods of market correction. By keeping 60–70% of their cash reserves liquid, they managed to mitigate market downturns, allowing them to capitalize on attractive buying opportunities.\n\n• **Risk Mitigation:** Their investment framework emphasizes understanding management quality and operational history, ensuring they mitigate potential risks effectively. Bharaddia's method combines rigorous due diligence with a focus on companies with a robust financial foundation and minimal debt.\n\n**Market Outlook:**\n\nBharaddia remains optimistic about future growth in sectors like manufacturing and infrastructure due to supportive government policies and an expected increase in earnings growth between 25% and 30% for FY26. However, he acknowledges potential global challenges, such as trade policy shifts and geopolitical risks that may affect market dynamics.\n\nOverall, Bharaddia’s disciplined approach, focus on earnings, and strategic management of risk through a sound investment philosophy continue to foster substantial wealth creation for his investors, showcasing a resilient investment strategy in an unpredictable market environment."
  },
  {
    "title": "Using market rally to book profits and rebalance: Ambit AMC CEO Sushant Bhansali",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/using-market-rally-to-book-profits-and-rebalance-ambit-amc-ceo-sushant-bhansali/articleshow/120590963.cms",
    "summary": "Current updates from the financial markets indicate that the Nifty index stands at **24,090.50**, showing a decrease of **156.21 points**. Among the featured mutual funds, the **Canara Robeco ELSS Tax Saver Regular - Growth** fund has recorded a notable **5-year return of 23.29%**, while the **HSBC Large Cap Fund Direct-Growth** follows closely with a **5-year return of 22.11%**.\n\nIn a recent interview, Sushant Bhansali, CEO of **Ambit Asset Management**, shared insights on leveraging the current market rally to optimize portfolio performance. Key highlights include:\n\n• **Long-Term Prospects**: Bhansali asserts India's position as one of the fastest growing economies, predicting strong earnings growth amid an ongoing focus on growth at reasonable valuations.\n\n• **Investment Strategy**: The strategy emphasizes avoiding cash calls, using market dips effectively to participate in India's growth story while rebalancing portfolios to enhance performance and manage risks.\n\n• **Sector Focus for FY26**: He identifies the consumption sector—particularly the retail and personal income sectors—as poised for significant growth due to favorable tax concessions and historically low valuations, akin to previous opportunities in the banking sector.\n\n• **Market Sentiment**: Bhansali acknowledges the volatility driven by geopolitical events, stressing that pivotal factors such as US Dollar Index and corporate earnings reports will be influential in shaping market performance going forward.\n\n• **Investment Opportunities**: Despite concerns over export-oriented sectors like IT and pharma due to global conditions, Bhansali suggests that selective opportunities may still exist, especially as domestic consumption is expected to rise due to tax incentives and lower interest rates.\n\n• **Emerging Market Dynamics**: As geopolitical tensions between the US and China continue, he highlights India's potential to attract foreign investments as a significant beneficiary of the global trade landscape.\n\nThis analysis frames the current investment climate as a period where strategic reallocation and selective opportunities could yield favorable outcomes for investors."
  },
  {
    "title": "Bullish Momentum: 4 stocks with White Marubozu Pattern on April 24",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-4-stocks-with-white-marubozu-pattern-on-april-24/slideshow/120604038.cms",
    "summary": "On April 24, four stocks with a market capitalization exceeding Rs 1,000 crore were identified on the bullish scanner featuring the **White Marubozu pattern**, as reported by stockedge.com's technical scan data. \n\n**Overview of the White Marubozu Pattern:**\n- A White Marubozu is characterized by a long white (or green) candlestick.\n- Key Features:\n  • **Opening Price:** The lowest within the observed period.\n  • **Closing Price:** The highest within the same period.\n  • **Shadows:** Typically, it has no upper shadow and a minimal or non-existent lower shadow, signifying dominant buying pressure throughout the trading session.\n- **Interpretation:** Traders often view this pattern as a signal that buyers maintained control from the market's opening to its closing, influencing their future price movement decisions.\n\n**Identified Stocks:**\n1. **Transport Corporation Of India**\n   • Closing Price: Rs 1165.5 \n   • Change: +6.88%\n   \n2. **Tata Elxsi**\n   • Closing Price: Rs 5918 \n   • Change: +4.48%\n\n3. **Cosmo First**\n   • Closing Price: Rs 625.75 \n   • Change: +3.78%\n\n4. **RBL Bank**\n   • Closing Price: Rs 198.31 \n   • Change: +3.46%\n\nThese stocks are indicative of bullish market sentiment, as per the technical analysis employed by traders to gauge potential future trends in stock prices. This information may be useful for investors looking to make informed decisions based on observed market patterns."
  },
  {
    "title": "SBI Card shares in focus after Q4 profit falls 19% YoY to Rs 534 crore; revenue rises 7.5%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-card-shares-in-focus-after-q4-profit-falls-19-yoy-to-rs-534-crore-revenue-rises-7-5/articleshow/120603896.cms",
    "summary": "SBI Cards and Payment Services reported a **19.4% year-on-year decline** in net profit for **Q4 FY25**, dropping to **Rs 534.2 crore** from **Rs 662.4 crore** in the previous year. This significant decrease is primarily attributed to increasing credit costs and provisions amidst a difficult consumer lending environment.\n\nDespite the profit drop, the company's **revenue from operations increased by 7.5%**, reaching **Rs 4,674 crore**, driven by an uptick in card usage and fee-based income. Key developments include:\n• The addition of **1.109 million new accounts**, compared to **1.029 million** a year earlier.\n• An overall increase of **10%** in total cards-in-force, which amounted to **2.08 crore** as of March 2025.\n• Total customer spending grew by **11%**, reaching **Rs 88,365 crore** in Q4 FY25.\n\n### Asset Quality and Financial Health\n• The **Gross Non-Performing Asset (NPA) ratio** stood at **3.08%**, with a **Net NPA** of **1.46%**.\n• The provision coverage ratio for the quarter was **53.46%**.\n• Impairment losses and bad debt expenses surged **48% year-on-year** to **Rs 4,872 crore** for the financial year, influencing a **20% decline** in full-year Profit After Tax (PAT), which totaled **Rs 1,916 crore**, down from **Rs 2,408 crore** the previous year.\n\n### Financial Overview for FY25\n• Total income for the financial year rose by **7%** to **Rs 18,637 crore**.\n• Finance costs escalated by **22%** to **Rs 3,178 crore**, attributed to elevated interest rates.\n• The company's gross advances (credit card receivables) reached **Rs 55,840 crore**, and net worth improved to **Rs 13,853 crore** from **Rs 12,156 crore** a year earlier.\n\n### Market Position\nAnalysts suggest a target price of **Rs 804** for SBI Card shares, indicating a **13% downside** from current levels. The stock holds a **'Hold' rating** based on input from **24 analysts**. As of the last trading session, SBI Card shares closed at **Rs 926.9**, reflecting a **37% increase** year-to-date and a **24% rise** over the past year. The company's market capitalization is currently **Rs 88,181 crore**. \n\nOverall, while SBI Cards faces challenges related to credit costs and asset quality, it continues to expand its customer base and maintain revenue growth through increased card usage and account acquisitions."
  },
  {
    "title": "Stocks To Buy Today: Hindustan Zinc, UltraTech Cement, Federal Bank, Godrej Agrovet, Gujarat Gas",
    "url": "https://www.ndtvprofit.com/markets/stocks-to-buy-today-hindustan-zinc-ultratech-cement-federal-bank-godrej-agrovet-gujarat-gas",
    "summary": "• Analysts recommend buying shares from **Hindustan Zinc**, **UltraTech Cement**, **Federal Bank**, **Godrej Agrovet**, and **Gujarat Gas**, based on recent evaluations. \n\n• **Hindustan Zinc Ltd.**\n  - Current price: Rs 495\n  - Target price: Rs 495 \n  - Stop loss: Rs 440\n  - Analyst sentiment: Mixed, with four buys, four holds, and seven sells according to 15 analysts.\n\n• **UltraTech Cement Ltd.**\n  - Current price: Rs 12,159\n  - Target price: Rs 12,900\n  - Stop loss: Rs 11,800\n  - Positive sentiment with 37 out of 44 analysts recommending a buy.\n\n• **Federal Bank Ltd.**\n  - Current price: Rs 201\n  - Target price: Rs 210\n  - Stop loss: Rs 198\n  - A solid buy recommendation with 39 out of 43 analysts advising a purchase.\n\n• **Godrej Agrovet**\n  - Current price: Rs 795\n  - Target price: Rs 830\n  - Stop loss: Rs 780\n  - Recent decline in stock value, with shifting analyst recommendations.\n\n• **Gujarat Gas Ltd.**\n  - Current price: Rs 460\n  - Target price: Rs 485\n  - Stop loss: Rs 435\n  - Mixed analyst recommendations: nine buys, 16 sells, and seven holds.\n\n• The overall market reflects a cautious yet optimistic outlook, indicating potential growth pathways for investors willing to navigate market volatility. Investors are encouraged to consider personal financial circumstances and consult with financial advisors before making investment decisions."
  },
  {
    "title": "Google-parent Alphabet quarterly earnings lifted by cloud and AI",
    "url": "https://www.thehindu.com/sci-tech/technology/google-parent-alphabet-quarterly-earnings-lifted-by-cloud-and-ai/article69489348.ece",
    "summary": "Google's parent company, Alphabet, reported a quarterly profit of **$34.5 billion** on April 25, 2025, driven significantly by revenue from its cloud computing and artificial intelligence (AI) sectors. Here are the main highlights of the earnings report:\n\n• **Overall Revenue Growth**: Alphabet's total revenue reached **$90.2 billion**, marking a **12% increase** compared to the previous year.\n\n• **Cloud Unit Performance**: The company’s cloud segment saw remarkable growth with a **28% increase** in revenue, totaling **$12.3 billion**.\n\n• **AI Influence**: CEO Sundar Pichai attributed this strong performance to the company's comprehensive approach to AI, emphasizing the release of their latest software, Gemini, as a cornerstone for innovation and growth.\n\n• **Market Reaction**: Following the earnings announcement, Alphabet's shares saw a **rise of over 3%** in after-hours trading, which reflects investor confidence in the company's direction and performance.\n\n• **Investment in AI**: The report highlighted Alphabet's ongoing investments in data centers and AI development, amidst increasing competition and scrutiny from regulatory bodies.\n\n• **Antitrust Challenges**: Alphabet faces intense scrutiny with ongoing lawsuits from the U.S. government concerning alleged anti-competitive practices. A major focus of the legal battles is on Google’s practices with its Chrome browser and advertising technologies, with implications that could significantly impact its operations and revenue streams. Judge Amit Mehta is deliberating remedies for what has been deemed an illegal monopoly in the online search sector.\n\n• **Future Outlook**: Analysts suggest that while Google continues to thrive with its AI products, the expansive investments and legal challenges may create uncertainties about future profitability and market position.\n\nIn summary, Alphabet's latest financial results reflect a robust growth trajectory driven by advancements in cloud services and AI, even as the company grapples with regulatory and competitive challenges that could shape its future."
  },
  {
    "title": "Britannia Share Price Live Updates: Britannia's Stock Price Recap",
    "url": "https://economictimes.indiatimes.com/markets/stocks/stock-liveblog/britannia-share-price-today-live-updates-25-apr-2025/liveblog/120602566.cms",
    "summary": "• **Market Overview**: The Nifty index is currently at 24,039.35, reflecting a decline of 207.36 points.\n\n• **Featured Funds**: \n   - *Canara Robeco ELSS Tax Saver Regular - Growth*: 5-Year Return: 23.29%\n   - *HSBC Large Cap Fund Direct-Growth*: 5-Year Return: 22.11%\n\n• **Britannia Stock Performance**: \n   - **Latest Price**: The stock closed at Rs 5420.5, showing a decrease of 0.76%.\n   - **Market Capitalization**: Rs 130,813.16 crore\n   - **Trading Volume**: 244,513 shares\n   - **Price-to-Earnings Ratio**: 60.56\n   - **Earnings Per Share**: 89.55\n\n• **Price Movements**:\n   - Recent trading has shown fluctuating prices, with a current decline of approximately 1-1.27% across several updates.\n   - Notable performance includes a 5-year return of 77.0% and a 3-month return of 5.95%.\n\n• **Analytical Insights**: \n   - Britannia exhibits a consistent performance track record with impressive long-term returns.\n   - Recent developments may influence future trading dynamics.\n\n• **Dividend Information**: Historical and upcoming dividends can be explored, reflecting the company's commitment to returning value to shareholders.\n\n• **Volatility and Beta**: Britannia has recorded a six-month beta of 0.4766, indicating stability with less sensitivity to market fluctuations. \n\n• **Market Strategy**: The blend of technical and fundamental analysis aims to keep investors informed for strategic decision-making as market conditions evolve.\n\nStay updated with real-time market analyses for potential investment opportunities in Britannia amidst these fluctuations."
  },
  {
    "title": "Indian market to  emerge stronger from global trade shake-up: Daljeet Kohli",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/indian-market-to-emerge-stronger-from-global-trade-shake-up-daljeet-kohli/articleshow/120584904.cms",
    "summary": "Daljeet Kohli of Roha Asset Managers recently discussed the Indian market's unexpected rebound and its resilience amidst global trade challenges. His insights cover several key aspects:\n\n• **Market Reaction:** The Indian stock market showed a sharp rebound after an initial decline following tariff war announcements. Kohli attributes this unexpected recovery to market sentiments anticipating a rollback of tariffs, which many believe would not be as detrimental as previously expected.\n\n• **Underlying Strengths:** Kohli emphasizes that India’s inherent demographic and economic strengths position it as a potential beneficiary from the ongoing trade turbulence. He suggests that the past lapses in capitalizing on opportunities might not repeat, indicating a newfound ability to seize emerging prospects.\n\n• **Volatility and Investment Strategy:** He acknowledges potential volatility over the coming 90 days as markets react to news cycles. For investors, he recommends maintaining a level-headed approach by analyzing the impacts on individual portfolios rather than overreacting to broad market movements.\n\n• **Footing in Domestic Consumption:** Kohli advocates for a focus on domestic consumption, highlighting investments across a spectrum, from high-end luxury goods to rural consumer products. This diversification aims to mitigate risks associated with macroeconomic uncertainties.\n\n• **Cautious Approach to Financials:** In the financial sector, where several stocks have performed well due to improved economic projections, Kohli reveals limited exposure in his portfolio. He is cautious about the sustainability of gains in this sector, especially considering challenges related to funding costs and asset quality.\n\nOverall, Kohli’s perspective outlines a balanced view of navigating the complexities of current market conditions by leveraging India’s strengths while exercising caution in the face of volatility."
  },
  {
    "title": "Negative Breakout: 6 stocks cross below their 200 DMAs",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-6-stocks-cross-below-their-200-dmas/slideshow/120602583.cms",
    "summary": "On April 24, 2025, **six stocks** within the Nifty500 index fell below their **200-day moving averages (DMA)**, a technical indicator that suggests a negative trend. This development is significant for traders, as it usually signals a potential decline in stock performance based on long-term price trends. The following stocks were highlighted in this context:\n\n• **Blue Star**: \n  - 200 DMA Price: ₹1,913.84 \n  - Last Traded Price: ₹1,849.60\n\n• **360 One Wam**: \n  - 200 DMA Price: ₹1,051.17 \n  - Last Traded Price: ₹1,018.25\n\n• **Ipca Laboratories**: \n  - 200 DMA Price: ₹1,461.90 \n  - Last Traded Price: ₹1,445.70\n\n• **Piramal Pharma**: \n  - 200 DMA Price: ₹220.42 \n  - Last Traded Price: ₹219.87\n\n• **Power Grid Corporation of India**: \n  - 200 DMA Price: ₹314.60 \n  - Last Traded Price: ₹314.40\n\n• **Nava**: \n  - 200 DMA Price: ₹469.72 \n  - Last Traded Price: ₹469.55\n\nThe general consensus in the market indicates a **downward trajectory** for these stocks, reinforcing the importance of the 200 DMA as a predictive measure for investors and traders evaluating market trends."
  },
  {
    "title": "Google’s expanding AI ambitions in India clash with global antitrust scrutiny",
    "url": "https://www.thehindu.com/sci-tech/technology/googles-expanding-ai-ambitions-in-india-clash-with-global-antitrust-scrutiny/article69489330.ece",
    "summary": "Google is advancing its generative artificial intelligence (AI) capabilities in India while navigating ongoing antitrust scrutiny from U.S. regulators. The company is increasingly integrating AI into its advertising framework, seeking to innovate how brands engage with consumers. Notably, Google's enhancements focus on YouTube and related platforms, benefiting from India’s rapid digital market growth.\n\n• **Advertising Strategies and Tools**: Google's AI-driven tools aim to improve advertising effectiveness. YouTube now registers over 1 billion hours of daily viewership globally, with a significant user base in India. The shift towards Connected TVs (CTV) is prompting advertisers to embrace new formats, with reports indicating that certain ad campaigns on CTV are yielding conversion rate increases of up to 3.6 times.\n\n• **AI Enhancements in Search**: Google is also transforming its search functionalities through AI. Technologies such as Gemini, Circle to Search, and Google Lens facilitate a more interactive and predictive user experience. Brands reportedly experience improved returns on their investments thanks to these innovations.\n\n• **Antitrust Challenges**: While overseeing these advancements, Google faces escalating legal challenges in the U.S., where it has been accused of monopolizing the advertising technology market. A ruling from U.S. District Judge Leonie Brinkema suggested that Google unlawfully maintained monopoly power by acting as the intermediary in ad transactions. The Department of Justice alleges that Google's ad tools dominate the market, harming competition and inflating costs for advertisers.\n\n• **Future Implications**: The legal battles threaten to reshape Google's advertising model significantly. The current case scrutinizing its antitrust practices could result in enforced divestitures of subsidiaries like DoubleClick, which enhances Google's ad targeting capabilities. This complex dynamic raises critical discussions about the balance between innovation and market dominance across global markets, particularly as Google continues to advocate for its competitive practices. \n\nAs Google positions itself as a leader in India's digital transformation, it is essential to watch how these legal developments will affect their operational strategies and the broader tech landscape."
  },
  {
    "title": "Maruti Suzuki Q4 Preview: Revenue Seen Higher, Margins Muted",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/maruti-suzuki-q4-preview-revenue-seen-higher-margins-muted",
    "summary": "Maruti Suzuki India Ltd. is anticipated to report a **1% year-on-year decrease** in net profit for the final quarter of FY2025, amounting to approximately **₹3,857 crore**, despite an expected revenue increase of **7%** to **₹40,929 crore**. This projection is influenced by several economic factors affecting the automotive industry.\n\nKey Insights:\n• **Operational Profitability:** The operational profitability, indicated by Earnings Before Interest, Tax, Depreciation, and Amortization (EBITDA), is expected to rise by **5%** to **₹4,897 crore**. However, the EBITDA margin is likely to see a decline, shrinking from **12.25% to 11.96%** due primarily to increasing raw material costs and rising marketing expenditures connected with new model launches.\n\n• **Market Reactions:** Analysts from Nirmal Bang and IIFL suggest heightened challenges in margin management due to high commodity prices. Specifically, there’s a forecasted **30 basis points** negative impact on gross margins attributed to these commodity costs, while the volatility in the yen-to-rupee exchange rate might further contribute up to **20 basis points** of margin pressure.\n\n• **Product Mix Concerns:** The company faces challenges related to its product mix, particularly with its Sports Utility Vehicle (SUV) segment, which has seen a decrease in market share by **110 basis points** to **31.6%**.\n\n• **Discount Strategy:** Maruti's strategy to limit discounting in the face of raw material pressures might help mitigate further losses, with brokerage firm BofA predicting a sequential margin improvement.\n\n• **Volume Growth:** Domestic vehicle volumes are projected to increase by **3%** year-on-year, with exports expected to rise by **8%**. \n\nOverall, while Maruti Suzuki is managing to achieve revenue growth, the pressure on profit margins due to rising costs and a shift in product mix presents a challenging environment for the company as it approaches FY2026. The insights gathered indicate a cautious optimism tempered by significant operational challenges that need addressing moving forward."
  },
  {
    "title": "Stocks to buy in 2025: HCL Tech, Solar Industries among 5 stocks that could give 13-20% return",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-hcl-tech-solar-industries-among-5-stocks-that-could-give-13-20-return/slideshow/120601906.cms",
    "summary": "The Nifty index has benchmarked at *23,900.25*, recording a decline of *346.46*. Featured funds are highlighted, showing impressive five-year returns: \n\n• **Canara Robeco ELSS Tax Saver Regular - Growth**: 23.29%\n  \n• **HSBC Large Cap Fund Direct-Growth**: 22.11%\n\nAdditionally, leading brokerages are offering stock recommendations for potential investors over the next 12 months. Key suggestions include:\n\n• **HCL Technologies**: Rated *Outperform* with a target of **Rs 1,800**, indicating a potential upside of *13%* from its current market price of **Rs 1,594**.\n\n• **Niva Bupa Health Insurance**: Initiated coverage with a *Buy* rating, targeting **Rs 100**, reflecting an upside of *20%* from **Rs 83**.\n\n• **AU Small Finance Bank**: Maintained *Buy* rating with a target of **Rs 775**, implying a *16%* upside from **Rs 666**.\n\n• **Mahindra & Mahindra Financial Services**: Rated *ADD* with a target price of **Rs 310**, suggesting a *15%* upside from **Rs 269**.\n\n• **Solar Industries**: Rated *Buy*, with a target of **Rs 16,000**, indicating a *22%* potential upside from its current market price of **Rs 13,081**.\n\nThese insights aim to guide investors looking to capitalize on emerging opportunities across various sectors including technology, financial services, and health insurance."
  },
  {
    "title": "Waaree Energies shares in focus as lock-in ends for 15 crore shares",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-as-lock-in-ends-for-15-crore-shares/articleshow/120601715.cms",
    "summary": "Waaree Energies shares saw a **significant decline of 8.8%** to **Rs 2,590.20** during early trading, following the end of a shareholder lock-in period which made **15 crore shares** eligible for trading. This represents **53%** of the company's outstanding equity, although it does not guarantee that all shares will be sold immediately.\n\nDespite the drop in share price, the company reported strong **Q4 earnings** for the quarter ending March 31, 2025:\n• **Net profit** increased by **34.1%** year-on-year to **Rs 618.9 crore**, compared to **Rs 461.5 crore** in the prior year.\n• **Revenue from operations** surged **36.4%** to **Rs 4,003.9 crore**, up from **Rs 2,935.8 crore** a year earlier.\n• **EBITDA** more than doubled, reaching **Rs 922.6 crore**, marking a **120.6%** increase from the previous year, with an EBITDA margin improvement to **23%** from **14.3%**.\n\nFor the full financial year FY25, Waaree Energies also showcased impressive growth:\n• **Module production** hit **7.13 GW**, up from **4.77 GW** in FY24.\n• Annual revenue rose **27.62%** to **Rs 14,846.06 crore**, with profit after tax more than **doubling** to **Rs 1,932.15 crore** (a **107.08%** increase).\n\nCurrent market consensus for Waaree Energies shares has an average target price of **Rs 2,352**, indicating a potential **17% downside** from the present levels, alongside an overall rating of **'Sell'** from analysts. As of the last trading session, the stock has shown a **27% gain** over the past three months but is down **1% year-to-date** with a market capitalization of **Rs 81,601 crore**."
  },
  {
    "title": "RIL Q4 results: How to trade the stock, key price zones to watch out and more",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q4-results-how-to-trade-the-stock-key-price-zones-to-watch-out-and-more/articleshow/120601641.cms",
    "summary": "The performance of Reliance Industries Limited (RIL) is under observation as the company prepares to release its fourth quarter financial results. Shares of RIL saw an increase of 2%, reaching Rs 1,325.25, despite expectations of declining profitability attributed chiefly to its oil-to-chemicals (O2C) division. Analysts have noted that the stock has maintained a nearly 6% gain year-to-date, a relatively strong performance amid ongoing market volatility and geopolitical uncertainties.\n\nKey points to consider regarding RIL’s trading scenario include:\n\n• **Current Stock Range:** The shares have been trading between Rs 1,180 and Rs 1,340 over the past six months, with critical resistance noted at Rs 1,320 and support at Rs 1,280.\n\n• **Potential Breakouts:** A notable breakout above the Rs 1,320 resistance level could potentially lead to a short-term rally, possibly pushing prices to Rs 1,345 to Rs 1,360. Conversely, if the stock breaks below Rs 1,280, it may decline towards Rs 1,250.\n\n• **Technical Indicators:** The Relative Strength Indicator (RSI) currently indicates a neutral position, suggesting indecision in the stock's movement. Analysts recommend adopting range-bound trading strategies until clearer trends emerge.\n\n• **Long-term Prospects:** For long-term investors, it is suggested to buy on dips, particularly at the current levels or around Rs 1,230, with a stop loss set at Rs 1,150. Projections suggest that RIL could see prices reach between Rs 1,500 to Rs 1,650 over the next 10 to 12 months.\n\nInvesting in RIL carries both opportunities for growth and risks, which underscores the necessity for a detailed analysis and strategic approach to trading based on market conditions and indicators."
  },
  {
    "title": "RIL to announce Q4 results today. 5 things to watch out for in the earnings card",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-to-announce-q4-results-today-5-things-to-watch-out-for-in-the-earnings-card/articleshow/120601571.cms",
    "summary": "Reliance Industries Ltd (RIL) is set to announce its fourth quarter results today, with expectations of a decline in profitability largely attributed to a weak performance in the oil-to-chemicals (O2C) sector. In contrast, the retail and Jio businesses are predicted to show strong growth, significantly bolstering the overall performance of the company. Investors are also anticipating the declaration of a dividend, which would be the first in nearly three quarters.\n\nKey points to focus on regarding RIL's Q4 results include:\n\n• **Profitability Outlook:** Analysts predict a **5%** decline in net profit relative to the previous year, while sales revenues are expected to increase by about **4%**.\n\n• **EBITDA Expectations:** Overall EBITDA is forecasted to grow between **1% and 3%**, driven primarily by higher telecom prices and a resilient retail business.\n\n• **Weak O2C Performance:** The O2C segment is projected to report an EBITDA of approximately **₹13,600 crore**, reflecting a **6% quarter-on-quarter decline**, resulting from lower refining margins due to decreased spreads for gasoline and jet fuel. Moderation in refining margins is estimated at **$8.9 per barrel**.\n\n• **Retail Sector Growth:** Reliance Retail is likely to experience a healthy Q4, with core revenue anticipated at **₹57,500 crore**, representing a **15% year-on-year increase**, and EBITDA increasing to **₹6,600 crore**, about **16% higher** than the previous year.\n\n• **Jio's Continued Dominance:** Jio's EBITDA is estimated to be **₹15,600 crore**, supported by a **6 million** increase in subscribers, bringing the total to **488 million**, and a slight rise in average revenue per user (ARPU) to **₹205 per month**.\n\n• **Dividend Announcement:** The board is expected to consider and approve a dividend, which would mark the first such announcement for the fiscal year 2025.\n\nOverall, RIL's quarterly results are keenly anticipated, as they will provide insights into the company's resilience amidst sectoral challenges and ongoing growth in its retail and telecommunications divisions."
  },
  {
    "title": "Q4 results today: Maruti Suzuki, RIL among 37 companies to announce earnings on Friday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/q4-results-today-maruti-suzuki-ril-among-37-companies-to-announce-earnings-on-friday/articleshow/120601431.cms",
    "summary": "The fourth-quarter earnings season is gaining momentum, with 37 companies, including major players like **Maruti Suzuki** and **Reliance Industries Limited (RIL)**, expected to announce their earnings. \n\n• **Reliance Industries (RIL)** anticipates a *decline in net profit* of approximately **5% year-over-year** (YoY), despite a projected **4% increase in revenue from operations**. Analysts predict that this decline in profit may be attributed to weaker performance in its oil-to-chemicals (O2C) sector, although its retail segment is expected to show a robust recovery with an **11% YoY growth in retail EBITDA**.\n\n• **Maruti Suzuki** is forecast to report a revenue increase of **4% to 10%**, although profitability may be negatively impacted due to rising costs. Revenue estimates range from **₹39,820 crore to ₹42,117 crore**. Analysts are divided on net profit prospects; some suggest it could rise by **2-5%**, while others expect a slight decline, with one analyst predicting a drop of nearly **9.6%**.\n\nAdditionally, companies like **DCB Bank**, **Force Motors**, **Hindustan Zinc**, **Chola**, **Shriram Finance**, and **Tata Tech** are also scheduled to report results.\n\nIn conclusion, while revenues for these companies may show resilience, the pressure from increasing costs suggests potential challenges in maintaining profitability, leading to mixed forecasts among analysts."
  },
  {
    "title": "Alphabet quarterly earnings lifted by cloud and AI",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/alphabet-quarterly-earnings-lifted-by-cloud-and-ai/articleshow/120601331.cms",
    "summary": "Alphabet, the parent company of Google, reported a substantial profit of **$34.5 billion** for the latest quarter, marking a significant boost largely attributed to **growth in cloud computing and artificial intelligence (AI)** sectors. Overall revenue escalated by **12%** to **$90.2 billion**, while the cloud division's revenue soared by **28%**, reaching **$12.3 billion**. Alphabet's CEO, Sundar Pichai, characterized these results as evidence of robust business momentum, emphasizing the effectiveness of their innovative **Gemini AI software**, regarded as the company's most advanced AI model.\n\nDespite these positive earnings, Alphabet faces looming **antitrust challenges** in the United States that could jeopardize its market position. U.S. government attorneys are advocating for Google to divest its **Chrome browser**, citing concerns that the integration of AI could further entrench its dominance in online search and advertising. The Department of Justice (DOJ) argues for significant legal remedies following a previous ruling that deemed Google’s practices monopolistic. \n\nKey highlights from the financial performance and legal challenges include:\n\n• **Profit**: $34.5 billion\n• **Overall Revenue Growth**: 12%\n• **Cloud Revenue Growth**: 28%\n• **Legal Concerns**:\n  - Antitrust lawsuits could lead to significant operational restructuring.\n  - Potential divestment of **Chrome** and **Android** products.\n  - Gears up for court cases asserting monopoly power in online advertising spaces.\n\nPichai expressed optimism about the company's future, stating that the strong performance in cloud services reflects growing demand. However, market analysts remain wary, considering the significant investments in AI and pressure from competitive technologies, especially in light of growing lower-cost alternatives like **DeepSeek** from China. \n\nAlphabet's shares experienced a three percent uptick in after-hours trading following the earnings announcement, indicating investor confidence despite the underlying legal uncertainties that could reshape the company's operational landscape. As Alphabet navigates legal hurdles, the tech industry watches closely, recognizing the potential impact on its broader **digital advertising** ecosystem."
  },
  {
    "title": "How the dinosaur fossil trade is hurting science",
    "url": "https://finshots.in/archive/how-the-dinosaur-fossil-trade-is-hurting-science-luxury-fossil-trade/",
    "summary": "The escalating trade of dinosaur fossils has transformed them into luxury items, posing significant challenges for scientific research. Notably, a 150-million-year-old Stegosaurus skeleton, named Apex, created a stir when it fetched $44.6 million at a Sotheby’s auction in 2024, purchased by hedge fund billionaire Kenneth Griffin. Griffin later donated it to the American Museum of Natural History, allowing researchers to study it and aiding scientific knowledge. However, this scenario is an exception, as many significant fossils remain in private collections, inaccessible to scientists.\n\nKey Issues:\n\n• **Commercialization of Fossils**: Following the success of the T. rex fossil named Sue, which sold for $8.4 million in 1997, the perception of fossils shifted from scientific treasures to valuable commodities. This change perpetuated a luxury market that attracts wealthy individuals, where fossils serve as status symbols rather than educational tools.\n\n• **Impact on Science**: Over 50% of scientifically valuable T. rex fossils reside in private hands, limiting research opportunities. The rarity of juvenile fossils, essential to understanding dinosaur growth, further complicates matters as many are locked away, hindering the verification of scientific findings.\n\n• **Illegal Fossil Trade**: A potential ban on private fossil collections might drive this trade underground, increasing illegal auctions and smuggling. Fossils are sometimes used in traditional Chinese medicine, further complicating regulatory efforts.\n\n• **Need for Regulation**: A uniform international standard for fossil excavation and ownership is crucial to mitigating these issues. Unlike the U.S., where fossils belong to landowners, other countries treat them as national treasures, ensuring public access.\n\n• **Success Stories**: Collaboration between institutions, such as the Field Museum's purchase of Sue, showcases the importance of public funding and cooperative efforts in making fossils available for study and education.\n\nWhether through strict regulation or enhancing public-private partnerships, addressing the challenges of the dinosaur fossil trade is essential to preserving and advancing scientific understanding of these ancient creatures. The goal must be to ensure that fossils serve both educational and scientific purposes rather than merely aesthetic and financial ones."
  },
  {
    "title": "Policymakers are achieving the art of the impossible, IMF chief says",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/policymakers-are-achieving-the-art-of-the-impossible-imf-chief-says/articleshow/120601165.cms",
    "summary": "IMF Managing Director **Kristalina Georgieva** recently emphasized transformative policy measures undertaken by **Germany**, **Britain**, and **Argentina**, heralding a **new era** for the global economy. Notable points from her remarks include:\n\n• **Germany** is set to experience *positive spillover effects* from its recent fiscal expansion, which aims to stimulate growth and enhance military spending. The approval of a substantial spending plan marks a departure from its historical fiscal conservatism, suggesting integration benefits for the broader European economy.\n\n• **Britain's** initiatives to advance its economy, coupled with regulatory reforms aimed at boosting investment and innovation, were recognized. Georgieva characterized the renewed trade engagement between the UK and the EU as a developing opportunity, likening it to *\"dating again\"* after their Brexit “divorce.”\n\n• **Argentina** achieved its first budget surplus in fourteen years, a feat acknowledged by its official, **Federico Sturzenegger**. The government’s aggressive expenditure cuts implemented by President **Javier Milei** following a severe inflation crisis (peaking at nearly 300% annually) indicate a significant turnaround.\n\n• Despite the ongoing trade uncertainties stemming from previous U.S. policies, Georgieva expressed cautious optimism regarding the global economic outlook, describing it as largely *\"full, not empty,\"* while estimating a **30% recession risk**.\n\nEconomics expert **Kristin Forbes** likened current global challenges to those depicted in a *\"Mission Impossible\"* film, suggesting uncertainty but expressing confidence in eventual adaptation and recovery as new trading arrangements become clearer.\n\nGeorgieva's insights reflect a belief in the effective navigation of considerable economic challenges, facilitated by strategic policymaking in key nations."
  },
  {
    "title": "Dollar drifts higher at end of volatile week of Trump backflips",
    "url": "https://economictimes.indiatimes.com/markets/forex/dollar-drifts-higher-at-end-of-volatile-week-of-trump-backflips/articleshow/120601101.cms",
    "summary": "The U.S. dollar experienced significant volatility this past week, influenced predominantly by President Donald Trump's comments regarding both the Federal Reserve and trade negotiations with China. Initially, the dollar fell by 1% against major currencies after Trump suggested he might fire Fed Chair Jerome Powell due to a perceived lack of urgency in rate cuts. However, it rebounded as Trump subsequently claimed he had no intention of replacing Powell and hinted at a de-escalation in trade tensions with China.\n\nKey movements included:\n• **Dollar Performance**: The dollar rose against the yen, reaching 143.08, and gained 4% against the Swiss franc, while the euro dipped to $1.1355 and sterling to $1.3314.\n• **Market Index**: The dollar index, which tracks the currency against a basket of six major competitors, is on track for a modest 0.27% increase over the week, breaking a four-week losing streak.\n• **Trade Negotiations**: Despite Trump's assertion of ongoing trade discussions, Chinese officials denied that negotiations were currently taking place, contributing to continued uncertainty in the market.\n\nAdditionally, early discussions between the U.S. and Asian allies, particularly South Korea and Japan, have made some headway, with plans to establish a trade package prior to a resumption of tariffs in July. Bank of Japan officials reaffirmed their commitment to raising interest rates if inflation aligns with targets, indicating careful monitoring of the situation amidst U.S. tariffs. Meanwhile, Bitcoin saw slight gains, trading near $94,220.\n\nOverall, the week concluded with investors remaining cautious, reflecting the unpredictability of both economic policy and international relations."
  },
  {
    "title": "Oil Set For Weekly Loss With Focus On US-China Trade Uncertainty",
    "url": "https://www.ndtvprofit.com/markets/oil-prices-today-brent-wti-crude-latest-news-april-24-2025-2",
    "summary": "Brent crude oil prices have slightly increased, reaching approximately $67 a barrel, while futures have fallen nearly 2% this week amid uncertainties surrounding US-China trade relations and President Donald Trump's tariffs. The fluctuating trade narratives have caused tension in global markets, resulting in a decline in oil prices this month, with concerns that these tariffs might severely affect economic activity and reduce energy demand.\n\nEnergy Secretary Chris Wright has provided assurances to US oil companies that the trade disputes are expected to be temporary and that the administration supports increased crude output. Additionally, OPEC+ is set to weigh production levels during its upcoming meeting, with reports suggesting some members are advocating for a significant production increase due to ongoing quota compliance issues.\n\nDespite the bearish outlook, certain indicators suggest potential short-term strength in the oil market, evident through a widening spread in the Brent and WTI benchmarks, indicative of supply tightening.\n\nCurrently, Brent crude for June delivery is trading at $66.79, and West Texas Intermediate is at $63.03 per barrel. These fluctuations reflect the complex interplay of market forces, regulatory measures, and geopolitical factors shaping the oil economy. \n\nThe broader implications of these developments highlight the volatility in the energy sector and the interdependencies between global trade dynamics and oil pricing. Investors are advised to remain alert to ongoing negotiations and any shifts in market sentiment stemming from trade discussions and OPEC+ decisions."
  },
  {
    "title": "Gold set for third straight weekly gain; US-China trade talks in focus",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-set-for-third-straight-weekly-gain-us-china-trade-talks-in-focus/articleshow/120601029.cms",
    "summary": "Gold prices demonstrated an upward trend, increasing by 0.2% to reach **$3,354.29 per ounce** on April 25, 2025, thus positioning itself for a third consecutive week of gains. Investors remain attentive to ongoing **U.S.-China trade negotiations**, which have significant implications for market dynamics. The following key details summarize the current gold market:\n\n• **Price Movements**:\n  - Spot gold: **$3,354.29 per ounce**\n  - U.S. gold futures: **$3,365.90**, reflecting a 0.5% increase.\n\n• **Market Sensitivity**:\n  - The gold market is particularly responsive to trade-related tensions and U.S. economic data. Traders are forecasting potential interest rate cuts amounting to around **84 basis points** by the end of 2025.\n\n• **Recent Developments**:\n  - A peak price of **$3,500.05** was recorded earlier in the week. However, prices dipped below $3,300 shortly after President Trump eased his rhetoric regarding the Federal Reserve and China.\n  - U.S. Treasury Secretary Scott Bessent indicated that excessive tariffs may need to be reduced for productive negotiations; however, unilateral tariff cuts by Trump are not anticipated.\n\n• **Investment Landscaping**:\n  - Gold traditionally serves as a hedge against economic volatility and political uncertainty, thriving in low interest rate environments. \n  - Other precious metals showed mixed performances: **Silver** edged up **0.2%** to **$33.65**, while **Platinum** also rose by **0.2%** to **$973.03**. In contrast, **Palladium** witnessed a **1% decline**, trading at **$944.25**.\n\nIn summary, the gold market is underpinned by geopolitical uncertainties and anticipated monetary policy shifts amid fluctuating economic indicators. Prospective investors should remain cautious while keeping track of ongoing developments in international trade discussions."
  },
  {
    "title": "Oil prices set for weekly loss on potential for more global supply",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-set-for-weekly-loss-on-potential-for-more-global-supply/articleshow/120600986.cms",
    "summary": "Oil prices experienced a slight rise on Friday but are projected to incur a weekly loss, primarily influenced by signals pointing towards increased output from OPEC+ and the potential for a ceasefire in the ongoing Russia-Ukraine war. These developments are likely to bolster supply amid fluctuating U.S. tariff policies, which contribute to an unstable demand outlook.\n\nKey Points:\n• **Current Price Movements**: \n  - Brent crude futures increased by 5 cents, reaching $66.60 per barrel, while West Texas Intermediate (WTI) crude rose by 6 cents to $62.85 per barrel. However, both are on track for a weekly decline—Brent by 2% and WTI by 2.9%.\n  \n• **Supply Factors**:\n  - The potential for a ceasefire in Ukraine could enhance oil flow from Russia, a significant player in the OPEC+ consortium.\n  - Discussions involving OPEC+ members have emerged, suggesting they might accelerate output increases for the upcoming June.\n\n• **International Relations and Sanctions**:\n  - Iranian officials indicated readiness for diplomatic talks with Europe regarding their nuclear program, which might result in the easing of sanctions against Iranian oil exports.\n  - Iran, holding the position as the third-largest OPEC oil producer, could significantly affect global supply dynamics.\n\n• **Demand Outlook**:\n  - The impact of trade tensions, particularly between the U.S. and China (the largest oil consumers), raises concerns over future oil demand. Businesses are facing challenges related to rising costs due to these trade disputes, which may lead to reduced financial projections and disrupted supply chains.\n\nOverall, the interplay between potential increases in oil production from OPEC+, geopolitical events, and trade disputes plays a critical role in determining oil pricing trends and the global economic outlook."
  },
  {
    "title": "Sensex Today | Stock Market LIVE Updates: GIFT Nifty hints at positive start; Asian stocks trade higher",
    "url": "https://economictimes.indiatimes.com/markets/stocks/live-blog/bse-sensex-today-live-nifty-stock-market-updates-25-april-2025/liveblog/120600943.cms",
    "summary": "The Indian stock market experienced significant volatility on April 25, 2025, as both the Sensex and Nifty indices registered marked declines. \n\n• **Market Overview:**\n  - The **Sensex** fell by 589 points, closing at **24,239.35**, while the **Nifty** dropped below **24,100**.\n  - This decline followed a roughly **1,200-point drop from the day's high**, reflecting heightened investor caution amid rising geopolitical tensions after a tragic terrorist attack in Kashmir that resulted in 26 civilian fatalities.\n\n• **Market Capitalization:**\n  - The total market capitalization of all listed companies on the BSE decreased by **₹8.5 lakh crore**, settling at **₹421.13 lakh crore**.\n\n• **Key Influencing Factors:**\n  - **India-Pakistan Tensions:** Increasing geopolitical strains have shifted market sentiment towards risk aversion.\n  - **Valuation Concerns:** Following a substantial **8.6% rally** in the Nifty over previous sessions, investor caution was warranted due to overvaluation fears.\n  - A muted earnings season with many companies reporting lower-than-expected results further contributed to the market's cautious tone.\n\n• **Sector Performance:**\n  - Notable declines were observed in major banks, with **Axis Bank**, **State Bank of India (SBI)**, and **Bajaj Finance** being significant drags on the Sensex.\n  - Other major financial institutions, such as **Kotak Bank** and **HDFC Bank**, also faced downward pressure.\n\n• **Technical Analysis:**\n  - The Nifty closed at **24,247**, down by **82 points**, with a bearish candle forming on the daily chart, indicating indecision among traders.\n\n• **Global Market Influences:**\n  - Asian markets saw positive movements with increases in Japan’s Nikkei and S&P/ASX 200, driven primarily by positive developments in trade talks between the U.S. and China, as well as supportive comments from Federal Reserve officials suggesting potential rate cuts sooner than anticipated.\n\n• **Outlook:**\n  - Analysts anticipate a market rebound if geopolitical conditions stabilize over the weekend, despite the current cautious sentiment. InCred has briefly raised its Nifty target to **24,280**, citing favorable macroeconomic factors like easing oil prices and positive rainfall forecasts.\n\n• **Investment Considerations:**\n  - The report emphasizes caution in asset allocation, particularly in light of recent gold price trends and shifting investment landscapes influenced by both domestic and international factors.\n\nOverall, the market's immediate future hinges on both geopolitical stability and economic indicators ahead of key upcoming earnings reports."
  },
  {
    "title": "Alphabet’s Profit Gets $8 Billion Boost From SpaceX Investment",
    "url": "https://www.ndtvprofit.com/quarterly-earnings/alphabets-profit-gets-8-billion-boost-from-spacex-investment",
    "summary": "During the first quarter of 2025, Alphabet Inc. experienced a significant increase in profit, largely attributed to an **$8 billion** unrealized gain from its investment in **SpaceX**. For the quarter ending in March 2025, Alphabet reported a net income of **$34.5 billion**, translating to **$2.81 per share**. This performance exceeded Wall Street analysts' expectations, who had predicted earnings of **$2.01 per share**.\n\nKey highlights include:\n\n• **Investment Background**:\n  - Alphabet has been a substantial investor in SpaceX since 2015, having initially contributed to a **$1 billion** round alongside Fidelity Investments.\n  - Reports indicate that a recent insider share transaction in **December 2024** valued SpaceX at approximately **$350 billion**.\n\n• **Earnings Summary**:\n  - Alphabet's profit for the recent quarter marked an increase primarily driven by the substantial gains from its stake in private companies, specifically highlighting ventures such as SpaceX.\n  - The company did not specify the identity of this other private company in its earnings report, raising discussions on the speculative nature of such investments.\n\nDespite the general market trends, Alphabet's recent earnings report showcases its strategic investments playing a pivotal role in enhancing its profitability, indicative of the firm’s robust financial strategy in the tech sector. However, the attention garnered by the earnings report also reflects growing investor interest in Alphabet's long-term investment strategy, particularly in high-risk, high-reward sectors like space exploration."
  },
  {
    "title": "Asian stocks rise on Fed rate-cut hopes, Alphabet solid earnings",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-on-fed-rate-cut-hopes-alphabet/articleshow/120600516.cms",
    "summary": "Asian stock markets experienced gains spurred by optimism regarding potential Federal Reserve rate cuts and solid earnings from major companies like Alphabet. Key highlights include:\n\n• **Market Performance:**\n  - South Korean shares increased by 1.1% following comments from U.S. Treasury Secretary Scott Bessent about possible trade agreements.\n  - Japanese equities rose by 1%, buoyed by a significant jump in the S&P 500.\n\n• **Alphabet's Earnings:**\n  - Alphabet's stock surged by 4.9% in after-hours trading after reporting better-than-expected first-quarter revenue and profit, enhancing investor confidence and boosting futures for major U.S. indices.\n\n• **Future Economic Outlook:**\n  - Analysts are cautious about corporate profit forecasts, fearing an impending economic slowdown as earnings revisions skew toward downgrades. Deutsche Bank has lowered its S&P 500 year-end forecast due to anticipated declines in earnings as tariffs are expected to hit companies hard.\n\n• **Federal Reserve Policy:**\n  - Federal Reserve officials hinted at the possibility of rate cuts should economic indicators show significant weakness, particularly in the labor market. This stance has fostered a more favorable sentiment among investors.\n\n• **Trade Negotiations:**\n  - President Trump confirmed ongoing trade discussions with China, although Beijing has denied such negotiations. The administration aims to resolve tariff disputes, with talks reportedly having yielded positive outcomes with South Korea and India.\n\nInvestors are advised to adopt a long-term outlook, focusing on companies exhibiting strong earnings potential and robust financial health amidst the shifting economic landscape."
  },
  {
    "title": "Hero Future Energies appoints 4 I-bankers for Rs 5,000-crore IPO",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/hero-future-energies-appoints-4-i-bankers-for-rs-5000-crore-ipo/articleshow/120600469.cms",
    "summary": "Hero Future Energies (HFE), supported by KKR and the Munjal family, is gearing up for an initial public offering (IPO) with a fundraising target of ₹5,000 crores (approximately $600 million). This decision follows positive responses from environmental, social, and governance (ESG) investors, prompting HFE to revise its earlier fundraising goal of ₹3,000 crores. The firm has appointed a consortium of investment banks including **JM Financial**, **Axis Capital**, **Nomura**, and **Bank of America** to manage the IPO process. \n\n• **Background Information:**\n  - HFE operates a portfolio of renewable energy assets, focusing mainly on wind and solar power generation, amounting to 5.2 gigawatts globally with a significant presence in India and expansion into countries like the UK, Ukraine, and Vietnam.\n  - Approximately **43%** of HFE's power generation comes from contracts with the Solar Energy Corporation of India (SECI), while the remainder is sold through direct agreements with local distribution companies.\n\n• **Financial Goals:**\n  - HFE aims to invest around **$20 billion** in renewable generation by 2030, focusing on various projects spanning solar, wind, and battery storage.\n  - The company has previously raised funds from notable investors, including **$125 million** from the International Finance Corporation (IFC) in 2017 and an additional **$450 million** collectively from KKR and the Munjal family in 2022.\n\n• **Market Position:**\n  - HFE's diversified asset base reduces credit risk, with long-term purchase agreements established with various distribution companies.\n  - This strategic approach enhances HFE’s market stability and positions it favorably for upcoming investments and expansion in the renewable energy sector.\n\nThe company's growth trajectory and planned IPO signal a strong commitment to advancing sustainable energy solutions while attracting significant investment in the green energy space. As the IPO launch date approaches, the interest from both institutional investors and market analysts will be pivotal in shaping HFE’s valuation and future prospects."
  },
  {
    "title": "Macrotech Developers FY25 net profit Rs 2,770 crore, up 71%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/macrotech-developers-fy25-net-profit-rs-2770-crore-up-71/articleshow/120600441.cms",
    "summary": "Macrotech Developers, also known as Lodha, has reported a **71% increase in net profit** for the financial year 2024-25, amounting to **Rs 2,770 crore**. This substantial rise is attributed to several factors, including robust revenue growth and exceptional project performance. Key highlights of the financial performance are as follows:\n\n• **Total Revenue Growth:** Revenue surged by **34%**, reaching **Rs 13,780 crore**, driven by impressive quarterly and annual pre-sales results.\n\n• **Net Profit Margin Improvement:** The net profit margin rose from **15% to 20%** compared to the previous year.\n\n• **Pre-sales Performance:** Pre-sales climbed by **21%**, reaching **Rs 17,630 crore**, showcasing the effectiveness of the company's sales strategies.\n\n• **Projects Expansion:** During the year, Macrotech introduced **10 new projects** across the Mumbai Metropolitan Region (MMR), Pune, and Bengaluru, with a **gross development value (GDV)** of **Rs 23,700 crore**, surpassing its guidance of **Rs 21,000 crore**.\n\n• **Debt Reduction:** The company successfully reduced its net debt by **Rs 310 crore**, totaling **Rs 3,990 crore**, resulting in a net debt-equity ratio of **0.2x**, below its ceiling of **0.5x**.\n\n• **Quarterly Results:** For the quarter ending March 2025, net profit grew by **38% YoY** to **Rs 920 crore**, while revenue increased by **5%** to **Rs 4,220 crore**. Collections rose **26%** in the same period, amounting to **Rs 4,440 crore**.\n\n• **Market Strategy:** The company's \"micro market led super market strategy\" was instrumental in achieving **Rs 2,500 crore** in pre-sales in western suburbs of MMR, marking a **140% growth** compared to the previous year.\n\nAbhishek Lodha, MD & CEO, emphasized the predictive nature of the business model which has consistently resulted in pre-sales exceeding **Rs 4,000 crore** over five consecutive quarters, underlining the company's strong execution capabilities."
  },
  {
    "title": "SBI Life's Q4 net flat, PAT for year up 27%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-lifes-q4-net-flat-pat-for-year-up-27/articleshow/120600395.cms",
    "summary": "SBI Life Insurance Company has reported a modest growth of **0.3% in its net profit** for the fourth quarter (Q4) of the fiscal year, amounting to ₹814 crore, compared to ₹810 crore during the same period last year. The growth in the company’s non-participating business is identified as a factor impacting overall profitability, particularly against the backdrop of increased market volatility which has adversely affected unit-linked insurance plans.\n\nKey Financial Highlights:\n\n• **Net Premium Income:** Decreased by **5%** to ₹23,860 crore from ₹25,116 crore, reflecting challenges in the market environment.\n  \n• **Value of New Business (VoNB):** Increased by **7%** to ₹5,950 crore, showcasing steady growth in new business avenues.\n  \n• **VoNB Margin:** Remains strong at **27.8%**, attributed to a higher mix of non-participating products.\n\n• **Annualized Premium Equivalent:** The share of non-participating business rose from **33%** to **36%**, while unit-linked insurance plans dropped from **64%** to **60%**, influenced by market conditions.\n\n• **Solvency Ratio:** Stable at **1.96%**, comfortably exceeding the regulatory minimum of **1.5%**.\n\n• **Expense of Management Ratio:** Increased to **8.40%** from **6.64%**, indicating higher operational costs.\n\n• **Persistency Ratios:** Both the 13th and 61st month persistency improved, reaching **87.4%** and **62.7%**, respectively, compared to previous figures of **86.8%** and **57.4%**. This indicates a positive trend in customer retention and product satisfaction.\n\nFor the full fiscal year, SBI Life's Profit After Tax (PAT) exhibited a strong rise of **27%** to ₹2,400 crore. The gross written premium for FY25 grew by **4%** to ₹84,980 crore, driven by an **11%** increase in new regular business premiums and a **14%** increase in renewal premiums. Notably, the bancassurance channel proved most lucrative, contributing significantly to overall income alongside other distribution partnerships, including agencies and brokers.\n\nThe company has opted out of the group savings business, deeming it \"unviable,\" reflecting a strategic shift in their business approach to focus on more profitable segments."
  },
  {
    "title": "Pre-market action: Here's the trade setup for today's session",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/120590742.cms",
    "summary": "Indian equities saw a slight decline after a week-long rally, with the Nifty closing 82 points lower amidst cautious investor sentiment and mixed global signals. This downturn appears to be influenced by global cues and the anticipation of upcoming fourth-quarter corporate earnings.\n\nKey Market Highlights:\n• The **GIFT Nifty** indicated a positive start, trading higher by 126 points at **24,516.50**.\n• The **Indian VIX**, measuring market volatility, increased by 1.8% to **16.25** levels.\n• U.S. markets closed positively, buoyed by technology shares and easing tariff tensions, with the **Dow** rising by 1.23%, the **S&P 500** gaining 2.03%, and the **Nasdaq** increasing by 2.74%.\n• Asian markets opened positively, with optimism surrounding potential Federal Reserve rate cuts and solid corporate earnings from major companies like Alphabet Inc.\n\nMarket Technicals:\n• Short-term market sentiment remains strong, despite signs of fatigue. A potential correction is anticipated if the Nifty sustains below **22,300**, with downside targets set at **21,900** and resistance at **24,300** and **24,500**.\n\nInvestor Actions:\n• Foreign Institutional Investors (FIIs) shifted from being net short sellers, reducing their positions significantly from **Rs 70,771 crore** to **Rs 24,480 crore** in a single day, while turning net buyers worth **Rs 8,250 crore**.\n• Domestic Institutional Investors (DIIs) sold shares amounting to **Rs 534 crore**.\n\nCurrency Movement:\n• The Indian Rupee gained **12 paise** to **85.33** against the US dollar, attributed to a weaker dollar, a decline in crude oil prices, and substantial FII inflows.\n\nIn summary, while Nifty reflects temporary caution, upcoming corporate earnings and global signals are expected to determine the market's next direction."
  },
  {
    "title": "Hot Stocks: 3 stocks that may give returns between 13-43%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-3-stocks-that-may-give-returns-between-13-43/articleshow/120600075.cms",
    "summary": "Analysts are optimistic about the potential returns of specific stocks, estimating increases between **13% to 43%** based on their analysis.\n\n• **Divi's Laboratories**\n  - **Price Target:** Rs 7,050\n  - **Current Market Price (CMP):** Rs 6,216\n  - **Potential Upside:** 13%\n  - Expected to gain from its role in producing diabetes and weight loss medications, including *Orforglipron*, and plans a $170 million capital expenditure aimed primarily at GLP-1 medications.\n\n• **Devyani International**\n  - **Price Target:** Rs 220\n  - **CMP:** Rs 179\n  - **Potential Upside:** 23%\n  - The acquisition of Sky Gate Hospitality is expected to enhance its QSR business, with the valuation suggesting the deal is accretive. Earnings volatility is anticipated due to mergers and acquisitions.\n\n• **Anant Raj**\n  - **Price Target:** Rs 700\n  - **CMP:** Rs 488\n  - **Potential Upside:** 43%\n  - Despite a cautious stance on its data center unit, strong future earnings growth is anticipated, projecting over 40% compound growth in EPS.\n\nThis information highlights the stock recommendations and the strategic business developments each company is undertaking, which analysts believe will significantly impact their future stock performance."
  },
  {
    "title": "Layoffs are usual, don't mean stress: Axis Bank",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/layoffs-are-usual-dont-mean-stress-axis-bank/articleshow/120599916.cms",
    "summary": "Axis Bank recently addressed reports concerning layoffs, clarifying that the departure of over 100 senior employees was part of the bank's standard appraisal cycle, primarily due to performance-related issues. **Managing Director Amitabh Chaudhry** emphasized that such layoffs are routine and are not indicative of stress within the organization. He elaborated that the banking sector encounters diverse challenges, leading to varying levels of success across different businesses. \n\nThe bank is committed to considerable investments across several areas, and, as is typical within many organizations, some employees excel while others may not meet performance standards, thus necessitating difficult conversations regarding employment status. This approach aligns with the bank's regular operational practices at the end of fiscal years, highlighting the cyclical nature of performance evaluations in the banking industry.\n\nKey points include:\n\n• **Context of Layoffs:** The bank insists that the layoffs are a commonplace event and not due to any underlying systemic issues.\n\n• **Investment Strategy:** Axis Bank continues to invest heavily in selected sectors, which reflects its growth outlook despite the layoffs.\n\n• **Performance Evaluation:** The annual appraisal process results in both promotions and layoffs, showcasing a comprehensive evaluation system within the bank.\n\nOverall, the statement stresses that the organization remains in a stable condition while navigating its annual appraisal requirements and performance assessments."
  },
  {
    "title": "Axis Bank net flat in Q4 as loan growth slows",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-net-flat-in-q4-as-loan-growth-slows/articleshow/120599813.cms",
    "summary": "Private sector lender **Axis Bank** has reported a **flat net profit** of **₹7,117.5 crore** for the March 2025 quarter, reflecting a slowdown in loan growth. This figure is marginally above analysts' expectations of **₹6,601.2 crore** but down from **₹7,129.7 crore** in the same quarter the previous year. Key financial metrics from the quarter include:\n\n• **Net Interest Income:** Increased by **6%**, reaching **₹13,811 crore**.\n• **Net Interest Margin:** Decreased to **3.97%** from **4.06%** year-over-year.\n• **Total Advances:** Climbed by **8%** year-on-year to **₹10.4 lakh crore**, with retail loans growing by **7%** and corporate loans by **8%**.\n• **Deposits:** Grew by **10%** to **₹11.7 lakh crore**.\n• **Gross Non-Performing Asset (NPA) Ratio:** Improved to **1.28%** from **1.43%** year-over-year.\n\nDespite the decline in profit, the bank's increased focus on profitability in a challenging macroeconomic environment has been highlighted by **Amitabh Chaudhry**, MD of Axis Bank. He noted the importance of maintaining **risk guardrails** while seeking sustainable growth. Total provisions and contingencies for this quarter rose to **₹1,359.3 crore** from **₹1,185 crore** a year ago, indicating the bank's cautious approach in response to rising gross slippages, which increased to **₹4,805 crore** from **₹3,471 crore**.\n\nChaudhry expressed optimism about the operating environment for FY26, stating there are indications of stabilization across product segments, which may support a return to growth while keeping focus on risk management."
  },
  {
    "title": "Sebi imposes Rs 10 lakh fine on Future Retail",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-imposes-rs-10-lakh-fine-on-future-retail/articleshow/120599731.cms",
    "summary": "The **Securities and Exchange Board of India (Sebi)** has imposed a penalty of **₹10 lakh** on **Future Retail**. This fine results from the company's **failure to promptly disclose arbitration proceedings** initiated by **Amazon** against it. \n\nKey Details:  \n• **Background:** On **October 5, 2020**, Amazon raised concerns related to a scheme of arrangement involving Future Group and the Mukesh Dhirubhai Ambani Group, leading to arbitration initiated before the **Singapore International Arbitration Centre (SIAC)**.  \n• **Disclosure Issues:** The regulator noted that Future Retail disclosed the initiation of these arbitration proceedings only on **November 1, 2020**, after intervention by stock exchanges, despite being informed on October 5 and submitting its objection a day later.  \n• **Regulatory Violations:** Sebi highlighted that the company was required to disclose material events within **24 hours**, specifically by **October 6, 2020**, as stipulated by **Listing Obligations and Disclosure Requirements (LOD-R) Regulations**. The delay in reporting was deemed a violation of these norms.  \n\nThis enforcement action reflects Sebi’s emphasis on **transparency and timely disclosures** by publicly-traded companies, underpinning the regulatory framework's commitment to maintaining market integrity."
  },
  {
    "title": "RBI's 57.5 tonnes of gold purchase second-highest in 7 years",
    "url": "https://economictimes.indiatimes.com/markets/commodities/news/rbis-57-5-tonnes-of-gold-purchase-second-highest-in-7-years/articleshow/120599598.cms",
    "summary": "The Reserve Bank of India (RBI) has made a significant purchase of **57.5 tonnes of gold** in the financial year 2025 (FY25), marking its second-largest acquisition since it began accumulating gold in December 2017. This increase in purchases has been prompted by various factors, including heightened **geopolitical risks**, instability in the **US dollar**, and uncertainties surrounding **US government bonds**. Such conditions have led many central banks, including the RBI, to bolster their gold reserves as a protective measure against financial volatility.\n\nKey details surrounding the RBI's gold purchase are as follows:\n\n• The RBI's total gold stock rose to **879.6 tonnes** by the end of March 2025, up from **822.1 tonnes** during the same period in 2024.  \n• The largest gold acquisition by the RBI was in **2021-22**, where it purchased **66 tonnes**. This was followed by **35 tonnes** in FY23 and **27 tonnes** in FY24.  \n• The share of gold in India's foreign exchange reserves has increased to **11.8%** as of April 11, 2025, from **8.7%** a year prior.\n\nThis strategy reflects a global trend wherein central banks are increasingly investing in gold as a hedge against inflation and a more reliable store of value amidst fluctuating currency markets. Notably, experts indicate that many central banks are reducing their dependency on US Treasuries and prioritizing **gold reserves** to enhance their financial safety, particularly during periods of economic stress. \n\nDespite this aggressive accumulation, there are signs that the RBI may adopt a more cautious approach to its gold purchases in the future. After averaging **6.6 tonnes per month** from January to November 2024, the RBI's acquisitions fell below this average in both January and March 2025, suggesting a potential moderation in its buying patterns.\n\nIn summary, the RBI's gold purchases underscore its commitment to maintaining financial stability and managing currency volatility, further establishing gold's strategic role in its overall reserves management. The rise in gold prices, surging over **30%** during the year, has also positively impacted the valuation of the RBI's existing gold stock, contributing to the importance of gold as a reliable asset in its reserves."
  },
  {
    "title": "LIC eases claims process for Jammu & Kashmir terror attack victims",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/lic-eases-claims-process-for-jammu-kashmir-terror-attack-victims/articleshow/120600267.cms",
    "summary": "Following the tragic terror attack in Pahalgam, Jammu and Kashmir, which resulted in the loss of 26 lives, the Life Insurance Corporation of India (LIC) has implemented measures to ease the claims process for the victims' families. \n\n• **Relief Measures**: LIC is accepting governmental records or proof of compensation as valid death certificates, thereby expediting the claims process for families affected by the attack.\n\n• **Government Compensation**: Various state governments have initiated ex-gratia payments to the deceased’s families: \n  - **Karnataka**: ₹10 lakh for two victims from the state. \n  - **Jammu and Kashmir**: ₹10 lakh for each deceased's family and ₹2 lakh for the seriously injured. \n  - **Maharashtra**: ₹5 lakh for six deceased individuals and ₹50,000 for those injured.\n\n• **LIC’s Statement**: Siddhartha Mohanty, Managing Director of LIC, emphasized the commitment to swiftly settle claims and reduce hardships for claimants. He stated that any official evidence of death related to the terrorist attack, or state compensation paid, will be acknowledged as proof of death.\n\n• **Insurance Coverage**: Most life insurance policies cover deaths caused by terrorism, unless explicitly excluded. This provision supports families in claiming benefits during such tragic events.\n\nThe response to the April 22 attack drew national condemnation, and Prime Minister Narendra Modi vowed to take stringent action against those responsible."
  },
  {
    "title": "National Company Law Tribunal okays sale of 18 IL&FS units in Mumbai",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/national-company-law-tribunal-okays-sale-of-18-ilfs-units-in-mumbai/articleshow/120600288.cms",
    "summary": "The National Company Law Tribunal (NCLT) has authorized the sale of **18 commercial units** located at **Kohinoor Square**, Mumbai, to the **Gajra Brothers** and associated parties for approximately **₹315 crore**. This transaction involves **IL&FS Transportation Networks (ITNL)** and **IL&FS Financial Services (IFIN)**, and is part of the broader **IL&FS resolution framework** designed to monetize assets to settle debts owed to creditors.\n\nKey details of the transaction include:\n\n• **Financial Distribution:** \n   - ITNL is expected to receive **₹56.44 crore**.\n   - IFIN will secure **₹257.88 crore** from the sale.\n\n• **Bidding Process:** \n   - The sale was facilitated after a structured bidding process wherein out of **19 applicants**, only **three** submitted binding bids.\n   - The Gajra Brothers’ bid was identified as the highest, leading to its approval by the newly appointed board and justice **DK Jain**. \n\n• **Unit Acquisition:** \n   - The Gajra Brothers will directly acquire **two units**, while the remaining units will be held by **15 Limited Liability Partnerships (LLPs)** in which they have a controlling stake.\n\n• **Documentation and Compliance:** \n   - A total of **17 letters of intent (LOIs)** have been executed as per the court order, ensuring regulatory compliance for the sale.\n\nThis decision signifies a critical step in the ongoing resolution process for IL&FS, which has been grappling with financial issues, enabling the liquidation of assets to address outstanding liabilities."
  },
  {
    "title": "Spandana Sphoorty Financial said to be under RBI lens",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/spandana-sphoorty-financial-said-to-be-under-rbi-lens/articleshow/120599704.cms",
    "summary": "The Reserve Bank of India (RBI) is scrutinizing Spandana Sphoorty Financial due to alleged operational lapses, as indicated by the company's abrupt management changes. On April 25, 2025, the company appointed Chief Financial Officer Ashish Kumar Damani as interim Chief Executive Officer, succeeding Shalabh Saxena, who resigned citing personal reasons but will assist for a three-month transition period. This management reshuffle reportedly follows a detailed RBI inspection, lasting almost three weeks, which revealed unreported fraud and discrepancies in cash balances across several branches.\n\nKey highlights include:\n• **Management Changes**: Ashish Kumar Damani steps in as interim CEO, with Shalabh Saxena continuing for a smooth transition.\n• **Inspection Findings**: The RBI's findings include significant discrepancies and lapses, prompting the management overhaul.\n• **Market Reaction**: Following Saxena's resignation, the company's stock price rose 4.3%, despite the broader market decline.\n• **Financial Performance Issues**: Spandana has faced considerable financial distress, posting consecutive net losses in the preceding quarters and an increase in non-performing assets, reaching 5.2% by December 2024.\n\nThe situation illustrates the challenges in the microfinance sector, particularly with asset quality, as many companies face similar hurdles in the current economic environment."
  },
  {
    "title": "PepsiCo's Beverages Grow 11%, India Markets Account For 2% Business",
    "url": "https://www.ndtvprofit.com/business/pepsicos-beverages-grow-11-india-markets-account-for-2-business",
    "summary": "Global food and beverage giant **PepsiCo** has reported a **11% revenue growth in its international business** for the first quarter ending March 22, 2025. This surge was partly attributed to the performance in several markets, including **India**, which contributed significantly to this growth. India also played a role in boosting PepsiCo's international convenient foods business by **2%** during the same quarter.\n\n### Key Highlights:\n- **Revenue Growth**: \n  - International beverages: **11% growth**.\n  - International convenient foods: **2% growth**.\n- **Performance Boosted by**: \n  - **Market Contributions**: India, Brazil, Egypt, and Turkey for convenient foods; China, India, Egypt, Turkey, Mexico, Brazil, the UK, and Australia for beverages.\n- **CEO Commentary**:\n  - Ramon Laguarta emphasized the ongoing resilience in their international business, which he noted remains the largest growth engine for PepsiCo. He highlighted the **positive trends** observed in India and other global markets.\n- **Financial Figures**: \n  - PepsiCo's net revenue decreased by **1.81%**, amounting to **$17.9 billion**.\n  - Operating profit fell by **4.9%** to **$2.58 billion**.\n  \n### Market Adjustments:\n- Due to significant foreign exchange challenges, PepsiCo has restructured its reporting segments, including the establishment of a new **International Beverages Franchise business**.\n  \n### Future Outlook:\n- For the remainder of **2025**, PepsiCo expects continued volatility and changes in consumer conditions globally, thus projecting **low-single-digit organic revenue growth** moving forward, alongside maintaining a core tax rate of **20%**.\n\nOverall, PepsiCo's recent performance indicates solid growth trajectories in specific international markets while facing challenges in others, particularly due to fluctuating economic conditions and foreign exchange rates."
  },
  {
    "title": "India And Pakistan Trade To Skid To A Halt: Indian Export Body",
    "url": "https://www.ndtvprofit.com/business/india-and-pakistan-trade-to-skid-to-a-halt-indian-export-body",
    "summary": "India's trade relations with Pakistan have come to a halt, particularly after recent tensions following a *terror attack in Pahalgam* that left 26 people dead. The *Federation of Indian Export Organisations (FIEO)* reported that India's bilateral trade with Pakistan is negligible, making up only *0.06% of India's total trade*. \n\nThe Indian government has initiated several measures in response to the attack, including closing the *Attari land-transit post*, a critical route for goods, and expelling Pakistani military attaches. Subsequently, Pakistan announced the suspension of all trade with India, even through third-party countries.\n\nKey takeaways include:\n\n• The impact of trade cessation is likely to affect *Pakistan's economy* substantially, especially since India's exports in recent months were valued at only $447.65 million, while imports stood at a mere $0.42 million.\n\n• Historically, India's total exports to Pakistan have been declining, with significant trade reductions after the *Pulwama attack* in 2019, leading to a substantial increase in import duties on goods from Pakistan.\n\n• Approximately *60% of India's exports to Pakistan in the previous fiscal year consisted of organic chemicals and pharmaceuticals*.\n\nEfforts by the FIEO to hold a managing committee meeting in Kashmir to discuss trade issues have been canceled due to the prevailing tensions, highlighting the delicate state of India-Pakistan relations, primarily influenced by security concerns and historical issues surrounding *Kashmir* and cross-border terrorism. \n\nThis cessation by both nations reflects the fragility of *bilateral economic cooperation* in light of ongoing political and security disputes."
  },
  {
    "title": "LIC to expedite claim settlements of Pahalgam terror victims",
    "url": "https://www.thehindu.com/business/lic-to-expedite-claim-settlements-of-pahalgam-terror-victims/article69487071.ece",
    "summary": "Life Insurance Corporation of India (LIC) has initiated measures to provide swift claim settlements to the families affected by the Pahalgam terrorist attack. This decision, articulated by CEO and Managing Director Siddhartha Mohanty, expresses deep sorrow over the tragic loss of innocent lives. To facilitate the process:\n\n• **Proof of Death**: Instead of requiring traditional death certificates, LIC will accept any government-recorded evidence of death related to the attack, along with any compensation documentation provided by government entities.\n\n• **Efforts for Claimants**: The corporation has committed to actively outreach the claimants to ensure they receive their claims promptly and efficiently, demonstrating a dedicated effort to alleviate the hardships these families face.\n\n• **Claims Support**: Claimants are encouraged to reach out to their nearest LIC branch or customer service for assistance, with a dedicated call center number provided (022 68276827).\n\nIn addition to LIC’s response, the insurance aggregator Policybazaar has announced its commitment to support these families through employment opportunities for a family member or educational sponsorship for affected children. Co-founder Alok Bansal described this gesture as a small step towards establishing a social safety net for the impacted families.\n\nThis proactive approach by LIC and the engagement from Policybazaar aims to provide not just financial assistance, but also emotional and social stability to the families grappling with the aftermath of the attack."
  },
  {
    "title": "ACC Q4 profit declines 20.4% to ₹751 crore, revenue up 12.7% to ₹5,991 crore",
    "url": "https://www.thehindu.com/business/Industry/acc-q4-profit-declines-204-to-751-crore-revenue-up-127-to-5991-crore/article69488182.ece",
    "summary": "Cement manufacturer **ACC Ltd** has reported a **20.4% decline** in consolidated net profit for the **March quarter** of 2025, totaling **₹751.04 crore**, down from **₹943.39 crore** during the same period the previous year. However, its revenue has seen an increase of **12.7%**, reaching **₹5,991.67 crore**, compared to **₹5,316.75 crore** a year prior.\n\nKey details from the report include:\n\n• **Total Expenses:** Increased by **13.11%**, amounting to **₹5,514.82 crore**.\n\n• **Sales Volume:** Reported at **11.9 million tonnes**, an impressive growth of **14%**, marking the highest-ever sales volume recorded in a single quarter.\n\n• **Cement Business Revenue:** Lowered by **11.14%** to **₹5,685.53 crore**.\n\n• **Revenue from Ready Mix Concrete:** Increased by **32.12%** to **₹419.92 crore**.\n\n• **Total Income:** Including other income, reached **₹6,066.52 crore**, representing a **12% increase**.\n\nFor the financial year that concluded on **March 31, 2025**, ACC's net profit was reported at **₹2,402.27 crore**, reflecting a small increase of **2.87%** year-over-year. Additionally, the company's total income for the year stood at **₹22,834.74 crore**, a growth of **11.65%** from **₹20,451.77 crore** in the previous year.\n\nCEO **Vinod Bahety** emphasized that ACC is advancing through strategic milestones, focusing on capacity expansion and modernization to meet growing infrastructure demands. The board has declared a dividend of **₹7.50** per equity share for the fiscal year 2024-25.\n\nLooking forward, ACC expects growth in cement demand to range between **7-8%** for the upcoming fiscal year, driven by infrastructure spending, housing demand, and government initiatives aimed at stimulating the construction sector. During the fourth quarter of FY25, cement consumption showed an **8% growth**, up from **7%** in the previous quarter, indicating a positive trend in construction and real estate activities.\n\nIn stock market performance, ACC shares settled at **₹2,068**, which is a **0.79% increase** from the last closing price."
  },
  {
    "title": "Luxury Real Estate: Sale Of Apartments Priced Over Rs 1 Crore Surges 10% In January-March, Says JLL",
    "url": "https://www.ndtvprofit.com/real-estate/sales-for-luxury-apartments-surges-by-10-says-jll-report",
    "summary": "The real estate market in India, particularly luxury residential properties, witnessed a notable increase in sales, with apartments priced at **Rs 1 crore and above** rising by **10%** in the first quarter of 2025. In contrast, the sales of properties priced below Rs 1 crore faced a significant decline, decreasing by up to **32%**. This trend shift, primarily driven by a **22% year-on-year growth** in the segment of housing priced between **Rs 1.5 to 3 crore**, alongside a **20% increase** in the **Rs 3 to 5 crore** premium housing segment, indicates a strong demand for high-end properties.\n\nKey factors contributing to this growth include:\n• **Increased employment opportunities** through the expansion of multinational companies and startups.\n• Continuous **infrastructural developments** in major cities.\n• Shifts in buyer preferences reflecting **evolving lifestyles**, with a focus on larger and more premium spaces indicating rising wealth among homebuyers.\n\nCities like **Bengaluru**, **Mumbai**, and **Pune** emerged as frontrunners in residential sales, collectively accounting for **66%** of overall sales in the top seven cities in India, underscoring their dominance in the real estate sector.\n\nThis robust demand for higher-priced properties has been critical in stabilizing overall real estate sales, absorbing potential declines in lower segments and maintaining market vitality."
  },
  {
    "title": "Hit by U.S. tariff, Indian stainless steel players turn to domestic market",
    "url": "https://www.thehindu.com/business/hit-by-us-tariff-indian-stainless-steel-players-turn-to-domestic-market/article69475699.ece",
    "summary": "The Indian stainless steel industry is experiencing significant shifts due to the imposition of tariffs by the U.S. administration. Originally targeted for export, this production is now being redirected towards the domestic market as exporters face confusion and uncertainty about the future of trade with the U.S. Despite a temporary pause on reciprocal tariffs by President Trump, the existing 25% tariffs on steel and aluminum imports continue to create instability within the industry.\n\n**Key Points:**\n\n• **Impact on Exports:** The uncertainty surrounding tariff changes has caused a pause in business discussions between Indian manufacturers and U.S. buyers, leading to a significant decline in direct transactions.\n\n• **Strategic Shift:** Companies like Rajputana Stainless Ltd. are seeking to utilize their production capacity within the Indian and Middle Eastern markets, which is crucial given that approximately 10-15% of their output was previously slated for U.S. imports.\n\n• **Concerns about Competition:** Indian manufacturers express worry over potential dumping by Chinese steel producers, given China's status as a leading steel manufacturer, which could further pressure the Indian market.\n\n• **Adaptation Strategies:** Some companies, like Avtar Steel Ltd., report that they are unaffected due to their lack of exports to the U.S., highlighting their ability to adapt based on prior experiences with U.S. tariffs.\n\n• **Rising Domestic Demand:** The domestic consumption of stainless steel is expected to rise as infrastructure and sustainable projects increase across both private and government initiatives. The expected increase in per capita use—from 3.1 kg in FY 2024 to an estimated range of 4.5 to 5.5 kg by FY 2030—indicates solid growth potential for Indian producers.\n\n• **Industry Resilience:** India's stainless steel industry appears determined to navigate current challenges by focusing on customization for clients—a strength that distinguishes them from competitors like China—and leveraging government initiatives to reduce reliance on imports.\n\nAs discussions continue in forums such as the GSSE Summit in June 2025, stakeholders are optimistic that U.S. import levels will stabilize, enabling a continuing partnership in the market. This resilience is essential as the industry charts its course in the face of global trade shifts."
  },
  {
    "title": "ED Searches Premises Linked To Gensol, Registers Case Under FEMA",
    "url": "https://www.ndtvprofit.com/business/gensol-fraud-ed-takes-puneet-jaggi-into-custody-in-fema-case-say-sources",
    "summary": "On April 24, 2025, the Enforcement Directorate (ED) of India executed searches across various locations associated with the promoters of Gensol Engineering Ltd., Puneet Singh Jaggi and Anmol Singh Jaggi. This action comes in response to allegations of financial misconduct and fund diversion related to the company's operations. Reports initially suggested Puneet Singh Jaggi's arrest; however, the ED denied these claims, clarifying that he is currently being questioned in Delhi.\n\nThe scrutiny arose following an interim order from the Securities and Exchange Board of India (SEBI), which curtailed the Jaggi brothers' involvement in the securities market and barred them from key managerial roles in Gensol. The SEBI investigation revealed that substantial funds amounting to ₹975 crore raised by Gensol for the procurement of electric vehicles (EVs) were potentially mismanaged, with only about 4,704 EVs purchased for approximately ₹567.73 crore out of this amount.\n\nKey details include:\n\n• **Allegations**: Funds allegedly diverted for luxury property purchases and personal expenses.\n  \n• **Loan Mismanagement**: Gensol raised over ₹977 crore in loans from institutions, intending to buy 6,400 EVs, while discrepancies in funds amounting to ₹200 crore were highlighted.\n\n• **Further Investigations**: The ED is looking into the transactions linking Gensol to other entities owned by the promoter brothers, suggesting broader financial improprieties.\n\nThis ongoing investigation underscores significant regulatory scrutiny in India's financial sector, particularly concerning corporate governance and compliance with financial law."
  },
  {
    "title": "IEX Q4 Results: Net profit soars 21% to Rs 117 crore; Rs 1.5/share dividend declared",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/iex-q4-results-net-profit-soars-21-to-rs-117-crore-rs-1-5/share-dividend-declared/articleshow/120590602.cms",
    "summary": "Indian Energy Exchange (IEX) announced significant financial results for the fourth quarter of FY25, reflecting a consolidated net profit increase of **21%**, reaching **Rs 117.11 crore**, compared to **Rs 96.68 crore** in Q4 FY24. This growth is attributed primarily to higher revenues. \n\nKey financial figures include:\n• **Total Income** for Q4 FY25 increased to **Rs 174.59 crore** from **Rs 149.28 crore** in the previous year.\n• For the entire fiscal year 2024-25, consolidated net profit rose to **Rs 429.16 crore**, up from **Rs 350.78 crore** in FY24.\n• **Total income** for this fiscal year was **Rs 657.36 crore**, an increase from **Rs 550.84 crore** the previous year.\n\nThe board of directors declared a final dividend of **Rs 1.50** per equity share, contingent upon approval at the upcoming annual general meeting, with **May 16, 2025** set as the record date for determining shareholder eligibility. \n\nIn operational highlights, IEX achieved its highest-ever quarterly traded electricity volume of **31.7 billion units (BU)** in Q4 FY25, marking an **18.1% year-on-year increase**. Additionally, **68 lakh renewable energy certificates (RECs)** were traded during this quarter, representing a **108% increase**, establishing a new quarterly record. \n\nFor FY25, IEX recorded a total traded electricity volume of **121 BUs**, up **18.7%**, and traded **178 lakh RECs**, which is a **136.3%** increase year-on-year, also marking a new annual record. Standalone profit after tax in Q4 FY25 surged to **Rs 112 crore**, a **17.8%** increase from **Rs 95.1 crore** in Q4 FY24, culminating in a standalone profit after tax of **Rs 414.6 crore** for the fiscal year, up **21.4%** from **Rs 341.4 crore** in FY24."
  },
  {
    "title": "Market Trading Guide: Vimta Labs among 2 stock recommendations for Friday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-vimta-labs-among-2-stock-recommendations-for-friday/slideshow/120590438.cms",
    "summary": "The domestic stock market, represented by indices such as Nifty, experienced mild profit booking following a recent rally, aligning with global trends that have shown signs of selling pressure due to concerns over unresolved tariff disputes. Analysts suggest that while the short-term outlook remains bullish, a significant uptrend can only be expected if resistance levels at 24,350 and 80,100 are surpassed. \n\nKey insights from the market include the following:\n\n• A potential upward movement could occur, targeting ranges between **24,450-24,500** and **80,400-80,500**, if the resistance levels are broken.\n\n• Conversely, should the market dip below **24,200/79,600**, an intraday correction could quickly push indexes down to levels around **24,100/79,300**.\n\n**Stock Recommendations**:\n1. **Banarisug**:\n   - **Entry Price**: ₹4,135\n   - **Target**: ₹4,557\n   - **Stop Loss**: ₹3,912\n   - The stock has shown a bullish breakout supported by strong trading volume.\n\n2. **Vimta Labs**:\n   - **Entry Price**: ₹1,153\n   - **Target**: ₹1,256\n   - **Stop Loss**: ₹1,090\n   - Demonstrated a breakout from its trading range, indicating positive market sentiment.\n\nThese stocks have been identified based on recent performance metrics and are suggested for potential trading. It's advised that investors consider these recommendations closely in light of individual risk profiles and market conditions."
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/120590270.cms",
    "summary": "The Indian stock market is experiencing a period of consolidation, having closed lower on April 24, 2025. The benchmark indices, BSE Sensex and Nifty 50, both declined, with the Sensex falling by 315.06 points (0.39%) to close at 79,801.43 and the Nifty 50 decreasing by 82.25 points (0.34%) to settle at 24,246.70. This downtrend interrupted a seven-session rally, led primarily by profit booking within the financial sector amid rising geopolitical tensions following recent events in Jammu and Kashmir.\n\n**Market Drivers:**\n• **Profit Booking:** Recent gains led to a corrective phase where analysts noted profit-taking among investors.\n• **Global Cues:** Global markets showed selling pressure, particularly due to uncertainties surrounding U.S.-China trade relations, impacting investor sentiment.\n• **Weak FMCG Earnings:** The FMCG sector reported disappointing earnings, attributed to reduced volumes and pressed margins. Despite this, improved demand in urban and rural areas suggests potential recovery.\n• **Analytical Insights:** \n  - Vinod Nair from Geojit Investments indicated that despite weak FMCG results and geopolitical tensions, the improving demand could help revive the sector.\n  - Ajit Mishra from Religare Broking recommended focusing on stock selection, advocating for buying on market dips as a strategic approach.\n\n**Technical Analysis:**\n• The Nifty index maintained a mostly flat trajectory, with key resistance levels identified at 24,300 and 24,500. A potential correction could see levels retreating to 21,900 if the index falls below 22,300.\n\n**Active Stocks:**\n• **Most Active by Turnover:** HDFC Bank, ICICI Bank, and Bajaj Finance topped the charts in trading volume.\n• **Most Active by Volume:** Vodafone Idea led in trade volume, followed by Reliance Power and Suzlon Energy.\n\n**Market Sentiment:**\n• Market sentiment remained neutral, with mixed results as out of 4,086 stocks traded, 2,063 experienced declines, while 1,887 saw advances.\n\n**Market Outlook:**\nReassessments in stock selections and market strategies are advised as analysts predict continued consolidation, recommending investors remain vigilant and consider opportunities in undervalued sectors amidst market fluctuations."
  },
  {
    "title": "Vodafone Idea ropes in Cisco to boost its 4G, 5G services; to enhance network quality for customers",
    "url": "https://www.thehindu.com/business/vodafone-idea-ropes-in-cisco-to-boost-its-4g-5g-services-to-enhance-network-quality-for-customers/article69486802.ece",
    "summary": "Vodafone Idea (Vi) has announced a strategic partnership with Cisco aimed at enhancing its 4G and 5G network infrastructure. This collaboration focuses on creating a more agile, efficient, and scalable network that improves overall customer experience and service delivery. Key aspects of this partnership include the implementation of a multiprotocol label switching (MPLS)-based transport network, which is designed to enhance the reliability and robustness of Vi's network.\n\n• **Network Transformation**: Vi's integration of Cisco’s MPLS solution is expected to facilitate efficient management of high data traffic volumes, thereby improving network performance and stability.\n\n• **Performance Expectations**: The updates are anticipated to significantly enhance digital experiences for customers, supporting both individual users and businesses within India.\n\n• **Expert Insights**: Gordon Thomson, Cisco's Vice President for Service Provider in EMEA, emphasized the necessity of developing a robust 4G/5G backhaul network for ensuring seamless connectivity. Jagbir Singh, Vi's Chief Technology Officer, highlighted that this new transport network addresses the challenges posed by modern network environments, ensuring high levels of performance and security.\n\nIn summary, this partnership is a critical step for Vodafone Idea as it aims to enhance its service offerings through advanced technological solutions, catering to the growing demands of digital connectivity in India."
  },
  {
    "title": "Dollar rally unravels as investors shrug off Trump U-turns",
    "url": "https://economictimes.indiatimes.com/markets/forex/dollar-rally-unravels-as-investors-shrug-off-trump-u-turns/articleshow/120589615.cms",
    "summary": "The U.S. dollar experienced a significant decline on April 24, 2025, following renewed investor concerns regarding the unresolved U.S.-China trade tensions. After a brief rally attributed to President Donald Trump's softened rhetoric towards China, optimism quickly waned as Chinese officials indicated no ongoing negotiations, urging the U.S. to rescind unilateral tariffs for constructive dialogue.\n\nKey points include:\n\n• **Dollar Performance**: The dollar fell by 0.71% to 142.395 yen. Despite this drop, it remains above the 140 mark seen the previous week.\n\n• **Trade Dynamics**: Investors initially reacted positively when Trump backed down from threats against Federal Reserve Chairman Jerome Powell, but subsequent mixed messages from officials revived uncertainty.\n\n• **Market Reactions**: The dollar has dropped 4.8% in April, marking a troubling trend for U.S. assets. This decline is the most substantial monthly decrease since November 2022.\n\n• **Geopolitical Tensions**: The strategic implications of Trump's tariffs are becoming clear, with observations that they have majorly affected the dollar’s standing against a basket of global currencies, marking its weakest start to the year since the 1970s.\n\n• **Safe-Haven Currencies**: In reaction to the dollar's struggles, the Swiss franc saw appreciation, strengthening against the dollar as investors sought safe-haven assets.\n\n• **Impact on Bitcoin**: Bitcoin also recorded a decrease of 0.84%, reflecting broader market sentiment. Trump's associated meme coin surged by 33%, triggered by promotional events despite its current lower valuation compared to its launch. \n\nOverall, the interplay between U.S. domestic policy and international trade relations continues to create volatility in the currency markets. Investors are closely monitoring how these developments will transpire as they significantly impact market dynamics."
  },
  {
    "title": "TechM Q4 net soars 76% on tax benefit, overall operating profitability improvement",
    "url": "https://www.thehindu.com/business/techm-q4-net-soars-76-on-tax-benefit-overall-operating-profitability-improvement/article69487423.ece",
    "summary": "Tech Mahindra, the technology sector arm of the Mahindra Group, reported a remarkable **76.5% year-on-year increase** in its **fourth-quarter net profit**, reaching **₹1,167 crore**, a notable rise from **₹661 crore** in the same quarter of the previous year. This growth was primarily attributed to an **overall improvement in operating profitability**, aided by a favorable tax rate influenced by one-off benefits during the quarter.\n\nKey financial highlights include:\n• **Revenue growth**: The company's revenue climbed by **4%**, totaling **₹13,384 crore**, up from **₹12,871.3 crore** in the comparable quarter from the prior year. This was despite a downturn in the global communications sector that negatively impacted revenue.\n• **Full-year performance**: For FY2025, Tech Mahindra's revenue was reported at **₹52,988.3 crore**, marking a **1.9% increase** from **₹51,995.5 crore** in the preceding year. Net profit for the entire fiscal year saw a substantial rise to **₹4,253 crore**, compared to **₹2,396.8 crore** the previous year.\n• **Deal wins**: The company secured contracts worth **$2.7 billion**, reflecting a **42% year-on-year increase**, underscoring strong client relationships and confidence in Tech Mahindra's strategic direction. \n\nMohit Joshi, CEO and Managing Director, emphasized the company's strong foundation for transformation, attributing success to investments in leadership and capabilities aimed at accelerating strategic objectives. The company also reported a **60% surge in operating profit** through enhanced execution and cost management strategies. Notably, a **final dividend of ₹30 per share** has been recommended for the fiscal year ending March 2025, and the overall employee attrition rate was recorded at **11.8%** as of Q4, with the total headcount at **1,48,731**, showing a decrease from the previous quarter."
  },
  {
    "title": "Reliance Jio Tops Subscriber Additions In February: TRAI Data",
    "url": "https://www.ndtvprofit.com/business/reliance-jio-tops-subscriber-additions-in-february-trai-data",
    "summary": "As of February 2025, Reliance Jio led the Indian wireless broadband market by adding **1.77 million subscribers**, bringing its total to **46.5 crore** subscribers. Airtel followed, adding **1.59 million subscribers**, resulting in a **28 crore** total. In contrast, Vodafone Idea experienced a loss of **20,720 customers**, and Bharat Sanchar Nigam Ltd. (BSNL) lost **566,000 subscribers**. As for market share, Jio and Airtel together accounted for a significant portion of the market, with the five leading providers (including Vodafone Idea and BSNL) making up **99.98%** of the wireless broadband sector.\n\nIn total, India's wireless subscribers rose by **0.24%**, reaching **1.154 billion** by the end of February 2025. Mobile subscriptions in urban areas constituted **62.8 crore**, while rural areas contributed **52.6 crore**. The mobile teledensity increased slightly, moving from **81.65%** to **81.79%** during the same period. \n\nKey Highlights:\n• **Subscriber Gains:**\n  - Jio: +1.77 million\n  - Airtel: +1.59 million\n  - Vodafone Idea: -20,720\n  - BSNL: -566,000\n\n• **Total Wireless Subscribers:** 1.154 billion\n• **Market Share:** Jio (approximately 40%+), Airtel (about 25%+)\n• **Mobile Teledensity:** Increased to 81.79% \n\nThe data reflects a highly competitive environment, with significant implications for players in the telecom sector as they strategize for growth amidst evolving market dynamics."
  },
  {
    "title": "Laurus Labs Q4 net surges to ₹234 cr. on higher CDMO revenue",
    "url": "https://www.thehindu.com/business/laurus-labs-q4-net-surges-to-234-cr-on-higher-cdmo-revenue/article69486661.ece",
    "summary": "The financial performance of Laurus Labs for the fourth quarter ending March 2025 has shown remarkable improvement, with a consolidated net profit soaring to **₹233.87 crore**, compared to **₹75.32 crore** in the prior year. This substantial growth is attributed to a competitive **19% increase in overall revenue**, which surged to **₹1,720.30 crore** from **₹1,439.67 crore**. \n\nKey Highlights:\n• **Revenue from operations**: Rose by **19%**, reaching **₹1,720.30 crore**. \n• **CDMO (Contract Development and Manufacturing Organization) revenue**: Increased significantly by **85%** to **₹490 crore**, up from **₹265 crore**.\n• **Generics business revenue**: Grew by **5%** to **₹1,230 crore**, supported by a **27%** rise in the finished dosage form (FDF) division, which alone contributed **₹544 crore**. \n• Conversely, revenue from the active pharmaceutical ingredients (APIs) division saw a decline of **8%**, totaling **₹686 crore**, compared to **₹745 crore** the previous year.\n\nFor the fiscal year 2024-25, Laurus Labs recorded an overall net profit of **₹354.41 crore**, marking an increase from **₹168.21 crore**. The revenue from operations for the year surged to **₹5,553.96 crore**, an increase from **₹5,040.83 crore**.\n\nManagement Outlook:\n• CEO Satyanarayana Chava emphasized the strength of the company’s business model and expressed confidence in future growth. \n• CFO V.V. Ravi Kumar reiterated a commitment to prioritizing investments in high-value business opportunities and affirmed expectations for continued revenue growth into FY25, particularly post ramp-up of new assets.\n\nAdditionally, the company announced an **interim dividend of ₹0.80** per equity share, with **May 9** set as the record date for shareholder eligibility.\n\nOverall, the results underscore Laurus Labs' solid performance, bolstered by a strong demand for its contract manufacturing and generics segments."
  },
  {
    "title": "Jaggi brothers: How the Gensol founders fell",
    "url": "https://www.thehindu.com/business/Industry/jaggi-brothers-how-the-gensol-founders-fell/article69487028.ece",
    "summary": "On April 25, 2025, news reported a significant downfall of the Gensol founders, Anmol and Puneet Jaggi, who have been barred by the Securities and Exchange Board of India (SEBI) from holding directorial positions in their company. Gensol Engineering Ltd, once celebrated as a leader in renewable energy solutions, saw a drastic decline in its stock value, plunging 90% following allegations of improper fund diversion by the brothers. \n\n• **Background**: Founded in 2007, Gensol, which operates in the solar power sector, is known for providing Engineering, Procurement, and Construction (EPC) services. Anmol Jaggi had pursued initial interests in renewable energy during his college years, further leading to business ventures in the field. His brother, Puneet, also held a key role in Gensol, along with creating related technologies.\n\n• **Financial Misconduct**: An internal SEBI investigation revealed that the Jaggis misused corporate funds for personal luxuries, including real estate investments and luxury goods. Specific allegations include purchasing a high-end apartment in DLF Gurgaon using company funds, while also causing operational concerns at Gensol's electric vehicle (EV) plant in Pune, which was reported to have minimal activity.\n\n• **Impact on Associated Ventures**: The fallout from this investigation has also severely impacted BluSmart, an electric cab service co-founded by the Jaggis. With Gensol’s supply chain being pivotal for BluSmart's fleet, services have been suspended amidst the regulatory scrutiny.\n\n• **Regulatory Consequences**: As a result of the findings, SEBI has prohibited the Jaggi brothers from accessing the securities market or holding management roles in any listed company until further notice. The agency has initiated further investigations to clarify the extent of financial discrepancies and ensure accountability for investors.\n\n• **Market Reactions and Stock Performance**: Gensol’s encouraging growth trajectory ended abruptly, with its credit rating reducing to a D-rating due to losses exceeding revenues for three consecutive years. Share prices that had previously surged to ₹2,392 fell sharply following SEBI's findings.\n\nOverall, the allegations and regulatory responses reflect a troubling saga of corporate governance failures, bringing into question the responsibilities of company directors and the need for stringent oversight in the renewable energy sector. The Jaggi brothers' case serves as a critical reminder of the importance of fiduciary duties and ethical business conduct."
  },
  {
    "title": "RBI caps FEMA violation penalty at Rs 2 lakh to ease compliance burden",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-caps-fema-violation-penalty-at-rs-2-lakh-to-ease-compliance-burden/articleshow/120600383.cms",
    "summary": "The Reserve Bank of India (RBI) has enacted a policy change that significantly reduces penalties for violations of the Foreign Exchange Management Act (FEMA). Under the new guidelines, the maximum penalty for FEMA contraventions is now capped at ₹2 lakh, a notable shift from the previous system where penalties were determined as a percentage of the violation amount, ranging from 0.30% to 0.75%. \n\n• **Impact of Changes:**\n  - This adjustment applies to a variety of violations, including:\n    • The misuse of the Liberalised Remittance Scheme (LRS) for funds not reinvested within 180 days.\n    • Export activities not completed within one year of receiving funds in advance.\n    • Gifting high-value shares without RBI approval.\n\n• **Regulatory Context:**\n  - The revised penalties were included in the master directions issued by the RBI, emphasizing that the changes were made with consideration of the nature of the violations and public interest.\n  - The change is expected to alleviate compliance burdens for individuals and corporations involved in high-value transactions that previously incurred substantial fines.\n\n• **Expert Opinions:**\n  - Financial experts, including Harshal Bhuta, a partner at a chartered accountant firm, have indicated that the rationalization of the penalty structure represents a significant ease on the compliance pressures faced by entities dealing with FEMA regulations.\n\nThis policy revision illustrates the RBI's aim to strike a balance between maintaining regulatory oversight and facilitating smoother financial operations, ultimately supporting economic activities while ensuring compliance with the law."
  },
  {
    "title": "These 5 stocks with decreased DII shareholding in March '25",
    "url": "https://economictimes.indiatimes.com/markets/web-stories/these-5-stocks-with-decreased-dii-shareholding-in-march-25/slideshow/120588632.cms",
    "summary": "The provided content includes detailed configurations for tracking web analytics and an article discussing the decrease in Domestic Institutional Investor (DII) shareholding for certain stocks as of March 2025. Below is a comprehensive summary of the information.\n\n**Web Analytics Configuration**  \nThe configurations are designed for tracking user interactions on web stories and can be categorized into two primary setups:\n\n• **Universal Analytics (UA) Configuration:**  \n  - **gtag_id:** UA-198011-5 \n  - **Triggers include:**\n    - *Pageview:* Triggers on the story page being visible, recording views.\n    - *Story End:* Tracks completion of a web story, detailing events such as the name, action, category, and associated goals.\n    - *Link Clicks:* Monitors interactions with specific links on the page, capturing data on call-to-action button clicks and read more actions.\n\n• **Google Analytics 4 (GA4) Configuration:**  \n  - **MEASUREMENT_ID:** G-WZ3Z4GGVRC\n  - **Features:**\n    - *Page Loaded Event:* Initiates on page load, logging specific variables related to the story, such as title, template, authors, and keywords.\n    - *Enhanced tracking features excluded:* Elements like web vitals and performance timing tracking are currently disabled.\n\n**Article Overview: Decrease in DII Shareholding**  \nThe article highlights five stocks from the Nifty500 that have experienced a decrease in DII shareholding:\n\n• **Aavas Financiers:**\n  - DII shareholding fell from **24.98%** in December 2024 to **10.75%** in March 2025.\n\n• **IndusInd Bank:**\n  - DII shareholding reduced from **42.69%** to **36.70%** during the same period.\n\n• **Central Depository Services (India):**\n  - A drop in shareholding from **19.25%** to **15.42%**.\n\n• **PVR Inox:**\n  - Decreased from **40.03%** to **36.30%**.\n\n• **Can Fin Homes:**\n  - A decline in shareholding from **28.07%** to **24.59%**.\n\nThe decreases in DII shareholding may indicate a decline in domestic investors' confidence in these stocks, potentially owing to concerns regarding future performance or overall market conditions.\n\nFollowing these insights, suggestions imply that shifts in DII participation may reflect broader trends and warrant closer monitoring by investors."
  },
  {
    "title": "Gold climbs Rs 200 to Rs 99,400/10 gm amid renewed concerns over US-China standoff",
    "url": "https://economictimes.indiatimes.com/markets/commodities/gold-climbs-rs-200-to-rs-99400/10-gm-amid-renewed-concerns-over-us-china-standoff/articleshow/120588409.cms",
    "summary": "Gold prices have seen a rise of Rs 200, now priced at Rs 99,400 per 10 grams in the national capital. This increase follows renewed buying interest from stockists and jewelers, coinciding with a weaker dollar, as reported by the All India Sarafa Association. The previous day, gold had dropped to Rs 99,200 per 10 grams, marking a significant decrease of Rs 2,400 from the historic Rs 1 lakh mark.\n\nKey points include:\n• Gold of 99.9% purity rose Rs 200 to Rs 99,400.\n• Gold of 99.5% purity increased to Rs 98,900.\n• U.S. Treasury Secretary Scott Bessent indicated that the U.S.-China trade standoff may persist, influencing gold demand as a safe-haven asset.\n• President Trump has suggested the possibility of new tariff rates on China, further complicating negotiations.\n• Silver prices also appreciated, now at Rs 99,900 per kg from Rs 99,200 previously.\n• These fluctuations in the gold market followed a notable shift in sentiment due to Trump's trade policy changes, which unsettled investors and bolstered gold's attractiveness amid economic uncertainty. \n• Gold contracts for June delivery increased by Rs 1,046 to Rs 95,768 per 10 grams on the Multi Commodity Exchange.\n• In global markets, spot gold rose to USD 3,335.50 per ounce, indicating a 1.43% increase.\n\nInvestors and analysts suggest that upcoming U.S. economic data, including jobless claims and durable goods orders, will play a crucial role in future price movements of gold and other precious metals."
  },
  {
    "title": "Cryptocurrency campaigners call for Swiss central bank to hold bitcoin",
    "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/cryptocurrency-campaigners-call-for-swiss-central-bank-to-hold-bitcoin/articleshow/120588360.cms",
    "summary": "Cryptocurrency campaigners are increasingly urging the Swiss National Bank (SNB) to acquire bitcoin as a strategy to diversify its reserves amidst global economic instability exacerbated by U.S. President Donald Trump's tariffs. This call comes after advocates initiated a referendum in December to modify the Swiss constitution, proposing that the SNB include bitcoin in its reserves alongside gold. \n\nKey points from the campaign include:\n\n• **Economic Context**: The campaign is motivated by a shift towards a multipolar world, where traditional currencies like the dollar and euro are declining in strength.\n\n• **Arguments for Bitcoin**: Proponents argue that holding bitcoin can insulate the SNB from political influences tied to its existing foreign currency holdings, predominantly in dollars and euros. Luzius Meisser, a notable supporter, highlighted that bitcoin is less susceptible to inflation, contrasting it with fiat currencies often subject to deficit spending.\n\n• **Public Interest**: Approximately 11% of the Swiss population has invested in cryptocurrencies, reflecting a growing mainstream acceptance. Despite this, the SNB has expressed caution due to bitcoin's price volatility and security vulnerabilities, with SNB Chairman Martin Schlegel emphasizing that cryptocurrencies remain largely unregulated software with potential flaws.\n\n• **Advocacy for Technological Trust**: Yves Bennaim, another campaign organizer, asserts that the underlying technology of bitcoin is significantly robust and continuously enhancing. He points out that, despite personal investments in bitcoin, the advocacy is not driven by self-interest.\n\n• **Financial Implications**: The bitcoin market, valued at nearly $2 trillion, is considered the most liquid and stable digital asset market, with proposals suggesting that even a minor allocation—1-2% of the SNB's reserves—could yield benefits given bitcoin's increasing value and adoption.\n\nOverall, the campaign highlights a crucial intersection of monetary policy and emerging digital currencies, pushing for a re-evaluation of traditional reserve strategies in light of modern financial innovations."
  },
  {
    "title": "India Inc revenue growth to remain flat, profitability to widen in Q4: Crisil",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-revenue-growth-to-remain-flat-profitability-to-widen-in-q4-crisil/articleshow/120588323.cms",
    "summary": "India's corporate sector, as analyzed by Crisil Ratings, is projected to experience stagnant revenue growth of approximately **5-6%** in the fourth quarter. However, profitability is anticipated to improve, with operating profit margins expected to widen to **8%**, reflecting an increase of **up to 0.60%** compared to the same period last year.\n\nKey insights include:\n\n• **Sector Analysis**: The estimates are based on over **400 companies** representing more than **50%** of the National Stock Exchange's market capitalization. Major contributors to revenue growth are consumer-driven sectors, notably excluding staples.\n\n• **Telecom Growth**: The telecom sector is expected to see a **15%** increase in revenue, aided by recent tariff hikes and new premium **5G** plans.\n\n• **Retail and FMCG Performance**: Retail revenue growth is projected at **17%**, driven by demand in value fashion and grocery sectors. Conversely, the FMCG segment might see a moderate growth of **4-6%**, primarily due to pricing strategies amidst subdued volume increases.\n\n• **Export Revenues**: Overall export revenue could rise by about **4%**, with **2-3%** growth in information technology services and **8%** in pharmaceuticals.\n\n• **Agricultural Sector**: The agricultural sector, including fertilizers, is likely to witness revenue growth of between **17-19%**, spurred by stable crop production and healthy disposable incomes.\n\n• **Profitability Trends**: Among the top sectors, **five** demonstrated expansion in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) margins, while **five** others, including automobiles and FMCG, experienced declines attributed to rising costs of essential inputs.\n\n• **Challenges**: The automobile sector's EBITDA margin is forecasted to drop by **1%**, exacerbated by a **25%** rise in aluminum prices. The IT services sector's margins may also decrease due to increased marketing and travel expenses.\n\nThis comprehensive evaluation underscores a generally positive trend in profitability against a backdrop of flat revenue growth, highlighting the significant variances across different sectors within India's economic landscape."
  },
  {
    "title": "The Retail Bond Boom: How High-Yield Debt is Becoming Mass Market",
    "url": "https://economictimes.indiatimes.com/markets/bonds/the-retail-bond-boom-how-high-yield-debt-is-becoming-mass-market/videoshow/120588160.cms",
    "summary": "High-yield bonds and structured debt have transitioned from being exclusive to high-net-worth individuals (HNWIs) to becoming accessible to everyday investors due to advancements in digital platforms. In a recent ETMarkets Live stream, Saurav Ghosh and Vineet Agrawal, Co-founders of Jiraaf, discussed this significant shift with moderator Shradha Jananda. \n\nKey Highlights:\n\n• **Market Openness**: Digital platforms are facilitating access to India's fixed income market for all investors, not just the affluent. \n\n• **Jiraaf's Role**: The company is democratizing private credit and structured products, traditionally restricted to elite circles, thereby broadening investment opportunities for retail investors.\n\n• **Fixed Income Frontier**: The conversation emphasized that fixed income is poised to be a crucial area for Indian investors, enhanced by technological innovations that improve access to various debt instruments.\n\n• **Building Trust**: A vital part of expanding the retail bond market includes establishing trust and transparency to foster investor confidence.\n\n• **Investment Alternatives**: This evolution presents an attractive alternative to equity investments, catering to a transforming landscape of retail investors seeking diversified options.\n\nThis dialogue on how digital capabilities are reshaping investment avenues signals a pivotal moment for the Indian financial market, inviting more individuals to participate in previously inaccessible investment opportunities."
  },
  {
    "title": "Pakistan markets crash: KSE-100 plunges 2,500 pts as India suspends Indus Water treaty",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/pakistan-markets-crash-kse-100-plunges-2500-pts-as-india-suspends-indus-water-treaty/videoshow/120587995.cms",
    "summary": "The Pakistan Stock Exchange experienced a dramatic decline, with the KSE-100 index plummeting over 2,500 points. This significant drop was triggered by escalating tensions following India's robust diplomatic and military response to the recent Pahalgam attack. In a related economic context, the International Monetary Fund (IMF) recently revised Pakistan's fiscal year 2025 Gross Domestic Product (GDP) growth forecast downward to 2.6%. These developments indicate that Pakistan's economy is facing considerable challenges amidst mounting geopolitical tensions.\n\n• **Market Impact:** \n  - KSE-100 index dropped more than 2,500 points.\n  - Investors reacted negatively to India's military stance.\n  \n• **Economic Forecast:** \n  - IMF's GDP projection for Pakistan reduced to 2.6% for FY25.\n  \n• **Geopolitical Context:** \n  - Rising tensions between India and Pakistan have intensified after the Pahalgam attack, which influenced market sentiments.\n\nAs these factors converge, they paint a troubling picture for Pakistan's economic outlook, raising concerns about the country's financial stability and investment climate."
  },
  {
    "title": "Two Sharp with ET: Trump softens tone on China, HUL and Nestlé earnings show stress signs in FMCG",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-trump-softens-tone-on-china-hul-and-nestl-earnings-show-stress-signs-in-fmcg/videoshow/120587820.cms",
    "summary": "In a recent development, former President Donald Trump has indicated a potential reduction in tariffs imposed on China, suggesting that they could \"fall substantially.\" However, this gesture is met with resistance from Beijing, which is demanding a full rollback of tariffs while denying any ongoing trade discussions. \n\nMeanwhile, the financial performance of major consumer goods companies, Hindustan Unilever (HUL) and Nestlé India, has revealed troubling signs, indicating stress within the fast-moving consumer goods (FMCG) sector. Their earnings reports reflect a decrease in consumer spending, raising concerns about economic conditions affecting this industry.\n\nThe stock markets have responded adversely to these developments, resulting in increased volatility. In particular, prices of gold and oil have risen as investors seek safe-haven assets amid market uncertainty. This context forms the backdrop for the ongoing economic discourse, with experts analyzing the implications of Trump's tariff stance and the earnings struggles of HUL and Nestlé as indicators of broader economic trends.\n\n• **Trump's Tariff Comments:**\n  - Suggests significant reduction in tariffs on China.\n  - China demands a total rollback of existing tariffs.\n\n• **Earnings Reports:**\n  - HUL and Nestlé show signs of consumer stress.\n  - Decrease in consumption raises alarm regarding FMCG sector health.\n\n• **Market Reactions:**\n  - Increased volatility in stock markets.\n  - Rise in gold and oil prices as a reaction to economic uncertainties. \n\nThese developments necessitate close monitoring for any further implications on international trade dynamics and sector-specific forecasts within the consumer goods market."
  },
  {
    "title": "Indian markets end lower after 7-day rally; financials lead decline amid geopolitical tensions",
    "url": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/indian-markets-end-lower-after-7-day-rally-financials-lead-decline-amid-geopolitical-tensions/podcast/120587091.cms",
    "summary": "The Indian stock market faced a downturn on April 24, 2025, ending a seven-day rally, largely influenced by profit booking in financial stocks and rising geopolitical tensions following a terror attack in Jammu and Kashmir. Key highlights include:\n\n• **BSE Sensex Movement:** The Sensex fell by 315.06 points, concluding at 79,801.43.\n• **Nifty Performance:** The Nifty 50 index decreased by 82.25 points, settling at 24,246.70.\n• **Sector Performance:**\n  • **Gainers:** Sectors like Nifty Pharma, Commodities, Metal, and Media posted gains.\n  • **Losers:** Financial Services (FMCG) and Realty sectors declined by approximately 1%.\n• **Top Gainers:** Stocks of IndusInd Bank, UltraTech Cement, Tata Motors, and Tech Mahindra increased between 0.94% to 3%.\n• **Top Losers:** Companies like Hindustan Unilever, Eicher Motors, ICICI Bank, and Bharti Airtel experienced declines between 1% to 4%.\n• **Global Market Trends:** Japan's Nikkei index registered an upward trend, while markets in Hong Kong and China closed lower.\n• **Currency Update:** The Indian rupee appreciated by 0.2%, ending at 85.26 per U.S. dollar, attributed to dollar sales from exporters.\n\nThe market's response to geopolitical tensions and profit-taking highlights underlying vulnerabilities in investor sentiment during periods of political unrest."
  },
  {
    "title": "Sebi facilitates ease of doing biz for SM REITs; standardises disclosures in scheme offer document",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-facilitates-ease-of-doing-biz-for-sm-reits-standardises-disclosures-in-scheme-offer-document/articleshow/120587018.cms",
    "summary": "To enhance the business environment for Small and Medium Real Estate Investment Trusts (SM REITs), the Securities and Exchange Board of India (Sebi) has implemented standardized regulations for disclosures within draft scheme offer documents. This move aims to simplify public issue procedures associated with SM REITs.\n\nKey Features of Sebi's Regulation:\n\n• **Standardized Documentation:** The scheme offer document is now divided into two sections:\n   - **Key Information of the Trust (KIT):** Contains details about the SM REIT, its investment manager, trustee, and overall structure.\n   - **Key Information of the Scheme (KIS):** Focuses on specifics relevant to the individual scheme and its assets.\n\n• **Review Process:** \n   - For the initial scheme, both KIT and KIS must be submitted for Sebi’s approval.\n   - For subsequent schemes, only the KIS needs submission, while the KIT must be updated but not refiled if there are no changes.\n\n• **Disclosure of Changes:** Any significant updates to the KIT must be publicly disclosed on the SM REIT’s website and reported to Sebi and stock exchanges within a week.\n\n• **Regular Updates:** The investment manager is required to refresh the KIT every six months, ensuring its latest version is accessible on the SM REIT's website within 30 days of the reporting period's end.\n\n• **Initial Offer Requirements:**\n   - SM REITs can only make initial public offers within one year of receiving Sebi’s observations. If this period lapses, a new draft document must be filed.\n   - The minimum subscription for schemes opting to utilize leverage is set at 90% of the issue size; those not using leverage face a 100% requirement.\n\n• **SM REIT Structure:** \n   - Introduced in March 2024, SM REITs are tailored for smaller investments in real estate, with a minimum asset value of ₹50 crores, contrasting with the ₹500 crores for standard REITs.\n   - These trusts are required to allocate at least 95% of their assets to operational, revenue-generating properties and distribute 95% of net income to investors on a quarterly basis.\n\nThese reforms by Sebi are designed to bolster the operational efficacy of SM REITs, ultimately encouraging greater participation in the real estate investment landscape."
  },
  {
    "title": "These 7 smallcap stocks hit 52-week high and rally up to 50% in a month",
    "url": "https://economictimes.indiatimes.com/markets/web-stories/these-7-smallcap-stocks-hit-52-week-high-and-rally-up-to-50-in-a-month/slideshow/120586031.cms",
    "summary": "The provided data details the analytics setup and performance report for specific stocks within the BSE smallcap index, with a focus on recent achievements of those stocks at their 52-week highs.\n\n**Analytics Configuration Overview**\n- **Google Analytics Tags:**\n  • Gtag ID: UA-198011-5, with various triggers for tracking user engagement on web stories, including `pageview`, `storyEnd`, and `linkClick`.\n  • Events are categorized for specific user interactions (e.g., clicks on buttons linking to related content).\n  \n- **GA4 (Google Analytics 4) Insights:**\n  • Measurement ID: G-WZ3Z4GGVRC. \n  • Tracking page loads as events with parameters detailing the content, authors, publication date, and relevant keywords related to the stories.\n\n- **Additional Variables:**\n  • Tracking parameters including campaign identifiers and content categorization to enhance reporting accuracy.\n\n**Stock Performance Highlights as of April 24, 2025**\n- Despite a 315-point decline in the benchmark Sensex, seven **BSE smallcap stocks** achieved new 52-week highs, signifying strong market interest and potential for further growth:\n  \n  • **Paradeep Phosphates**: 52-week high at Rs 149, current market price (CMP) Rs 145.1, with a **52% gain** over the last month.\n  \n  • **Mangalore Chemicals & Fertilizers**: 52-week high at Rs 228.5, CMP Rs 211.95, with a **43% gain**.\n  \n  • **Choice International**: 52-week high at Rs 625, CMP Rs 623.25, reflecting a **25% gain**.\n  \n  • **GRM Overseas**: 52-week high at Rs 334, CMP Rs 330, showing a **20% gain**.\n  \n  • **JK Cement**: 52-week high at Rs 5,289.55, CMP Rs 5,233, with an **8% gain**.\n  \n  • **Astrazeneca Pharma India**: 52-week high at Rs 9,199, CMP Rs 8,926.15, growing by **5%**.\n  \n  • **Navin Fluorine International**: 52-week high at Rs 4,471, CMP Rs 4,352.9, with a **3% gain**.\n\nThese figures indicate a notable performance among selected stocks amidst a broader market slump, providing insight into trading opportunities and investor sentiment within the smallcap sector. The emphasis on significant price momentum at 52-week highs serves as an attractive signal for investors looking for growth potential."
  },
  {
    "title": "Stock markets decline after 7-day rally; HUL drops 4% post earnings",
    "url": "https://www.thehindu.com/business/markets/stock-markets-decline-after-7-day-rally-hul-drops-4-post-earnings/article69486483.ece",
    "summary": "On April 24, 2025, the Indian stock markets experienced a decline after a notable seven-day rally. The benchmark indices, Sensex and Nifty, closed lower due to profit-taking activities, prompted in part by disappointing financial results from Hindustan Unilever Ltd (HUL). Key details include:\n\n• **Market Performance**:  \n   - **Sensex**: Decreased by 315.06 points (0.39%) to close at 79,801.43, having hit a low of 79,724.55 during the session.  \n   - **Nifty**: Fell by 82.25 points (0.34%) to settle at 24,246.70.  \n   - Prior gains: Over the previous seven days, the Sensex had surged by 6,269.34 points (8.48%), while Nifty had increased by 1,929.8 points (8.61%).\n\n• **Key Stocks Impacted**:  \n   - Hindustan Unilever Ltd reported a drop in consolidated net profit by 3.35% for the fourth quarter of FY25, leading to a 4% decline in its shares.  \n   - Other notable decliners included ICICI Bank, Bharti Airtel, and several others from the top indices.\n\n• **Market Context**:  \n   - The market's decline mirrored global trends where Asian and European equities were subdued.  \n   - Investors reflected broader concerns over unresolved tariff disputes between the U.S. and China, contributing to the muted market activity.\n\n• **Other Economic Indicators**:  \n   - Nestle India reported a 6.5% decrease in its consolidated net profit following pressures from food inflation and a slowdown in urban consumption.  \n   - The overall consumer goods sector underperformed due to weaker volume growth and margin contraction.\n\nIn summary, the day's trading reflected a shift from recent bullishness to profit-booking amidst disappointing earnings reports, underlined by external market pressures."
  },
  {
    "title": "Tech Mahindra Announces Dividend Of Rs 30 Per Share",
    "url": "https://www.ndtvprofit.com/markets/tech-mahindra-announces-dividend-of-rs-30-per-share",
    "summary": "• Tech Mahindra has announced a **final dividend of ₹30 per share**, which is pending approval at the upcoming annual general meeting.\n\n• In Q4 of the fiscal year 2025, the company's consolidated net profit rose **19%**, amounting to **₹1,167 crore**, surpassing the expected **₹1,084 crore** as per analyst estimates.\n\n• The firm's revenue for the same quarter stood at **₹13,384 crore**, which is slightly below the consensus estimate of **₹13,460 crore**.\n\n• The significant rise in profit indicates robust performance, reflecting the firm's ability to outperform market predictions despite slight revenue underperformance. \n\n• The dividend announcement reflects the company’s commitment to returning value to its shareholders, showcasing its financial health and profitability growth."
  },
  {
    "title": "Breakout Stocks: How to trade JK Cement, AstraZeneca Pharma & GlaxoSmithKline Pharma that hit 52-week high?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-jk-cement-astrazeneca-pharma-amp-glaxosmithkline-pharma-that-hit-52-week-high/slideshow/120585644.cms",
    "summary": "The Indian stock market experienced a deviation from its recent upward trend, with the Nifty50 closing at **24,028.85**, down by **217.86 points**. This decline marks a departure from a consecutive seven-day rise, influenced by subdued global stock market cues.\n\n**Market Highlights:**\n• The **BSE Sensex** decreased by over **300 points**.\n• Despite the overall market drop, **metal** and **healthcare** sectors showed increased buying interest.\n• Conversely, **banks**, **FMCG**, and **real estate** sectors recorded significant selling pressure.\n\n**Breakout Stocks:**\n1. **JK Cement**:\n   • Increased by **more than 3%**, showing a breakout above critical resistance levels (Rs 4,852 - Rs 4,971).\n   • Recorded a **24.88%** gain in the last six months and **25.43%** in the past year.\n   • Targets for future movement: **Rs 6,288** (Target 1) and **Rs 6,678** (Target 2) with a stop-loss at **Rs 4,642**.\n   \n2. **AstraZeneca Pharma**:\n   • Experienced a minor decline of over **1.5%** on the day but maintains strong bullish momentum.\n   • Targeted growth to **Rs 11,250** with a stop-loss at **Rs 8,385**; positive returns of **25%** in six months and **69.26%** in one year.\n\n3. **GlaxoSmithKline Pharma**:\n   • Trading near its all-time high of **Rs 2,916**, facing selling pressure at resistance level **Rs 3,083**.\n   • Potential growth targets: **Rs 4,500** and **Rs 5,500** if it breaks resistance, with a stop-loss at **Rs 2,760**.\n\nThis market update underscores a momentary pullback in an otherwise optimistic environment, particularly highlighting key performances and future potential within specific stocks. These insights may guide investors in making informed trading decisions as market dynamics evolve."
  },
  {
    "title": "PM Modi urges industry to come together to build a resilient, revolutionary, and steel-strong India",
    "url": "https://www.thehindu.com/business/Industry/pm-modi-urges-industry-to-come-together-to-build-a-resilient-revolutionary-and-steel-strong-india/article69486142.ece",
    "summary": "Prime Minister **Narendra Modi** addressed the **India Steel 2025** event on April 24, 2025, emphasizing the need for the steel industry to unite in building a \"**resilient, revolutionary, and steel-strong India**.\" In his address, he highlighted several key points critical to the growth and sustainability of the steel sector:\n\n• **Global Partnerships:** Modi urged the industry to enhance global partnerships to secure **raw materials** crucial for production, acknowledging dependence on imports for essential materials like coking coal and nickel.\n\n• **Production Increase:** He pointed out the necessity for increasing steel production capacity to **300 million tonnes by 2030**, up from **179 million tonnes** in the fiscal year 2024, with a target for **per capita steel consumption** to grow from **98 kg to 160 kg**.\n\n• **Use of Greenfield Mines:** The Prime Minister called for the exploration and utilization of **unused greenfield mines** to boost steel output, stressing that neglecting these resources would harm both the nation and the industry.\n\n• **Innovation and Technology:** He highlighted the importance of **innovation** and adopting advanced **processes and technologies** to enhance production efficiency and meet evolving global standards.\n\n• **Aim for Zero Imports:** Modi articulated a vision for the country to shift towards **zero imports**, aspiring to elevate steel exports to **500 million tonnes by 2047**, signalling a broader ambition for India to be recognized as a trusted supplier of high-grade steel globally.\n\n• **Infrastructure Development:** The ongoing **$1.3 trillion national infrastructure pipeline** is creating new opportunities for the steel sector, with significant development in areas such as transportation and smart city initiatives.\n\n• **Job Creation:** The steel sector was recognized for its potential to generate extensive employment opportunities, particularly for the youth of India.\n\n• **Government Policies:** Modi mentioned that government policies are reinforcing the steel industry's competitiveness at a global level, particularly through infrastructure contracts that prioritize locally produced steel.\n\nThe Prime Minister concluded his remarks by underscoring the collective responsibility of both the private and public sectors to engage in advancements in **research, manufacturing, and technological upgrades**, ensuring a robust and sustainable future for the Indian steel industry."
  },
  {
    "title": "Axis Bank Q4 Results: PAT flat at Rs 7,117.5 crore but beat estimates, NII up 5.5%",
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q4-results-pat-flat-at-rs-7117-5-crore-but-beat-estimates-nii-up-1-5/articleshow/120584069.cms",
    "summary": "Axis Bank has reported its Q4 results for the fiscal year ending March 2025, revealing a **Net Profit After Tax (PAT)** of **₹7,117.5 crore**, which is largely unchanged from the **₹7,123 crore** recorded in the same quarter the previous year. This figure slightly surpasses market expectations, which averaged around **₹6,681 crore**.\n\nKey Highlights of the Earnings Report:\n\n• **Net Interest Income (NII):** Increased by **5.5%** year-on-year to **₹13,810.5 crore**, an improvement from **₹13,089 crore** in Q4 of the preceding year, reflecting a robust growth trajectory.\n\n• **Net Interest Margin (NIM):** Enhanced by **4 basis points**, achieving a rate of **3.97%** for the quarter.\n\n• **Core Operating Profit:** Rose by an impressive **11% year-over-year**, totaling **₹10,575 crore**.\n\nAsset Quality:\n\n• **Gross Non-Performing Assets (GNPA):** Improved to **1.28%**, a decrease of 15 basis points from the previous year and 18 basis points quarter-over-quarter.\n\n• **Net Non-Performing Assets (NNPA):** Decreased to **0.33%**, marking a 2 basis point improvement compared to the previous quarter.\n\nBalance Sheet Growth:\n\n• The bank's total balance sheet expanded by **9% YoY** to **₹16,09,930 crore** as of March 31, 2025.\n\n• **Total Deposits:** Grew by **7% quarter-over-quarter** and **10% year-over-year**, with current account deposits experiencing a significant rise of **16%**.\n\n• **Advances:** Increased by **3% QoQ** and **8% YoY**, standing at **₹10,40,811 crore**. Retail loans, which account for **60%** of net advances, saw a quarterly growth of **3%**.\n\nLoan Portfolio Insights:\n\n• **Retail Loans:** Increased by **7% YoY** to **₹6,22,897 crore**.\n\n• **Corporate Loans:** Experienced an **8% YoY** growth.\n\nDividend Announcement:\n\n• The **Board of Directors** has recommended a dividend of **₹1 per share** for FY25, pending shareholder approval at the upcoming annual general meeting.\n\nIn conclusion, Axis Bank's performance for the fourth quarter illustrates steady growth in key areas, with notable improvements in asset quality and profitability metrics. The bank's strategy appears to be effective in navigating the competitive banking landscape, positioning itself positively for future growth."
  },
  {
    "title": "Gainers & Losers: HUL, Syngene among 6 stocks that hogged limelight today",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-hul-syngene-among-6-stocks-that-hogged-limelight-today/slideshow/120583950.cms",
    "summary": "The text encompasses a detailed account of stock market movements and analytics related to specific companies on April 24, 2025, alongside technical event triggers for Google Analytics tracking. \n\n**Stock Market Overview:**\n- **Indices Performance:**\n  - The **BSE Sensex** fell by **315 points** to close at **79,801.43**.\n  - The **Nifty50** declined by **82 points** to settle at **24,246.70**.\n  - Declines were attributed to significant pressure from **Reliance Industries** and banking stocks, although there were foreign inflows and optimistic sentiments regarding U.S.-China trade relations.\n\n**Notable Stock Movements:**\n• **SAMHI Hotels**: Increased by **11.3%** to **Rs 193.65** following a strategic partnership for a new investment platform.\n  \n• **Niva Bupa Healthcare**: Rose by **5.2%** to **Rs 85.60** after the approval of the CEO's reappointment by IRDAI.\n  \n• **Dalmia Bharat**: Shares surged by **4%** to an intraday high of **Rs 1,968.40**, spurred by a significant profit increase of **37.2%** year-on-year.\n  \n• **Syngene International**: Experienced a decline of **12.8%** to **Rs 653.85**, reporting a year-on-year drop in net profit.\n  \n• **Waaree Energies**: After a prior significant increase, the stock fell by **5.5%**, attributable to profit booking.\n  \n• **HUL**: Shares fell by **4%** to **Rs 2,325.25**, amidst reports of muted growth and margin pressure.\n\n**Technical Analytics Tracking Information:**\n- Various triggers were set up for monitoring user interactions, such as:\n  - **Page views** upon story visibility.\n  - **Event logging** for clicks on specific buttons, detailing event names, categories, and additional variables relevant to user engagement.\n  - Parameters capturing details about the browsing context, including page titles, template types, and publication metrics, uniquely identified for analytics purposes.\n\nThis synthesis presents a comprehensive snapshot of market activity and tracking mechanisms, showcasing both individual stock highlights and the overarching market trend on the specified date."
  },
  {
    "title": "India Plans To Launch Safety Ratings For Trucks And Buses",
    "url": "https://www.ndtvprofit.com/auto/india-plans-to-launch-safety-ratings-for-trucks-and-buses",
    "summary": "India is set to introduce **safety ratings for trucks and buses**, mirroring its existing protocol for cars. This initiative, spearheaded by the Union Ministry of Road Transport and Highways in collaboration with the Global New Car Assessment Program, aims to enhance the safety of commercial vehicles, thereby promoting safer cargo transport across India’s extensive road network.\n\nKey points include:\n\n• **High Accident Rates**: India records approximately **4.8 lakh road accidents annually**, leading to around **1.8 lakh fatalities**. This alarming statistic underscores the urgent need for improved road safety standards.\n\n• **Ministerial Remarks**: Transport Minister **Nitin Gadkari** emphasized that raising safety standards presents opportunities for **enhanced production quality**, ultimately leading to safer vehicles.\n\n• **Ongoing Evaluations**: The government is also focusing on developing safety assessment criteria for **battery-operated e-rickshaws**, addressing their significant safety concerns to bolster both vehicle quality and employment potential.\n\nThis move is part of India's overarching strategy to prioritize road safety, enhance highway infrastructure, and ensure vehicular safety regulations are effectively implemented."
  },
  {
    "title": "Rupee gains 16 paise to settle at 85.29 against U.S. dollar",
    "url": "https://www.thehindu.com/business/markets/rupee-gains-16-paise-to-settle-at-8529-against-us-dollar/article69486316.ece",
    "summary": "On April 24, 2025, the Indian Rupee made a modest recovery by gaining **16 paise** to settle at **85.29** against the US dollar, responding to a deceleration in the dollar's strength and a decline in crude oil prices. This uptick came after the Rupee had depreciated previously, with traders noting a **high of 85.25** and a **low of 85.67** during the trading session.\n\nKey highlights from this market activity include:\n\n• The **US dollar index** fell by **0.51%** to **99.33**, indicating reduced strength in the greenback.\n• Domestic traders attribute the Rupee's resilience to **weak US business activity**, as highlighted by the decline in **U.S. Treasury yields**, especially a drop of **3 basis points for the 10-year yield to 4.35%**.\n• Anuj Choudhary, a research analyst at Mirae Asset Sharekhan, suggested that while the Rupee is likely to maintain a **positive bias**, uncertainties related to trade tariffs might pose challenges ahead. He projected trading ranges for USD/INR between **85 to 85.70**.\n• The **Brent crude price** increased by **0.65%** to **$66.55 per barrel**, adding to the complexity of the foreign exchange scenario amid geopolitical tensions following a terror attack in **Pahalgam**, Jammu & Kashmir.\n\nThe broader market sentiment saw the **BSE Sensex** decline by **256.90 points** (0.32%) to **79,859.59 points** and the **Nifty 50** drop by **82.25 points** (0.34%) to **24,246.70 points**. Investor caution persists in light of escalating geopolitical tensions and economic indicators from the United States that could influence market dynamics in the coming days."
  },
  {
    "title": "Warren Buffett now owns 5% of all US Treasury bills, a larger holding than the Fed itself",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-now-owns-5-of-all-us-treasury-bills-a-larger-holding-than-the-fed-itself/articleshow/120583054.cms",
    "summary": "Billionaire investor *Warren Buffett* has made headlines with Berkshire Hathaway's significant investment in U.S. Treasury bills, accumulating a staggering **$300.87 billion**, which constitutes nearly **5%** of the total market for these short-term government securities. This position notably surpasses the holdings of the U.S. Federal Reserve, which owns just over **$195 billion** in Treasury securities. As of March 2025, total U.S. Treasury bill market assets are valued at around **$6.15 trillion**, indicating that Buffett essentially controls nearly **1 in every 20 dollars** in this market.\n\nThis strategic move signals Buffett's commitment to prioritizing **safety, yield, and liquidity** amidst elevated equity valuations and persistent global economic uncertainties. The portfolio represents **approximately 4.89%** of the current Treasury bill market, showcasing a decisive tilt towards defensive investing.\n\n**Key Highlights:**\n• **Defensive Strategy:** Buffett has significantly parked over **90%** of Berkshire's **$334 billion** cash reserves in short-term government debt.\n• **Yield Focus:** The current average yield on Treasury bills is **4.359%**, leading Buffett to favor these stable, government-backed instruments over riskier equity or credit options. \n• **Market Environment:** High valuations across equities have prompted Buffett to refrain from major acquisitions in recent years, indicating a cautious sentiment prevalent in his investment philosophy.\n\nIn summary, Buffett's extensive holdings in U.S. Treasury bills serve not only as a buffer against market volatility but also reflect a prudent wait for better investment opportunities. He describes this strategy as waiting for the \"fat pitch,\" symbolizing a pursuit for clear value opportunities in the market without hastening into expensive assets, a sentiment echoed by other major corporations such as **Apple**, which has also increased its Treasury holdings during this challenging market landscape."
  },
  {
    "title": "Sebi tweaks framework for ESG Rating Providers using subscriber-pays model",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-tweaks-framework-for-esg-rating-providers-using-subscriber-pays-model/articleshow/120582916.cms",
    "summary": "The Securities and Exchange Board of India (Sebi) has revised its framework for Environmental, Social, and Governance (ESG) Rating Providers (ERPs), particularly those operating under a subscriber-pays model. Key changes include:\n\n• **Simultaneous Report Sharing:** ERPs are now obligated to share ESG rating reports with both subscribers and the rated entity or issuer simultaneously. This change is aimed at increasing transparency in the rating process.\n\n• **Two-Day Comment Period:** The rated entity will have two working days to respond to the report with any comments, which must be taken into account by the ERP if there are differing viewpoints on the data presented in the report.\n\n• **Addendum Requirement:** Any clarifications or comments made by the rated entity within the specified period will be included as an addendum to the original ESG rating report.\n\n• **Public Disclosure:** ERPs are required to make their policies regarding the sharing of ESG rating reports public on their websites. This includes providing details on their ESG rating methodologies and assumptions.\n\n• **Revenue Model Definition:** The subscriber-pays model is defined as one wherein ERPs derive revenue from subscribing entities like banks and insurance companies. They must ensure that the ratings are based solely on publicly available information and that the fee from the rated entity is the lowest if it is a subscriber.\n\n• **Conflict of Interest Regulation:** Only group companies or associates of entities needing ESG ratings can subscribe, ensuring no conflicts of interest that may lead to misuse.\n\n• **Regulatory Authority Compliance:** ERPs must disclose the financial sector regulators under which they operate and adhere to relevant regulations.\n\nThese modifications are designed to enhance clarity and trust in the ESG rating process, encouraging responsible and transparent market practices."
  },
  {
    "title": "NTPC Green Energy to consider raising up to Rs 5,000 cr via bonds next week",
    "url": "https://economictimes.indiatimes.com/markets/bonds/ntpc-green-energy-to-consider-raising-up-to-rs-5000-cr-via-bonds-next-week/articleshow/120582818.cms",
    "summary": "The NTPC Green Energy Ltd (NGEL) board is scheduled to meet on April 29, 2025, to deliberate on a proposal to raise up to ₹5,000 crore through bond issuance. This funding will be obtained in one or more tranches during the fiscal year 2025-26. NGEL serves as the umbrella entity for the green initiatives associated with NTPC, a prominent state-owned power utility in India. \n\nKey details include:\n\n• **Amount to be Raised:** Up to ₹5,000 crore.\n• **Method of Fund Raising:** Issuance of secured/unsecured, redeemable, taxable/tax-free bonds or non-convertible debentures (NCDs).\n• **Purpose:** To support NGEL's green energy projects and initiatives.\n\nThis financial strategy aims to bolster NTPC's commitment to sustainable energy solutions and expand its portfolio in the renewable sector."
  },
  {
    "title": "Government waives upfront payment, offers rebates instead to expedite underground coal mining",
    "url": "https://www.thehindu.com/business/Industry/government-waives-upfront-payment-offers-rebates-instead-to-expedite-underground-coal-mining/article69486138.ece",
    "summary": "In an effort to enhance the operational efficiency of India's underground coal mining sector, the government unveiled several substantial incentives on April 24, 2025. The Ministry of Coal announced that the mandatory upfront payment for underground mining projects will be completely waived, aimed at alleviating financial burdens and attracting more private sector involvement. This policy shift reflects a broader commitment to accelerate the development of underground coal resources, which are typically seen as more environmentally sustainable compared to surface mining due to reduced ecological disruption.\n\nKey elements of the new incentives include:\n\n• **Reduction in Revenue Share**: The percentage of revenue share required from underground coal mines has been cut from 4% to 2%, significantly alleviating financial pressures on operators and making projects more economically viable.\n\n• **Waiving Upfront Payments**: By eliminating the upfront payment requirement, the government is facilitating quicker project initiation and encouraging more firms to enter the market.\n\n• **Performance Security Rebate**: An existing 50% rebate on performance security is retained, further lowering the entry barriers for investors.\n\n• **Encouraging Advanced Technologies**: The initiatives promote the adoption of advanced mining technologies and practices, including continuous miners and AI-based safety mechanisms, which are expected to enhance productivity and maintain ecological balance.\n\nAdditionally, the government anticipates the operationalization of 20 new coal mines by the end of the year, signaling a robust commitment to rejuvenate the coal sector in alignment with India's strategic focus on sustainable energy production. The reforms are designed to address challenges related to high initial investments and prolonged project completion times, reinforcing the government's objective of revitalizing the coal industry while adhering to environmental standards."
  },
  {
    "title": "Rupee gains on exporters' dollar sales, holds on to key support level",
    "url": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-gains-on-exporters-dollar-sales-holds-on-to-key-support-level/articleshow/120582340.cms",
    "summary": "The Indian rupee concluded higher on April 24, 2025, bolstered by exporter dollar sales and the failure of speculators to drive the currency below a critical support level. The rupee rose by 0.2%, closing at **85.26** per U.S. dollar, up from a previous close of **85.42**. Despite dipping to an intraday low of **85.6625**, it rebounded as it stayed above the crucial support zone of **85.70-85.80**, which financial analysts believe will act as a stabilizing factor unless there is a marked decrease in the dollar index.\n\nKey insights include:\n\n• **Support Levels:** Current support appears near **85.80** and potential resistance is seen around **85.00**.\n• **Market Analysis:** Analysts such as Sugandha Sachdeva, founder of SS WealthStreet, suggest that the rupee may consolidate within this range unless significant changes in the dollar index occur.\n• **External Influences:** The dollar index weakened following President Trump's easing of tensions regarding the Federal Reserve and tariff discussions with China. This broadly influenced currency markets.\n• **Investment Implications:** Rising geopolitical concerns, particularly tensions between India and Pakistan, have tempered the rupee's gains, contributing to increased dollar/rupee forward premiums.\n\nOverall, while the rupee showed resilience against a backdrop of international market fluctuations, its trajectory remains closely tied to external economic developments and geopolitical stability in the region."
  },
  {
    "title": "India expects steel imports to slow from China, South Korea, and Japan, Government source says",
    "url": "https://www.thehindu.com/business/Industry/india-expects-steel-imports-to-slow-from-china-south-korea-and-japan-government-source-says/article69485938.ece",
    "summary": "India is anticipating a decrease in steel imports from major exporters like China, South Korea, and Japan following the imposition of a **12% provisional safeguard duty** on certain steel products for a duration of **200 days**. This move is part of the government's efforts to manage rising steel imports, which had reached a **nine-year high** during fiscal year 2025. \n\nKey details include:\n\n• **Imposition of Tariff:** The safeguard duty will target various finished steel products, aimed at curbing the inflow of imports that have surged in recent years.\n\n• **Government Source Insights:** According to an unnamed official, the primary exporters of steel—China, South Korea, and Japan—are expected to significantly reduce their shipments to India as a consequence of the new tariff.\n\n• **Local Reactions:** South Korean companies, including major suppliers like **POSCO** and **Hyundai**, have expressed opposition to the imposition of this duty.\n\n• **Market Trends:** With India's status as the world’s second-largest producer of crude steel, experts suggest that the new tariff may redirect imports from countries facing tariffs in the U.S. toward India.\n\nAs a result of these developments, the economic landscape surrounding India's steel industry is likely to witness significant shifts, influencing both domestic production and international trade dynamics."
  },
  {
    "title": "Devyani International To Acquire Majority Stake In Sky Gate Hospitality For Rs 419.6 Crore",
    "url": "https://www.ndtvprofit.com/business/devyani-international-to-acquire-majority-stake-in-sky-gate-hospitality-for-rs-4196-crore",
    "summary": "Devyani International Ltd. has announced its intention to acquire an **80.72% equity stake** in **Sky Gate Hospitality Pvt. Ltd.** and its subsidiaries for a sum of **₹419.6 crore**. This acquisition is significant as Sky Gate operates popular food brands including **Biryani by Kilo**, **Goila Butter Chicken**, and **The Bhojan**, cultivating a strong presence through over **100 outlets** across more than **40 cities** in India. Notably, Sky Gate pioneered the **'handi biryani'** concept, providing freshly made biryani.\n\nAfter the completion of this transaction, which includes contingent consideration as per the terms, Sky Gate will function as a **subsidiary** of Devyani International. This strategic move will allow Devyani to broaden its product portfolio by integrating **Indian cuisine brands**, thereby enhancing its offerings in the fast-growing quick service restaurant (QSR) sector of India.\n\nRavi Jaipuria, the non-executive chairman of Devyani International, noted the acquisition's strategic importance in diversifying their portfolio with traditional Indian flavors, capitalizing on the popularity of the brands being acquired. Founders **Kaushik Roy** and **Vishal Jindal** expressed confidence that their brands would flourish under the guidance and experience of Devyani International, aiming to improve customer engagement and overall service delivery.\n\nCurrently, Devyani International operates notable global brands like **KFC**, **Pizza Hut**, and **Costa Coffee** through franchise agreements and continues to expand its portfolio, which now includes **10 unique food and beverage brands**, with recent additions being **Tealive**, **Sanook Kitchen**, and **New York Fries**. This expansion marks Devyani's commitment to becoming a leading player in the Indian QSR market amidst evolving consumer preferences towards diverse dining experiences."
  },
  {
    "title": "Stock Market Highlights: Nifty, Sensex Snaps Seven-Day Winning Streak As ICICI Bank, Airtel Weigh",
    "url": "https://www.ndtvprofit.com/markets/stock-market-news-today-nifty-50-sensex-nifty-bank-closing-level-on-24-04-2025",
    "summary": "On April 24, 2025, the Indian stock market's Nifty 50 and Sensex indices ended their seven-day winning streak, with the Nifty down by 0.34% at 24,246.70 and the Sensex dropping 0.39% to 79,801.43. Key factors impacting the market included declining share prices of **ICICI Bank Ltd.** and **Bharti Airtel Ltd.**, which pulled down the benchmarks. Specifically, the Nifty touched a low of 24,232.3, while the Sensex fell to 79,785.56 during the session.\n\nKey Details:\n- **Market Movement:**\n  • Nifty 50 fell by **82.25 points** (0.34%).\n  • Sensex decreased by **315.06 points** (0.39%).\n  \n- **Performance Influencers:**\n  • ICICI Bank and Bharti Airtel were significant contributors to the declines.\n  • The IT sector saw losses, with Nifty IT dropping **0.61%** to 35,197.3.\n\n- **Market Sentiment:**\n  • Analysts indicated that upcoming global cues and quarterly earnings would heavily influence future market directions.\n  • The current sentiment was characterized by profit-booking and expected range-bound trading as market breadth indicated stronger selling pressure.\n\n- **Sector Performance:**\n  • On the NSE, **10 sectoral indices** declined while only **two advanced**.\n  • The Nifty Pharma sector experienced the most growth, whereas the Nifty Realty sector faced the steepest decline.\n\n- **Market Breadth:**\n  • Approximately **1,143 stocks declined**, whereas **953 stocks advanced**, indicating a predominantly bearish sentiment in the market.\n\nOverall, while there were stocks cushioning the declines—such as **Reliance Industries Ltd.**, **UltraTech Cement Ltd.**, **Tata Motors Ltd.**, and **Sun Pharmaceutical Industries Ltd.**—the overall market direction remains cautious as investors await further earnings reports and guidance from global markets."
  },
  {
    "title": "Market Wrap: D-Street snaps 7-day rally as geopolitical tensions drag; Sensex sheds 315 pts, Nifty below 24,300",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-snaps-7-day-rally-as-geopolitical-tensions-drag-sensex-sheds-315-pts-nifty-below-24300/articleshow/120582165.cms",
    "summary": "Indian benchmark indices experienced a decline on April 24, 2025, breaking a seven-session rally marked by solid gains. The BSE Sensex fell by 315.06 points (0.39%) to close at 79,801.43, while the Nifty 50 decreased by 82.25 points (0.34%) to settle at 24,246.70. The total market capitalization for all listed companies on the BSE dropped by approximately ₹1.63 lakh crore to ₹429.63 lakh crore.\n\n**Sector Performance:**\n• **Financials and IT:** The financial services and information technology sectors saw declines of 0.5% and 0.3% respectively. Notable banks including ICICI Bank and HDFC Bank decreased by 1.6% and 0.5%.\n• **Geopolitical Tensions:** The market downturn was influenced by heightened geopolitical tensions following a terrorist attack in Jammu and Kashmir that resulted in 26 casualties, prompting India to lower diplomatic ties with Pakistan.\n• **Stock Movements:** Hindustan Unilever witnessed a significant drop of 4.1%, while Nestle India remained flat due to higher costs affecting profitability. In contrast, Samhi Hotels surged 11.1% after announcing a joint venture to develop high-end hotels in India.\n\n**Market Insights:**\nVinod Nair, Head of Research at Geojit Investments, noted that profit booking occurred in the domestic market after a rally, alongside global selling pressure as uncertainties regarding U.S.-China tariff disputes emerged. Analysts suggest a focus on stock selection during this period of market consolidation, emphasizing the potential for recovery in the fast-moving consumer goods (FMCG) sector due to favorable input prices and improvement in demand.\n\n**Global Market Context:**\nOn the global stage, Asian stocks declined with the MSCI index down 0.72%. U.S. futures mirrored this weakness with slight drops noted. Conversely, Japan's Nikkei increased by 0.4%. Commodity prices saw gold rising to near-record highs, while oil prices also experienced a modest recovery.\n\n**Currency Movements:**\nThe Indian rupee strengthened by 0.2% against the U.S. dollar, closing at 85.26.\n\nIn summary, the market's retreat reflects both local and global uncertainties, with analysts recommending strategic stock selection as the indices consolidate post-rally."
  },
  {
    "title": "SAMHI Hotels shares shoot up 13% on Rs 2,200 cr JV with GIC",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/samhi-hotels-shares-shoot-up-13-on-rs-2200-cr-jv-with-gic/articleshow/120581999.cms",
    "summary": "Shares of SAMHI Hotels experienced a notable rise of **13%**, reaching an intraday high of **Rs 196.90** on the Bombay Stock Exchange (BSE) following the announcement of a **Rs 2,200 crore** joint venture with global investment firm GIC. This partnership is directed towards the formation of an investment platform focused on upscale hospitality assets in India, initially encompassing five hotel properties located in high-demand areas of **Bengaluru** and **Pune**. \n\nKey details from the partnership include:\n\n• **Asset Overview**: The joint venture will kick off with five properties that collectively provide over **1,000 rooms**. The properties comprise:\n   - Hyatt Regency, Pune (301 rooms, with 22 additional apartments in progress)\n   - Courtyard by Marriott, Bengaluru, Outer Ring Road (176 rooms)\n   - Fairfield by Marriott, Bengaluru, ORR (160 rooms)\n   - Trinity Hotel, Bengaluru, Whitefield (142 rooms, soon to be included in Marriott's Tribute Portfolio)\n   - A new 220-room Westin Hotel, being integrated with the Trinity property.\n\n• **Strategic Goals**: \n   - The funds raised will be allocated for **expansion**, **future acquisitions**, and the reduction of **debt** across SAMHI's portfolio.\n   - SAMHI will maintain **operational control** and strategic direction of the assets.\n\n• **Statements from Leadership**: Ashish Jakhanwala, CEO and Managing Director of SAMHI, expressed optimism about the partnership, stating it would not only enhance their balance sheet but also provide substantial growth opportunities for portfolio expansion through their \"category conversion\" strategy. This strategy aims to reposition and upgrade hotel properties to meet global standards.\n\n• **Advisory**: Morgan Stanley served as the exclusive financial advisor to SAMHI for this transaction.\n\nIn summary, the collaboration with GIC is expected to solidify SAMHI's market position and facilitate its growth in the upscale hotel sector significantly."
  },
  {
    "title": "IndiGo Names Former FAA Administrator Michael Whitaker As Independent Director",
    "url": "https://www.ndtvprofit.com/business/indigo-names-former-faa-administrator-michael-whitaker-as-independent-director",
    "summary": "InterGlobe Aviation, the parent company of India’s largest airline, IndiGo, has recently appointed **Michael Whitaker**, the former Administrator of the Federal Aviation Administration (FAA) in the United States, as an **Independent Director**. Whitaker brings with him *significant experience in aviation*, having served as FAA Administrator and as a private pilot. His appointment, which is pending regulatory and shareholder approvals, comes at a time when IndiGo is preparing for strategic expansions and focusing on operational efficiency and air safety. \n\nWhitaker’s career spans over three decades in aviation, including roles such as COO of Supernal (Hyundai's advanced air mobility unit) and a senior vice president at United Airlines. He initially began his professional journey as a lawyer for Trans World Airlines. Whitaker expressed his honor at joining the board of IndiGo, reflecting the company's growth into a leading global airline. His predecessor, Venkataramani Sumantran, who has opted not to renew his term, has been with IndiGo and notably contributed to its governance as Chairperson.\n\nIndiGo currently operates more than 2,200 flights daily with a fleet exceeding 400 aircraft, reinforcing its position in the competitive aviation market. Whitaker’s expertise is expected to enhance the effectiveness and diversity of IndiGo's board, particularly as the airline navigates the complexities of international governance amid its global expansion efforts."
  },
  {
    "title": "Stocks to Buy | Venugopal Garre's portfolio strategy in a volatile market",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-venugopal-garres-portfolio-strategy-in-a-volatile-market/slideshow/120581991.cms",
    "summary": "Venugopal Garre, Managing Director of Bernstein, has expressed a positive outlook for India's financial market in 2025, projecting the Nifty index to reach **26,500**. This forecast is underpinned by improving macroeconomic conditions despite ongoing global uncertainties. Here are the detailed insights from his recent discussion:\n\n• **Market Conditions**: Garre emphasizes a strengthening of India's economic fundamentals, suggesting that the nation's macroeconomic situation has bottomed out and is on a recovery path.\n\n• **Thesis Review**: His initial expectations included rate cuts to bolster economic recovery. A 50 basis point rate reduction has already occurred, reinforcing his outlook.\n\n• **Global Risks as Opportunities**: He interprets existing global uncertainties as potentially favorable for India, suggesting they could lead to additional rate cuts and loosened liquidity by the Reserve Bank of India (RBI).\n\n• **Growth Predictions**: While he anticipates an increase in capital expenditure and consumption, he does not foresee explosive growth, advocating for a balanced approach.\n\n• **Currency Risks**: Garre expresses caution regarding the depreciation of the Indian Rupee, particularly due to trade tensions with the U.S. and developments concerning the Chinese currency.\n\n• **Portfolio Strategy**: In light of market volatility, he advises a cautious investment strategy focused on sectors that are beginning to show recovery. His portfolio is overweight on financials, telecommunications, and utilities, while underweight in healthcare. Specific stock recommendations include **Bharti Airtel**, **Adani Ports**, and **Avenue Supermarts**.\n\nGarre's insights reflect a careful yet optimistic strategy, balancing growth in recovering sectors with defensive positions to navigate potential risks associated with currency movements and international trade tensions."
  },
  {
    "title": "Steel Industry Should Speed Up Mining At Unused Greenfield Mines, Says PM Modi",
    "url": "https://www.ndtvprofit.com/business/steel-industry-should-speed-up-mining-at-unused-greenfield-mines-says-pm-modi",
    "summary": "Prime Minister **Narendra Modi** addressed the steel industry at the **India Steel 2025** virtual event, emphasizing the necessity for accelerated mining operations at **unused greenfield iron ore mines**. His message conveyed the importance of enhancing steel production capabilities within India to prepare for future demands.\n\nKey points from his address include:\n\n• **Industry Preparedness:** PM Modi highlighted the urgency for the steel sector to modernize by adopting innovative processes, evolving to new grades of steel, and scaling operations effectively.\n\n• **Global Partnerships:** He called on the industry to strengthen **global collaborations** and secure supply chains to mitigate challenges associated with the dependence on raw material imports.\n\n• **Raw Material Challenges:** The Prime Minister stressed the necessity for India to reduce its reliance on coal imports through alternatives like **coal gasification** and enhanced resource utilization.\n\n• **Vision for Steel India:** He encouraged the industry to crystallize a vision for a \"resilient, revolutionary, and steel-strong India.\" \n\nThe speech was part of the Indian government’s ongoing efforts to boost domestic manufacturing capabilities, particularly in the steel sector, critical for infrastructure development and economic growth."
  },
  {
    "title": "NSE raises entry bar for SMEs seeking main board migration",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/nse-raises-entry-bar-for-smes-seeking-main-board-migration/articleshow/120581071.cms",
    "summary": "The National Stock Exchange (NSE) of India has revised its eligibility criteria for small and medium enterprises (SMEs) aiming to migrate from the SME platform to the main board. The new regulations, effective immediately as of April 24, 2025, impose stricter requirements aimed at enhancing investor confidence and ensuring market discipline.\n\n• **Listing Duration:** SMEs must be listed on the SME platform for a minimum of three years before applying for migration.\n• **Operational Revenue:** Companies are required to have recorded operational revenue exceeding **Rs 100 crore** in the previous financial year.\n• **Profit Requirements:** It is necessary for SMEs to exhibit a positive operating profit in at least two of the last three financial years.\n• **Equity Capital:** A minimum paid-up equity capital of **Rs 10 crore** is mandatory.\n• **Net Worth:** Companies must demonstrate a net worth of no less than **Rs 75 crore**.\n• **Shareholder Requirement:** A minimum of **500 public shareholders** must be maintained at the time of application.\n• **Promoter and Regulatory Compliance:** Promoters and promoter groups are required to retain at least **20%** ownership during the application process. Additionally, companies must not be undergoing any proceedings under the Insolvency and Bankruptcy Code (IBC) and must resolve all investor complaints via the Securities and Exchange Board of India’s (SEBI) SCORES platform.\n\nThis revised framework is designed to filter out less established SMEs, thus promoting only those firms with solid financial foundations for main board listing. The enhancements signify a proactive approach by the NSE to foster a more robust trading environment and to mitigate risks associated with the migration of lower-tier companies."
  }
]